hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
/*
; stm32N657_rcc.
; ==============

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:	Generated using the .svd description	The 2025-01-01
; Modifs:
;
; Project:	uKOS-X
; Goal:		stm32N657_rcc equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma	once

// RCC address definitions
// -----------------------

typedef struct {
	volatile	uint32_t	CR;
	volatile	uint32_t	SR;
	volatile	uint32_t	STOPCR;
	volatile	uint32_t	RESERVED0[5];
	volatile	uint32_t	CFGR1;
	volatile	uint32_t	CFGR2;
	volatile	uint32_t	CKPROTR;
	volatile	uint32_t	BDCR;
	volatile	uint32_t	HWRSR;
	volatile	uint32_t	RSR;
	volatile	uint32_t	RESERVED1[2];
	volatile	uint32_t	LSECFGR;
	volatile	uint32_t	MSICFGR;
	volatile	uint32_t	HSICFGR;
	volatile	uint32_t	HSIMCR;
	volatile	uint32_t	HSIMSR;
	volatile	uint32_t	HSECFGR;
	volatile	uint32_t	RESERVED2[10];
	volatile	uint32_t	PLL1CFGR1;
	volatile	uint32_t	PLL1CFGR2;
	volatile	uint32_t	PLL1CFGR3;
	volatile	uint32_t	RESERVED3;
	volatile	uint32_t	PLL2CFGR1;
	volatile	uint32_t	PLL2CFGR2;
	volatile	uint32_t	PLL2CFGR3;
	volatile	uint32_t	RESERVED4;
	volatile	uint32_t	PLL3CFGR1;
	volatile	uint32_t	PLL3CFGR2;
	volatile	uint32_t	PLL3CFGR3;
	volatile	uint32_t	RESERVED5;
	volatile	uint32_t	PLL4CFGR1;
	volatile	uint32_t	PLL4CFGR2;
	volatile	uint32_t	PLL4CFGR3;
	volatile	uint32_t	RESERVED6[2];
	volatile	uint32_t	IC1CFGR;
	volatile	uint32_t	IC2CFGR;
	volatile	uint32_t	IC3CFGR;
	volatile	uint32_t	IC4CFGR;
	volatile	uint32_t	IC5CFGR;
	volatile	uint32_t	IC6CFGR;
	volatile	uint32_t	IC7CFGR;
	volatile	uint32_t	IC8CFGR;
	volatile	uint32_t	IC9CFGR;
	volatile	uint32_t	IC10CFGR;
	volatile	uint32_t	IC11CFGR;
	volatile	uint32_t	IC12CFGR;
	volatile	uint32_t	IC13CFGR;
	volatile	uint32_t	IC14CFGR;
	volatile	uint32_t	IC15CFGR;
	volatile	uint32_t	IC16CFGR;
	volatile	uint32_t	IC17CFGR;
	volatile	uint32_t	IC18CFGR;
	volatile	uint32_t	IC19CFGR;
	volatile	uint32_t	IC20CFGR;
	volatile	uint32_t	RESERVED7[4];
	volatile	uint32_t	CIER;
	volatile	uint32_t	CIFR;
	volatile	uint32_t	CICR;
	volatile	uint32_t	RESERVED8[5];
	volatile	uint32_t	CCIPR1;
	volatile	uint32_t	CCIPR2;
	volatile	uint32_t	CCIPR3;
	volatile	uint32_t	CCIPR4;
	volatile	uint32_t	CCIPR5;
	volatile	uint32_t	CCIPR6;
	volatile	uint32_t	CCIPR7;
	volatile	uint32_t	CCIPR8;
	volatile	uint32_t	CCIPR9;
	volatile	uint32_t	RESERVED9[2];
	volatile	uint32_t	CCIPR12;
	volatile	uint32_t	CCIPR13;
	volatile	uint32_t	CCIPR14;
	volatile	uint32_t	RESERVED10[34];
	volatile	uint32_t	BUSRSTR;
	volatile	uint32_t	MISCRSTR;
	volatile	uint32_t	MEMRSTR;
	volatile	uint32_t	AHB1RSTR;
	volatile	uint32_t	AHB2RSTR;
	volatile	uint32_t	AHB3RSTR;
	volatile	uint32_t	AHB4RSTR;
	volatile	uint32_t	AHB5RSTR;
	volatile	uint32_t	APB1LRSTR;
	volatile	uint32_t	APB1HRSTR;
	volatile	uint32_t	APB2RSTR;
	volatile	uint32_t	RESERVED11;
	volatile	uint32_t	APB4LRSTR;
	volatile	uint32_t	APB4HRSTR;
	volatile	uint32_t	APB5RSTR;
	volatile	uint32_t	DIVENR;
	volatile	uint32_t	BUSENR;
	volatile	uint32_t	MISCENR;
	volatile	uint32_t	MEMENR;
	volatile	uint32_t	AHB1ENR;
	volatile	uint32_t	AHB2ENR;
	volatile	uint32_t	AHB3ENR;
	volatile	uint32_t	AHB4ENR;
	volatile	uint32_t	AHB5ENR;
	volatile	uint32_t	APB1LENR;
	volatile	uint32_t	APB1HENR;
	volatile	uint32_t	APB2ENR;
	volatile	uint32_t	APB3ENR;
	volatile	uint32_t	APB4LENR;
	volatile	uint32_t	APB4HENR;
	volatile	uint32_t	APB5ENR;
	volatile	uint32_t	DIVLPENR;
	volatile	uint32_t	BUSLPENR;
	volatile	uint32_t	MISCLPENR;
	volatile	uint32_t	MEMLPENR;
	volatile	uint32_t	AHB1LPENR;
	volatile	uint32_t	AHB2LPENR;
	volatile	uint32_t	AHB3LPENR;
	volatile	uint32_t	AHB4LPENR;
	volatile	uint32_t	AHB5LPENR;
	volatile	uint32_t	APB1LLPENR;
	volatile	uint32_t	APB1HLPENR;
	volatile	uint32_t	APB2LPENR;
	volatile	uint32_t	APB3LPENR;
	volatile	uint32_t	APB4LLPENR;
	volatile	uint32_t	APB4HLPENR;
	volatile	uint32_t	APB5LPENR;
	volatile	uint32_t	RESERVED12[99];
	volatile	uint32_t	RDCR;
	volatile	uint32_t	RESERVED13[204];
	volatile	uint32_t	SECCFGR0;
	volatile	uint32_t	PRIVCFGR0;
	volatile	uint32_t	LOCKCFGR0;
	volatile	uint32_t	PUBCFGR0;
	volatile	uint32_t	SECCFGR1;
	volatile	uint32_t	PRIVCFGR1;
	volatile	uint32_t	LOCKCFGR1;
	volatile	uint32_t	PUBCFGR1;
	volatile	uint32_t	SECCFGR2;
	volatile	uint32_t	PRIVCFGR2;
	volatile	uint32_t	LOCKCFGR2;
	volatile	uint32_t	PUBCFGR2;
	volatile	uint32_t	SECCFGR3;
	volatile	uint32_t	PRIVCFGR3;
	volatile	uint32_t	LOCKCFGR3;
	volatile	uint32_t	PUBCFGR3;
	volatile	uint32_t	SECCFGR4;
	volatile	uint32_t	PRIVCFGR4;
	volatile	uint32_t	LOCKCFGR4;
	volatile	uint32_t	PUBCFGR4;
	volatile	uint32_t	PUBCFGR5;
	volatile	uint32_t	RESERVED14[11];
	volatile	uint32_t	CSR;
	volatile	uint32_t	RESERVED15;
	volatile	uint32_t	STOPCSR;
	volatile	uint32_t	RESERVED16[126];
	volatile	uint32_t	BUSRSTSR;
	volatile	uint32_t	MISCRSTSR;
	volatile	uint32_t	MEMRSTSR;
	volatile	uint32_t	AHB1RSTSR;
	volatile	uint32_t	AHB2RSTSR;
	volatile	uint32_t	AHB3RSTSR;
	volatile	uint32_t	AHB4RSTSR;
	volatile	uint32_t	AHB5RSTSR;
	volatile	uint32_t	APB1LRSTSR;
	volatile	uint32_t	APB1HRSTSR;
	volatile	uint32_t	APB2RSTSR;
	volatile	uint32_t	RESERVED17;
	volatile	uint32_t	APB4LRSTSR;
	volatile	uint32_t	APB4HRSTSR;
	volatile	uint32_t	APB5RSTSR;
	volatile	uint32_t	DIVENSR;
	volatile	uint32_t	BUSENSR;
	volatile	uint32_t	MISCENSR;
	volatile	uint32_t	MEMENSR;
	volatile	uint32_t	AHB1ENSR;
	volatile	uint32_t	AHB2ENSR;
	volatile	uint32_t	AHB3ENSR;
	volatile	uint32_t	AHB4ENSR;
	volatile	uint32_t	AHB5ENSR;
	volatile	uint32_t	APB1LENSR;
	volatile	uint32_t	APB1HENSR;
	volatile	uint32_t	APB2ENSR;
	volatile	uint32_t	APB3ENSR;
	volatile	uint32_t	APB4LENSR;
	volatile	uint32_t	APB4HENSR;
	volatile	uint32_t	APB5ENSR;
	volatile	uint32_t	DIVLPENSR;
	volatile	uint32_t	BUSLPENSR;
	volatile	uint32_t	MISCLPENSR;
	volatile	uint32_t	MEMLPENSR;
	volatile	uint32_t	AHB1LPENSR;
	volatile	uint32_t	AHB2LPENSR;
	volatile	uint32_t	AHB3LPENSR;
	volatile	uint32_t	AHB4LPENSR;
	volatile	uint32_t	AHB5LPENSR;
	volatile	uint32_t	APB1LLPENSR;
	volatile	uint32_t	APB1HLPENSR;
	volatile	uint32_t	APB2LPENSR;
	volatile	uint32_t	APB3LPENSR;
	volatile	uint32_t	APB4LLPENSR;
	volatile	uint32_t	APB4HLPENSR;
	volatile	uint32_t	APB5LPENSR;
	volatile	uint32_t	RESERVED18[305];
	volatile	uint32_t	PRIVCFGSR0;
	volatile	uint32_t	RESERVED19;
	volatile	uint32_t	PUBCFGSR0;
	volatile	uint32_t	RESERVED20;
	volatile	uint32_t	PRIVCFGSR1;
	volatile	uint32_t	RESERVED21;
	volatile	uint32_t	PUBCFGSR1;
	volatile	uint32_t	RESERVED22;
	volatile	uint32_t	PRIVCFGSR2;
	volatile	uint32_t	RESERVED23;
	volatile	uint32_t	PUBCFGSR2;
	volatile	uint32_t	SECCFGSR3;
	volatile	uint32_t	PRIVCFGSR3;
	volatile	uint32_t	LOCKCFGSR3;
	volatile	uint32_t	PUBCFGSR3;
	volatile	uint32_t	RESERVED24;
	volatile	uint32_t	PRIVCFGSR4;
	volatile	uint32_t	RESERVED25;
	volatile	uint32_t	PUBCFGSR4;
	volatile	uint32_t	PUBCFGSR5;
	volatile	uint32_t	RESERVED26[11];
	volatile	uint32_t	CCR;
	volatile	uint32_t	RESERVED27;
	volatile	uint32_t	STOPCCR;
	volatile	uint32_t	RESERVED28[126];
	volatile	uint32_t	BUSRSTCR;
	volatile	uint32_t	MISCRSTCR;
	volatile	uint32_t	MEMRSTCR;
	volatile	uint32_t	AHB1RSTCR;
	volatile	uint32_t	AHB2RSTCR;
	volatile	uint32_t	AHB3RSTCR;
	volatile	uint32_t	AHB4RSTCR;
	volatile	uint32_t	AHB5RSTCR;
	volatile	uint32_t	APB1LRSTCR;
	volatile	uint32_t	APB1HRSTCR;
	volatile	uint32_t	APB2RSTCR;
	volatile	uint32_t	RESERVED29;
	volatile	uint32_t	APB4LRSTCR;
	volatile	uint32_t	APB4HRSTCR;
	volatile	uint32_t	APB5RSTCR;
	volatile	uint32_t	DIVENCR;
	volatile	uint32_t	BUSENCR;
	volatile	uint32_t	MISCENCR;
	volatile	uint32_t	MEMENCR;
	volatile	uint32_t	AHB1ENCR;
	volatile	uint32_t	AHB2ENCR;
	volatile	uint32_t	AHB3ENCR;
	volatile	uint32_t	AHB4ENCR;
	volatile	uint32_t	AHB5ENCR;
	volatile	uint32_t	APB1LENCR;
	volatile	uint32_t	APB1HENCR;
	volatile	uint32_t	APB2ENCR;
	volatile	uint32_t	APB3ENCR;
	volatile	uint32_t	APB4LENCR;
	volatile	uint32_t	APB4HENCR;
	volatile	uint32_t	APB5ENCR;
	volatile	uint32_t	DIVLPENCR;
	volatile	uint32_t	BUSLPENCR;
	volatile	uint32_t	MISCLPENCR;
	volatile	uint32_t	MEMLPENCR;
	volatile	uint32_t	AHB1LPENCR;
	volatile	uint32_t	AHB2LPENCR;
	volatile	uint32_t	AHB3LPENCR;
	volatile	uint32_t	AHB4LPENCR;
	volatile	uint32_t	AHB5LPENCR;
	volatile	uint32_t	APB1LLPENCR;
	volatile	uint32_t	APB1HLPENCR;
	volatile	uint32_t	APB2LPENCR;
	volatile	uint32_t	APB3LPENCR;
	volatile	uint32_t	APB4LLPENCR;
	volatile	uint32_t	APB4HLPENCR;
	volatile	uint32_t	APB5LPENCR;
	volatile	uint32_t	RESERVED30[305];
	volatile	uint32_t	PRIVCFGCR0;
	volatile	uint32_t	RESERVED31;
	volatile	uint32_t	PUBCFGCR0;
	volatile	uint32_t	RESERVED32;
	volatile	uint32_t	PRIVCFGCR1;
	volatile	uint32_t	RESERVED33;
	volatile	uint32_t	PUBCFGCR1;
	volatile	uint32_t	RESERVED34;
	volatile	uint32_t	PRIVCFGCR2;
	volatile	uint32_t	RESERVED35;
	volatile	uint32_t	PUBCFGCR2;
	volatile	uint32_t	RESERVED36;
	volatile	uint32_t	PRIVCFGCR3;
	volatile	uint32_t	RESERVED37;
	volatile	uint32_t	PUBCFGCR3;
	volatile	uint32_t	RESERVED38;
	volatile	uint32_t	PRIVCFGCR4;
	volatile	uint32_t	RESERVED39;
	volatile	uint32_t	PUBCFGCR4;
	volatile	uint32_t	PUBCFGCR5;
} RCC_TypeDef;

#if (defined(__cplusplus))
#define	RCC_NS	reinterpret_cast<RCC_TypeDef *>(0x46028000u)
#define	RCC_S	reinterpret_cast<RCC_TypeDef *>(0x56028000u)

#else
#define	RCC_NS	((RCC_TypeDef *)0x46028000u)
#define	RCC_S	((RCC_TypeDef *)0x56028000u)
#endif

