hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
// CR Configuration

#define	RCC_CR_PLL4ON							(0x1u<<11)
#define	RCC_CR_PLL3ON							(0x1u<<10)
#define	RCC_CR_PLL2ON							(0x1u<<9)
#define	RCC_CR_PLL1ON							(0x1u<<8)
#define	RCC_CR_HSEON							(0x1u<<4)
#define	RCC_CR_HSION							(0x1u<<3)
#define	RCC_CR_MSION							(0x1u<<2)
#define	RCC_CR_LSEON							(0x1u<<1)
#define	RCC_CR_LSION							(0x1u<<0)

#define	RCC_CR_PLL4ON_B_0X0						(0x0u<<11)
#define	RCC_CR_PLL4ON_B_0X1						(0x1u<<11)
#define	RCC_CR_PLL3ON_B_0X0						(0x0u<<10)
#define	RCC_CR_PLL3ON_B_0X1						(0x1u<<10)
#define	RCC_CR_PLL2ON_B_0X0						(0x0u<<9)
#define	RCC_CR_PLL2ON_B_0X1						(0x1u<<9)
#define	RCC_CR_PLL1ON_B_0X0						(0x0u<<8)
#define	RCC_CR_PLL1ON_B_0X1						(0x1u<<8)
#define	RCC_CR_HSEON_B_0X0						(0x0u<<4)
#define	RCC_CR_HSEON_B_0X1						(0x1u<<4)
#define	RCC_CR_HSION_B_0X0						(0x0u<<3)
#define	RCC_CR_HSION_B_0X1						(0x1u<<3)
#define	RCC_CR_MSION_B_0X0						(0x0u<<2)
#define	RCC_CR_MSION_B_0X1						(0x1u<<2)
#define	RCC_CR_LSEON_B_0X0						(0x0u<<1)
#define	RCC_CR_LSEON_B_0X1						(0x1u<<1)
#define	RCC_CR_LSION_B_0X0						(0x0u<<0)
#define	RCC_CR_LSION_B_0X1						(0x1u<<0)

// SR Configuration

#define	RCC_SR_PLL4RDY							(0x1u<<11)
#define	RCC_SR_PLL3RDY							(0x1u<<10)
#define	RCC_SR_PLL2RDY							(0x1u<<9)
#define	RCC_SR_PLL1RDY							(0x1u<<8)
#define	RCC_SR_HSERDY							(0x1u<<4)
#define	RCC_SR_HSIRDY							(0x1u<<3)
#define	RCC_SR_MSIRDY							(0x1u<<2)
#define	RCC_SR_LSERDY							(0x1u<<1)
#define	RCC_SR_LSIRDY							(0x1u<<0)

#define	RCC_SR_PLL4RDY_B_0X0					(0x0u<<11)
#define	RCC_SR_PLL4RDY_B_0X1					(0x1u<<11)
#define	RCC_SR_PLL3RDY_B_0X0					(0x0u<<10)
#define	RCC_SR_PLL3RDY_B_0X1					(0x1u<<10)
#define	RCC_SR_PLL2RDY_B_0X0					(0x0u<<9)
#define	RCC_SR_PLL2RDY_B_0X1					(0x1u<<9)
#define	RCC_SR_PLL1RDY_B_0X0					(0x0u<<8)
#define	RCC_SR_PLL1RDY_B_0X1					(0x1u<<8)
#define	RCC_SR_HSERDY_B_0X0						(0x0u<<4)
#define	RCC_SR_HSERDY_B_0X1						(0x1u<<4)
#define	RCC_SR_HSIRDY_B_0X0						(0x0u<<3)
#define	RCC_SR_HSIRDY_B_0X1						(0x1u<<3)
#define	RCC_SR_MSIRDY_B_0X0						(0x0u<<2)
#define	RCC_SR_MSIRDY_B_0X1						(0x1u<<2)
#define	RCC_SR_LSERDY_B_0X0						(0x0u<<1)
#define	RCC_SR_LSERDY_B_0X1						(0x1u<<1)
#define	RCC_SR_LSIRDY_B_0X0						(0x0u<<0)
#define	RCC_SR_LSIRDY_B_0X1						(0x1u<<0)

// STOPCR Configuration

#define	RCC_STOPCR_HSISTOPEN					(0x1u<<3)
#define	RCC_STOPCR_MSISTOPEN					(0x1u<<2)
#define	RCC_STOPCR_LSESTOPEN					(0x1u<<1)
#define	RCC_STOPCR_LSISTOPEN					(0x1u<<0)

#define	RCC_STOPCR_HSISTOPEN_B_0X0				(0x0u<<3)
#define	RCC_STOPCR_HSISTOPEN_B_0X1				(0x1u<<3)
#define	RCC_STOPCR_MSISTOPEN_B_0X0				(0x0u<<2)
#define	RCC_STOPCR_MSISTOPEN_B_0X1				(0x1u<<2)
#define	RCC_STOPCR_LSESTOPEN_B_0X0				(0x0u<<1)
#define	RCC_STOPCR_LSESTOPEN_B_0X1				(0x1u<<1)
#define	RCC_STOPCR_LSISTOPEN_B_0X0				(0x0u<<0)
#define	RCC_STOPCR_LSISTOPEN_B_0X1				(0x1u<<0)

// CFGR1 Configuration

#define	RCC_CFGR1_SYSSWS						(0x3u<<28)
#define	RCC_CFGR1_SYSSWS_0						(0x1u<<28)
#define	RCC_CFGR1_SYSSW							(0x3u<<24)
#define	RCC_CFGR1_SYSSW_0						(0x1u<<24)
#define	RCC_CFGR1_CPUSWS						(0x3u<<20)
#define	RCC_CFGR1_CPUSWS_0						(0x1u<<20)
#define	RCC_CFGR1_CPUSW							(0x3u<<16)
#define	RCC_CFGR1_CPUSW_0						(0x1u<<16)
#define	RCC_CFGR1_STOPWUCK						(0x1u<<0)

#define	RCC_CFGR1_SYSSWS_B_0X0					(0x0u<<28)
#define	RCC_CFGR1_SYSSWS_B_0X1					(0x1u<<28)
#define	RCC_CFGR1_SYSSWS_B_0X2					(0x2u<<28)
#define	RCC_CFGR1_SYSSWS_B_0X3					(0x3u<<28)
#define	RCC_CFGR1_SYSSW_B_0X0					(0x0u<<24)
#define	RCC_CFGR1_SYSSW_B_0X1					(0x1u<<24)
#define	RCC_CFGR1_SYSSW_B_0X2					(0x2u<<24)
#define	RCC_CFGR1_SYSSW_B_0X3					(0x3u<<24)
#define	RCC_CFGR1_CPUSWS_B_0X0					(0x0u<<20)
#define	RCC_CFGR1_CPUSWS_B_0X1					(0x1u<<20)
#define	RCC_CFGR1_CPUSWS_B_0X2					(0x2u<<20)
#define	RCC_CFGR1_CPUSWS_B_0X3					(0x3u<<20)
#define	RCC_CFGR1_CPUSW_B_0X0					(0x0u<<16)
#define	RCC_CFGR1_CPUSW_B_0X1					(0x1u<<16)
#define	RCC_CFGR1_CPUSW_B_0X2					(0x2u<<16)
#define	RCC_CFGR1_CPUSW_B_0X3					(0x3u<<16)
#define	RCC_CFGR1_STOPWUCK_B_0X0				(0x0u<<0)
#define	RCC_CFGR1_STOPWUCK_B_0X1				(0x1u<<0)

// CFGR2 Configuration

#define	RCC_CFGR2_TIMPRE						(0x3u<<24)
#define	RCC_CFGR2_TIMPRE_0						(0x1u<<24)
#define	RCC_CFGR2_HPRE							(0x7u<<20)
#define	RCC_CFGR2_HPRE_0						(0x1u<<20)
#define	RCC_CFGR2_PPRE5							(0x7u<<16)
#define	RCC_CFGR2_PPRE5_0						(0x1u<<16)
#define	RCC_CFGR2_PPRE4							(0x7u<<12)
#define	RCC_CFGR2_PPRE4_0						(0x1u<<12)
#define	RCC_CFGR2_PPRE2							(0x7u<<4)
#define	RCC_CFGR2_PPRE2_0						(0x1u<<4)
#define	RCC_CFGR2_PPRE1							(0x7u<<0)
#define	RCC_CFGR2_PPRE1_0						(0x1u<<0)

#define	RCC_CFGR2_TIMPRE_B_0X0					(0x0u<<24)
#define	RCC_CFGR2_TIMPRE_B_0X1					(0x1u<<24)
#define	RCC_CFGR2_TIMPRE_B_0X2					(0x2u<<24)
#define	RCC_CFGR2_HPRE_B_0X0					(0x0u<<20)
#define	RCC_CFGR2_HPRE_B_0X1					(0x1u<<20)
#define	RCC_CFGR2_HPRE_B_0X2					(0x2u<<20)
#define	RCC_CFGR2_HPRE_B_0X3					(0x3u<<20)
#define	RCC_CFGR2_HPRE_B_0X4					(0x4u<<20)
#define	RCC_CFGR2_HPRE_B_0X5					(0x5u<<20)
#define	RCC_CFGR2_HPRE_B_0X6					(0x6u<<20)
#define	RCC_CFGR2_HPRE_B_0X7					(0x7u<<20)
#define	RCC_CFGR2_PPRE5_B_0X0					(0x0u<<16)
#define	RCC_CFGR2_PPRE5_B_0X1					(0x1u<<16)
#define	RCC_CFGR2_PPRE5_B_0X2					(0x2u<<16)
#define	RCC_CFGR2_PPRE5_B_0X3					(0x3u<<16)
#define	RCC_CFGR2_PPRE5_B_0X4					(0x4u<<16)
#define	RCC_CFGR2_PPRE5_B_0X5					(0x5u<<16)
#define	RCC_CFGR2_PPRE5_B_0X6					(0x6u<<16)
#define	RCC_CFGR2_PPRE5_B_0X7					(0x7u<<16)
#define	RCC_CFGR2_PPRE4_B_0X0					(0x0u<<12)
#define	RCC_CFGR2_PPRE4_B_0X1					(0x1u<<12)
#define	RCC_CFGR2_PPRE4_B_0X2					(0x2u<<12)
#define	RCC_CFGR2_PPRE4_B_0X3					(0x3u<<12)
#define	RCC_CFGR2_PPRE4_B_0X4					(0x4u<<12)
#define	RCC_CFGR2_PPRE4_B_0X5					(0x5u<<12)
#define	RCC_CFGR2_PPRE4_B_0X6					(0x6u<<12)
#define	RCC_CFGR2_PPRE4_B_0X7					(0x7u<<12)
#define	RCC_CFGR2_PPRE2_B_0X0					(0x0u<<4)
#define	RCC_CFGR2_PPRE2_B_0X1					(0x1u<<4)
#define	RCC_CFGR2_PPRE2_B_0X2					(0x2u<<4)
#define	RCC_CFGR2_PPRE2_B_0X3					(0x3u<<4)
#define	RCC_CFGR2_PPRE2_B_0X4					(0x4u<<4)
#define	RCC_CFGR2_PPRE2_B_0X5					(0x5u<<4)
#define	RCC_CFGR2_PPRE2_B_0X6					(0x6u<<4)
#define	RCC_CFGR2_PPRE2_B_0X7					(0x7u<<4)
#define	RCC_CFGR2_PPRE1_B_0X0					(0x0u<<0)
#define	RCC_CFGR2_PPRE1_B_0X1					(0x1u<<0)
#define	RCC_CFGR2_PPRE1_B_0X2					(0x2u<<0)
#define	RCC_CFGR2_PPRE1_B_0X3					(0x3u<<0)
#define	RCC_CFGR2_PPRE1_B_0X4					(0x4u<<0)
#define	RCC_CFGR2_PPRE1_B_0X5					(0x5u<<0)
#define	RCC_CFGR2_PPRE1_B_0X6					(0x6u<<0)
#define	RCC_CFGR2_PPRE1_B_0X7					(0x7u<<0)

