hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
// CKPROTR Configuration

#define	RCC_CKPROTR_FMCSELS						(0x3u<<28)
#define	RCC_CKPROTR_FMCSELS_0					(0x1u<<28)
#define	RCC_CKPROTR_XSPI1SELS					(0x3u<<24)
#define	RCC_CKPROTR_XSPI1SELS_0					(0x1u<<24)
#define	RCC_CKPROTR_XSPI2SELS					(0x3u<<20)
#define	RCC_CKPROTR_XSPI2SELS_0					(0x1u<<20)
#define	RCC_CKPROTR_XSPI3SELS					(0x3u<<16)
#define	RCC_CKPROTR_XSPI3SELS_0					(0x1u<<16)

#define	RCC_CKPROTR_FMCSELS_B_0X0				(0x0u<<28)
#define	RCC_CKPROTR_FMCSELS_B_0X1				(0x1u<<28)
#define	RCC_CKPROTR_FMCSELS_B_0X2				(0x2u<<28)
#define	RCC_CKPROTR_FMCSELS_B_0X3				(0x3u<<28)
#define	RCC_CKPROTR_XSPI1SELS_B_0X0				(0x0u<<24)
#define	RCC_CKPROTR_XSPI1SELS_B_0X1				(0x1u<<24)
#define	RCC_CKPROTR_XSPI1SELS_B_0X2				(0x2u<<24)
#define	RCC_CKPROTR_XSPI1SELS_B_0X3				(0x3u<<24)
#define	RCC_CKPROTR_XSPI2SELS_B_0X0				(0x0u<<20)
#define	RCC_CKPROTR_XSPI2SELS_B_0X1				(0x1u<<20)
#define	RCC_CKPROTR_XSPI2SELS_B_0X2				(0x2u<<20)
#define	RCC_CKPROTR_XSPI2SELS_B_0X3				(0x3u<<20)
#define	RCC_CKPROTR_XSPI3SELS_B_0X0				(0x0u<<16)
#define	RCC_CKPROTR_XSPI3SELS_B_0X1				(0x1u<<16)
#define	RCC_CKPROTR_XSPI3SELS_B_0X2				(0x2u<<16)
#define	RCC_CKPROTR_XSPI3SELS_B_0X3				(0x3u<<16)

// BDCR Configuration

#define	RCC_BDCR_VSWRST							(0x1u<<31)

#define	RCC_BDCR_VSWRST_B_0X0					(0x0u<<31)
#define	RCC_BDCR_VSWRST_B_0X1					(0x1u<<31)

// HWRSR Configuration

#define	RCC_HWRSR_LPWRRSTF						(0x1u<<30)
#define	RCC_HWRSR_WWDGRSTF						(0x1u<<28)
#define	RCC_HWRSR_IWDGRSTF						(0x1u<<26)
#define	RCC_HWRSR_SFTRSTF						(0x1u<<24)
#define	RCC_HWRSR_PORRSTF						(0x1u<<23)
#define	RCC_HWRSR_PINRSTF						(0x1u<<22)
#define	RCC_HWRSR_BORRSTF						(0x1u<<21)
#define	RCC_HWRSR_LCKRSTF						(0x1u<<17)
#define	RCC_HWRSR_RMVF							(0x1u<<16)

#define	RCC_HWRSR_LPWRRSTF_B_0X0				(0x0u<<30)
#define	RCC_HWRSR_LPWRRSTF_B_0X1				(0x1u<<30)
#define	RCC_HWRSR_WWDGRSTF_B_0X0				(0x0u<<28)
#define	RCC_HWRSR_WWDGRSTF_B_0X1				(0x1u<<28)
#define	RCC_HWRSR_IWDGRSTF_B_0X0				(0x0u<<26)
#define	RCC_HWRSR_IWDGRSTF_B_0X1				(0x1u<<26)
#define	RCC_HWRSR_SFTRSTF_B_0X0					(0x0u<<24)
#define	RCC_HWRSR_SFTRSTF_B_0X1					(0x1u<<24)
#define	RCC_HWRSR_PORRSTF_B_0X0					(0x0u<<23)
#define	RCC_HWRSR_PORRSTF_B_0X1					(0x1u<<23)
#define	RCC_HWRSR_PINRSTF_B_0X0					(0x0u<<22)
#define	RCC_HWRSR_PINRSTF_B_0X1					(0x1u<<22)
#define	RCC_HWRSR_BORRSTF_B_0X0					(0x0u<<21)
#define	RCC_HWRSR_BORRSTF_B_0X1					(0x1u<<21)
#define	RCC_HWRSR_LCKRSTF_B_0X0					(0x0u<<17)
#define	RCC_HWRSR_LCKRSTF_B_0X1					(0x1u<<17)
#define	RCC_HWRSR_RMVF_B_0X0					(0x0u<<16)
#define	RCC_HWRSR_RMVF_B_0X1					(0x1u<<16)

// RSR Configuration

#define	RCC_RSR_LPWRRSTF						(0x1u<<30)
#define	RCC_RSR_WWDGRSTF						(0x1u<<28)
#define	RCC_RSR_IWDGRSTF						(0x1u<<26)
#define	RCC_RSR_SFTRSTF							(0x1u<<24)
#define	RCC_RSR_PORRSTF							(0x1u<<23)
#define	RCC_RSR_PINRSTF							(0x1u<<22)
#define	RCC_RSR_BORRSTF							(0x1u<<21)
#define	RCC_RSR_LCKRSTF							(0x1u<<17)
#define	RCC_RSR_RMVF							(0x1u<<16)

#define	RCC_RSR_LPWRRSTF_B_0X0					(0x0u<<30)
#define	RCC_RSR_LPWRRSTF_B_0X1					(0x1u<<30)
#define	RCC_RSR_WWDGRSTF_B_0X0					(0x0u<<28)
#define	RCC_RSR_WWDGRSTF_B_0X1					(0x1u<<28)
#define	RCC_RSR_IWDGRSTF_B_0X0					(0x0u<<26)
#define	RCC_RSR_IWDGRSTF_B_0X1					(0x1u<<26)
#define	RCC_RSR_SFTRSTF_B_0X0					(0x0u<<24)
#define	RCC_RSR_SFTRSTF_B_0X1					(0x1u<<24)
#define	RCC_RSR_PORRSTF_B_0X0					(0x0u<<23)
#define	RCC_RSR_PORRSTF_B_0X1					(0x1u<<23)
#define	RCC_RSR_PINRSTF_B_0X0					(0x0u<<22)
#define	RCC_RSR_PINRSTF_B_0X1					(0x1u<<22)
#define	RCC_RSR_BORRSTF_B_0X0					(0x0u<<21)
#define	RCC_RSR_BORRSTF_B_0X1					(0x1u<<21)
#define	RCC_RSR_LCKRSTF_B_0X0					(0x0u<<17)
#define	RCC_RSR_LCKRSTF_B_0X1					(0x1u<<17)
#define	RCC_RSR_RMVF_B_0X0						(0x0u<<16)
#define	RCC_RSR_RMVF_B_0X1						(0x1u<<16)

// LSECFGR Configuration

#define	RCC_LSECFGR_LSEDRV						(0x3u<<18)
#define	RCC_LSECFGR_LSEDRV_0					(0x1u<<18)
#define	RCC_LSECFGR_LSEGFON						(0x1u<<17)
#define	RCC_LSECFGR_LSEEXT						(0x1u<<16)
#define	RCC_LSECFGR_LSEBYP						(0x1u<<15)
#define	RCC_LSECFGR_LSECSSD						(0x1u<<9)
#define	RCC_LSECFGR_LSECSSRA					(0x1u<<8)
#define	RCC_LSECFGR_LSECSSON					(0x1u<<7)

#define	RCC_LSECFGR_LSEDRV_B_0X0				(0x0u<<18)
#define	RCC_LSECFGR_LSEDRV_B_0X1				(0x1u<<18)
#define	RCC_LSECFGR_LSEDRV_B_0X2				(0x2u<<18)
#define	RCC_LSECFGR_LSEDRV_B_0X3				(0x3u<<18)
#define	RCC_LSECFGR_LSEGFON_B_0X0				(0x0u<<17)
#define	RCC_LSECFGR_LSEGFON_B_0X1				(0x1u<<17)
#define	RCC_LSECFGR_LSEEXT_B_0X0				(0x0u<<16)
#define	RCC_LSECFGR_LSEEXT_B_0X1				(0x1u<<16)
#define	RCC_LSECFGR_LSEBYP_B_0X0				(0x0u<<15)
#define	RCC_LSECFGR_LSEBYP_B_0X1				(0x1u<<15)
#define	RCC_LSECFGR_LSECSSD_B_0X0				(0x0u<<9)
#define	RCC_LSECFGR_LSECSSD_B_0X1				(0x1u<<9)
#define	RCC_LSECFGR_LSECSSRA_B_0X0				(0x0u<<8)
#define	RCC_LSECFGR_LSECSSRA_B_0X1				(0x1u<<8)
#define	RCC_LSECFGR_LSECSSON_B_0X0				(0x0u<<7)
#define	RCC_LSECFGR_LSECSSON_B_0X1				(0x1u<<7)

// MSICFGR Configuration

#define	RCC_MSICFGR_MSICAL						(0xFFu<<23)
#define	RCC_MSICFGR_MSICAL_0					(0x1u<<23)
#define	RCC_MSICFGR_MSITRIM						(0x1Fu<<16)
#define	RCC_MSICFGR_MSITRIM_0					(0x1u<<16)
#define	RCC_MSICFGR_MSIFREQSEL					(0x1u<<9)

#define	RCC_MSICFGR_MSIFREQSEL_B_0X0			(0x0u<<9)
#define	RCC_MSICFGR_MSIFREQSEL_B_0X1			(0x1u<<9)

// HSICFGR Configuration

#define	RCC_HSICFGR_HSICAL						(0x1FFu<<23)
#define	RCC_HSICFGR_HSICAL_0					(0x1u<<23)
#define	RCC_HSICFGR_HSITRIM						(0x7Fu<<16)
#define	RCC_HSICFGR_HSITRIM_0					(0x1u<<16)
#define	RCC_HSICFGR_HSIDIV						(0x3u<<7)
#define	RCC_HSICFGR_HSIDIV_0					(0x1u<<7)

#define	RCC_HSICFGR_HSITRIM_B_0X40				(0x40u<<16)
#define	RCC_HSICFGR_HSITRIM_B_0X41				(0x41u<<16)
#define	RCC_HSICFGR_HSITRIM_B_0X0				(0x0u<<16)
#define	RCC_HSICFGR_HSITRIM_B_0X3E				(0x3Eu<<16)
#define	RCC_HSICFGR_HSITRIM_B_0X3F				(0x3Fu<<16)
#define	RCC_HSICFGR_HSIDIV_B_0X0				(0x0u<<7)
#define	RCC_HSICFGR_HSIDIV_B_0X1				(0x1u<<7)

// HSIMCR Configuration

#define	RCC_HSIMCR_HSIMONEN						(0x1u<<31)
#define	RCC_HSIMCR_HSIDEV						(0x3Fu<<16)
#define	RCC_HSIMCR_HSIDEV_0						(0x1u<<16)
#define	RCC_HSIMCR_HSIREF						(0x7FFu<<0)
#define	RCC_HSIMCR_HSIREF_0						(0x1u<<0)

