hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
#define	RCC_HSIMCR_HSIMONEN_B_0X0				(0x0u<<31)
#define	RCC_HSIMCR_HSIMONEN_B_0X1				(0x1u<<31)

// HSIMSR Configuration

#define	RCC_HSIMSR_HSIVAL						(0x7FFu<<0)
#define	RCC_HSIMSR_HSIVAL_0						(0x1u<<0)

// HSECFGR Configuration

#define	RCC_HSECFGR_HSEDRV						(0x3u<<18)
#define	RCC_HSECFGR_HSEDRV_0					(0x1u<<18)
#define	RCC_HSECFGR_HSEGFON						(0x1u<<17)
#define	RCC_HSECFGR_HSEEXT						(0x1u<<16)
#define	RCC_HSECFGR_HSEBYP						(0x1u<<15)
#define	RCC_HSECFGR_HSECSSBPRE					(0xFu<<11)
#define	RCC_HSECFGR_HSECSSBPRE_0				(0x1u<<11)
#define	RCC_HSECFGR_HSECSSBYP					(0x1u<<10)
#define	RCC_HSECFGR_HSECSSD						(0x1u<<9)
#define	RCC_HSECFGR_HSECSSRA					(0x1u<<8)
#define	RCC_HSECFGR_HSECSSON					(0x1u<<7)
#define	RCC_HSECFGR_HSEDIV2BYP					(0x1u<<6)

#define	RCC_HSECFGR_HSEDRV_B_0X0				(0x0u<<18)
#define	RCC_HSECFGR_HSEDRV_B_0X1				(0x1u<<18)
#define	RCC_HSECFGR_HSEDRV_B_0X2				(0x2u<<18)
#define	RCC_HSECFGR_HSEDRV_B_0X3				(0x3u<<18)
#define	RCC_HSECFGR_HSEGFON_B_0X0				(0x0u<<17)
#define	RCC_HSECFGR_HSEGFON_B_0X1				(0x1u<<17)
#define	RCC_HSECFGR_HSEEXT_B_0X0				(0x0u<<16)
#define	RCC_HSECFGR_HSEEXT_B_0X1				(0x1u<<16)
#define	RCC_HSECFGR_HSEBYP_B_0X0				(0x0u<<15)
#define	RCC_HSECFGR_HSEBYP_B_0X1				(0x1u<<15)
#define	RCC_HSECFGR_HSECSSBPRE_B_0X0			(0x0u<<11)
#define	RCC_HSECFGR_HSECSSBPRE_B_0X1			(0x1u<<11)
#define	RCC_HSECFGR_HSECSSBPRE_B_0X2			(0x2u<<11)
#define	RCC_HSECFGR_HSECSSBPRE_B_0X3			(0x3u<<11)
#define	RCC_HSECFGR_HSECSSBPRE_B_0XF			(0xFu<<11)
#define	RCC_HSECFGR_HSECSSBYP_B_0X0				(0x0u<<10)
#define	RCC_HSECFGR_HSECSSBYP_B_0X1				(0x1u<<10)
#define	RCC_HSECFGR_HSECSSD_B_0X0				(0x0u<<9)
#define	RCC_HSECFGR_HSECSSD_B_0X1				(0x1u<<9)
#define	RCC_HSECFGR_HSECSSRA_B_0X0				(0x0u<<8)
#define	RCC_HSECFGR_HSECSSRA_B_0X1				(0x1u<<8)
#define	RCC_HSECFGR_HSECSSON_B_0X0				(0x0u<<7)
#define	RCC_HSECFGR_HSECSSON_B_0X1				(0x1u<<7)
#define	RCC_HSECFGR_HSEDIV2BYP_B_0X0			(0x0u<<6)
#define	RCC_HSECFGR_HSEDIV2BYP_B_0X1			(0x1u<<6)

// PLL1CFGR1 Configuration

#define	RCC_PLL1CFGR1_PLL1SEL					(0x7u<<28)
#define	RCC_PLL1CFGR1_PLL1SEL_0					(0x1u<<28)
#define	RCC_PLL1CFGR1_PLL1BYP					(0x1u<<27)
#define	RCC_PLL1CFGR1_PLL1DIVM					(0x3Fu<<20)
#define	RCC_PLL1CFGR1_PLL1DIVM_0				(0x1u<<20)
#define	RCC_PLL1CFGR1_PLL1DIVN					(0xFFFu<<8)
#define	RCC_PLL1CFGR1_PLL1DIVN_0				(0x1u<<8)

#define	RCC_PLL1CFGR1_PLL1SEL_B_0X0				(0x0u<<28)
#define	RCC_PLL1CFGR1_PLL1SEL_B_0X1				(0x1u<<28)
#define	RCC_PLL1CFGR1_PLL1SEL_B_0X2				(0x2u<<28)
#define	RCC_PLL1CFGR1_PLL1SEL_B_0X3				(0x3u<<28)
#define	RCC_PLL1CFGR1_PLL1BYP_B_0X0				(0x0u<<27)
#define	RCC_PLL1CFGR1_PLL1BYP_B_0X1				(0x1u<<27)
#define	RCC_PLL1CFGR1_PLL1DIVM_B_0X0			(0x0u<<20)
#define	RCC_PLL1CFGR1_PLL1DIVM_B_0X1			(0x1u<<20)
#define	RCC_PLL1CFGR1_PLL1DIVM_B_0X2			(0x2u<<20)
#define	RCC_PLL1CFGR1_PLL1DIVM_B_0X3F			(0x3Fu<<20)

// PLL1CFGR2 Configuration

#define	RCC_PLL1CFGR2_PLL1DIVNFRAC				(0xFFFFFFu<<0)
#define	RCC_PLL1CFGR2_PLL1DIVNFRAC_0			(0x1u<<0)

// PLL1CFGR3 Configuration

#define	RCC_PLL1CFGR3_PLL1PDIVEN				(0x1u<<30)
#define	RCC_PLL1CFGR3_PLL1PDIV1					(0x7u<<27)
#define	RCC_PLL1CFGR3_PLL1PDIV1_0				(0x1u<<27)
#define	RCC_PLL1CFGR3_PLL1PDIV2					(0x7u<<24)
#define	RCC_PLL1CFGR3_PLL1PDIV2_0				(0x1u<<24)
#define	RCC_PLL1CFGR3_PLL1MODSPR				(0x1Fu<<16)
#define	RCC_PLL1CFGR3_PLL1MODSPR_0				(0x1u<<16)
#define	RCC_PLL1CFGR3_PLL1MODDIV				(0xFu<<8)
#define	RCC_PLL1CFGR3_PLL1MODDIV_0				(0x1u<<8)
#define	RCC_PLL1CFGR3_PLL1MODSPRDW				(0x1u<<4)
#define	RCC_PLL1CFGR3_PLL1MODDSEN				(0x1u<<3)
#define	RCC_PLL1CFGR3_PLL1MODSSDIS				(0x1u<<2)
#define	RCC_PLL1CFGR3_PLL1DACEN					(0x1u<<1)
#define	RCC_PLL1CFGR3_PLL1MODSSRST				(0x1u<<0)

#define	RCC_PLL1CFGR3_PLL1PDIVEN_B_0X0			(0x0u<<30)
#define	RCC_PLL1CFGR3_PLL1PDIVEN_B_0X1			(0x1u<<30)
#define	RCC_PLL1CFGR3_PLL1PDIV1_B_0X0			(0x0u<<27)
#define	RCC_PLL1CFGR3_PLL1PDIV1_B_0X1			(0x1u<<27)
#define	RCC_PLL1CFGR3_PLL1PDIV1_B_0X7			(0x7u<<27)
#define	RCC_PLL1CFGR3_PLL1PDIV2_B_0X0			(0x0u<<24)
#define	RCC_PLL1CFGR3_PLL1PDIV2_B_0X1			(0x1u<<24)
#define	RCC_PLL1CFGR3_PLL1PDIV2_B_0X7			(0x7u<<24)
#define	RCC_PLL1CFGR3_PLL1MODSPRDW_B_0X0		(0x0u<<4)
#define	RCC_PLL1CFGR3_PLL1MODSPRDW_B_0X1		(0x1u<<4)
#define	RCC_PLL1CFGR3_PLL1MODDSEN_B_0X0			(0x0u<<3)
#define	RCC_PLL1CFGR3_PLL1MODDSEN_B_0X1			(0x1u<<3)
#define	RCC_PLL1CFGR3_PLL1MODSSDIS_B_0X0		(0x0u<<2)
#define	RCC_PLL1CFGR3_PLL1MODSSDIS_B_0X1		(0x1u<<2)
#define	RCC_PLL1CFGR3_PLL1DACEN_B_0X0			(0x0u<<1)
#define	RCC_PLL1CFGR3_PLL1DACEN_B_0X1			(0x1u<<1)
#define	RCC_PLL1CFGR3_PLL1MODSSRST_B_0X0		(0x0u<<0)
#define	RCC_PLL1CFGR3_PLL1MODSSRST_B_0X1		(0x1u<<0)

// PLL2CFGR1 Configuration

#define	RCC_PLL2CFGR1_PLL2SEL					(0x7u<<28)
#define	RCC_PLL2CFGR1_PLL2SEL_0					(0x1u<<28)
#define	RCC_PLL2CFGR1_PLL2BYP					(0x1u<<27)
#define	RCC_PLL2CFGR1_PLL2DIVM					(0x3Fu<<20)
#define	RCC_PLL2CFGR1_PLL2DIVM_0				(0x1u<<20)
#define	RCC_PLL2CFGR1_PLL2DIVN					(0xFFFu<<8)
#define	RCC_PLL2CFGR1_PLL2DIVN_0				(0x1u<<8)

#define	RCC_PLL2CFGR1_PLL2SEL_B_0X0				(0x0u<<28)
#define	RCC_PLL2CFGR1_PLL2SEL_B_0X1				(0x1u<<28)
#define	RCC_PLL2CFGR1_PLL2SEL_B_0X2				(0x2u<<28)
#define	RCC_PLL2CFGR1_PLL2SEL_B_0X3				(0x3u<<28)
#define	RCC_PLL2CFGR1_PLL2BYP_B_0X0				(0x0u<<27)
#define	RCC_PLL2CFGR1_PLL2BYP_B_0X1				(0x1u<<27)
#define	RCC_PLL2CFGR1_PLL2DIVM_B_0X0			(0x0u<<20)
#define	RCC_PLL2CFGR1_PLL2DIVM_B_0X1			(0x1u<<20)
#define	RCC_PLL2CFGR1_PLL2DIVM_B_0X2			(0x2u<<20)
#define	RCC_PLL2CFGR1_PLL2DIVM_B_0X3F			(0x3Fu<<20)

// PLL2CFGR2 Configuration

#define	RCC_PLL2CFGR2_PLL2DIVNFRAC				(0xFFFFFFu<<0)
#define	RCC_PLL2CFGR2_PLL2DIVNFRAC_0			(0x1u<<0)

// PLL2CFGR3 Configuration

#define	RCC_PLL2CFGR3_PLL2PDIVEN				(0x1u<<30)
#define	RCC_PLL2CFGR3_PLL2PDIV1					(0x7u<<27)
#define	RCC_PLL2CFGR3_PLL2PDIV1_0				(0x1u<<27)
#define	RCC_PLL2CFGR3_PLL2PDIV2					(0x7u<<24)
#define	RCC_PLL2CFGR3_PLL2PDIV2_0				(0x1u<<24)
#define	RCC_PLL2CFGR3_PLL2MODSPR				(0x1Fu<<16)
#define	RCC_PLL2CFGR3_PLL2MODSPR_0				(0x1u<<16)
#define	RCC_PLL2CFGR3_PLL2MODDIV				(0xFu<<8)
#define	RCC_PLL2CFGR3_PLL2MODDIV_0				(0x1u<<8)
#define	RCC_PLL2CFGR3_PLL2MODSPRDW				(0x1u<<4)
#define	RCC_PLL2CFGR3_PLL2MODDSEN				(0x1u<<3)
#define	RCC_PLL2CFGR3_PLL2MODSSDIS				(0x1u<<2)
#define	RCC_PLL2CFGR3_PLL2DACEN					(0x1u<<1)
#define	RCC_PLL2CFGR3_PLL2MODSSRST				(0x1u<<0)

