hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
#define	RCC_PLL2CFGR3_PLL2PDIVEN_B_0X0			(0x0u<<30)
#define	RCC_PLL2CFGR3_PLL2PDIVEN_B_0X1			(0x1u<<30)
#define	RCC_PLL2CFGR3_PLL2PDIV1_B_0X0			(0x0u<<27)
#define	RCC_PLL2CFGR3_PLL2PDIV1_B_0X1			(0x1u<<27)
#define	RCC_PLL2CFGR3_PLL2PDIV1_B_0X7			(0x7u<<27)
#define	RCC_PLL2CFGR3_PLL2PDIV2_B_0X0			(0x0u<<24)
#define	RCC_PLL2CFGR3_PLL2PDIV2_B_0X1			(0x1u<<24)
#define	RCC_PLL2CFGR3_PLL2PDIV2_B_0X7			(0x7u<<24)
#define	RCC_PLL2CFGR3_PLL2MODSPRDW_B_0X0		(0x0u<<4)
#define	RCC_PLL2CFGR3_PLL2MODSPRDW_B_0X1		(0x1u<<4)
#define	RCC_PLL2CFGR3_PLL2MODDSEN_B_0X0			(0x0u<<3)
#define	RCC_PLL2CFGR3_PLL2MODDSEN_B_0X1			(0x1u<<3)
#define	RCC_PLL2CFGR3_PLL2MODSSDIS_B_0X0		(0x0u<<2)
#define	RCC_PLL2CFGR3_PLL2MODSSDIS_B_0X1		(0x1u<<2)
#define	RCC_PLL2CFGR3_PLL2DACEN_B_0X0			(0x0u<<1)
#define	RCC_PLL2CFGR3_PLL2DACEN_B_0X1			(0x1u<<1)
#define	RCC_PLL2CFGR3_PLL2MODSSRST_B_0X0		(0x0u<<0)
#define	RCC_PLL2CFGR3_PLL2MODSSRST_B_0X1		(0x1u<<0)

// PLL3CFGR1 Configuration

#define	RCC_PLL3CFGR1_PLL3SEL					(0x7u<<28)
#define	RCC_PLL3CFGR1_PLL3SEL_0					(0x1u<<28)
#define	RCC_PLL3CFGR1_PLL3BYP					(0x1u<<27)
#define	RCC_PLL3CFGR1_PLL3DIVM					(0x3Fu<<20)
#define	RCC_PLL3CFGR1_PLL3DIVM_0				(0x1u<<20)
#define	RCC_PLL3CFGR1_PLL3DIVN					(0xFFFu<<8)
#define	RCC_PLL3CFGR1_PLL3DIVN_0				(0x1u<<8)

#define	RCC_PLL3CFGR1_PLL3SEL_B_0X0				(0x0u<<28)
#define	RCC_PLL3CFGR1_PLL3SEL_B_0X1				(0x1u<<28)
#define	RCC_PLL3CFGR1_PLL3SEL_B_0X2				(0x2u<<28)
#define	RCC_PLL3CFGR1_PLL3SEL_B_0X3				(0x3u<<28)
#define	RCC_PLL3CFGR1_PLL3BYP_B_0X0				(0x0u<<27)
#define	RCC_PLL3CFGR1_PLL3BYP_B_0X1				(0x1u<<27)
#define	RCC_PLL3CFGR1_PLL3DIVM_B_0X0			(0x0u<<20)
#define	RCC_PLL3CFGR1_PLL3DIVM_B_0X1			(0x1u<<20)
#define	RCC_PLL3CFGR1_PLL3DIVM_B_0X2			(0x2u<<20)
#define	RCC_PLL3CFGR1_PLL3DIVM_B_0X3F			(0x3Fu<<20)

// PLL3CFGR2 Configuration

#define	RCC_PLL3CFGR2_PLL3DIVNFRAC				(0xFFFFFFu<<0)
#define	RCC_PLL3CFGR2_PLL3DIVNFRAC_0			(0x1u<<0)

// PLL3CFGR3 Configuration

#define	RCC_PLL3CFGR3_PLL3PDIVEN				(0x1u<<30)
#define	RCC_PLL3CFGR3_PLL3PDIV1					(0x7u<<27)
#define	RCC_PLL3CFGR3_PLL3PDIV1_0				(0x1u<<27)
#define	RCC_PLL3CFGR3_PLL3PDIV2					(0x7u<<24)
#define	RCC_PLL3CFGR3_PLL3PDIV2_0				(0x1u<<24)
#define	RCC_PLL3CFGR3_PLL3MODSPR				(0x1Fu<<16)
#define	RCC_PLL3CFGR3_PLL3MODSPR_0				(0x1u<<16)
#define	RCC_PLL3CFGR3_PLL3MODDIV				(0xFu<<8)
#define	RCC_PLL3CFGR3_PLL3MODDIV_0				(0x1u<<8)
#define	RCC_PLL3CFGR3_PLL3MODSPRDW				(0x1u<<4)
#define	RCC_PLL3CFGR3_PLL3MODDSEN				(0x1u<<3)
#define	RCC_PLL3CFGR3_PLL3MODSSDIS				(0x1u<<2)
#define	RCC_PLL3CFGR3_PLL3DACEN					(0x1u<<1)
#define	RCC_PLL3CFGR3_PLL3MODSSRST				(0x1u<<0)

#define	RCC_PLL3CFGR3_PLL3PDIVEN_B_0X0			(0x0u<<30)
#define	RCC_PLL3CFGR3_PLL3PDIVEN_B_0X1			(0x1u<<30)
#define	RCC_PLL3CFGR3_PLL3PDIV1_B_0X0			(0x0u<<27)
#define	RCC_PLL3CFGR3_PLL3PDIV1_B_0X1			(0x1u<<27)
#define	RCC_PLL3CFGR3_PLL3PDIV1_B_0X7			(0x7u<<27)
#define	RCC_PLL3CFGR3_PLL3PDIV2_B_0X0			(0x0u<<24)
#define	RCC_PLL3CFGR3_PLL3PDIV2_B_0X1			(0x1u<<24)
#define	RCC_PLL3CFGR3_PLL3PDIV2_B_0X7			(0x7u<<24)
#define	RCC_PLL3CFGR3_PLL3MODSPRDW_B_0X0		(0x0u<<4)
#define	RCC_PLL3CFGR3_PLL3MODSPRDW_B_0X1		(0x1u<<4)
#define	RCC_PLL3CFGR3_PLL3MODDSEN_B_0X0			(0x0u<<3)
#define	RCC_PLL3CFGR3_PLL3MODDSEN_B_0X1			(0x1u<<3)
#define	RCC_PLL3CFGR3_PLL3MODSSDIS_B_0X0		(0x0u<<2)
#define	RCC_PLL3CFGR3_PLL3MODSSDIS_B_0X1		(0x1u<<2)
#define	RCC_PLL3CFGR3_PLL3DACEN_B_0X0			(0x0u<<1)
#define	RCC_PLL3CFGR3_PLL3DACEN_B_0X1			(0x1u<<1)
#define	RCC_PLL3CFGR3_PLL3MODSSRST_B_0X0		(0x0u<<0)
#define	RCC_PLL3CFGR3_PLL3MODSSRST_B_0X1		(0x1u<<0)

// PLL4CFGR1 Configuration

#define	RCC_PLL4CFGR1_PLL4SEL					(0x7u<<28)
#define	RCC_PLL4CFGR1_PLL4SEL_0					(0x1u<<28)
#define	RCC_PLL4CFGR1_PLL4BYP					(0x1u<<27)
#define	RCC_PLL4CFGR1_PLL4DIVM					(0x3Fu<<20)
#define	RCC_PLL4CFGR1_PLL4DIVM_0				(0x1u<<20)
#define	RCC_PLL4CFGR1_PLL4DIVN					(0xFFFu<<8)
#define	RCC_PLL4CFGR1_PLL4DIVN_0				(0x1u<<8)

#define	RCC_PLL4CFGR1_PLL4SEL_B_0X0				(0x0u<<28)
#define	RCC_PLL4CFGR1_PLL4SEL_B_0X1				(0x1u<<28)
#define	RCC_PLL4CFGR1_PLL4SEL_B_0X2				(0x2u<<28)
#define	RCC_PLL4CFGR1_PLL4SEL_B_0X3				(0x3u<<28)
#define	RCC_PLL4CFGR1_PLL4BYP_B_0X0				(0x0u<<27)
#define	RCC_PLL4CFGR1_PLL4BYP_B_0X1				(0x1u<<27)
#define	RCC_PLL4CFGR1_PLL4DIVM_B_0X0			(0x0u<<20)
#define	RCC_PLL4CFGR1_PLL4DIVM_B_0X1			(0x1u<<20)
#define	RCC_PLL4CFGR1_PLL4DIVM_B_0X2			(0x2u<<20)
#define	RCC_PLL4CFGR1_PLL4DIVM_B_0X3F			(0x3Fu<<20)

// PLL4CFGR2 Configuration

#define	RCC_PLL4CFGR2_PLL4DIVNFRAC				(0xFFFFFFu<<0)
#define	RCC_PLL4CFGR2_PLL4DIVNFRAC_0			(0x1u<<0)

// PLL4CFGR3 Configuration

#define	RCC_PLL4CFGR3_PLL4PDIVEN				(0x1u<<30)
#define	RCC_PLL4CFGR3_PLL4PDIV1					(0x7u<<27)
#define	RCC_PLL4CFGR3_PLL4PDIV1_0				(0x1u<<27)
#define	RCC_PLL4CFGR3_PLL4PDIV2					(0x7u<<24)
#define	RCC_PLL4CFGR3_PLL4PDIV2_0				(0x1u<<24)
#define	RCC_PLL4CFGR3_PLL4MODSPR				(0x1Fu<<16)
#define	RCC_PLL4CFGR3_PLL4MODSPR_0				(0x1u<<16)
#define	RCC_PLL4CFGR3_PLL4MODDIV				(0xFu<<8)
#define	RCC_PLL4CFGR3_PLL4MODDIV_0				(0x1u<<8)
#define	RCC_PLL4CFGR3_PLL4MODSPRDW				(0x1u<<4)
#define	RCC_PLL4CFGR3_PLL4MODDSEN				(0x1u<<3)
#define	RCC_PLL4CFGR3_PLL4MODSSDIS				(0x1u<<2)
#define	RCC_PLL4CFGR3_PLL4DACEN					(0x1u<<1)
#define	RCC_PLL4CFGR3_PLL4MODSSRST				(0x1u<<0)

#define	RCC_PLL4CFGR3_PLL4PDIVEN_B_0X0			(0x0u<<30)
#define	RCC_PLL4CFGR3_PLL4PDIVEN_B_0X1			(0x1u<<30)
#define	RCC_PLL4CFGR3_PLL4PDIV1_B_0X0			(0x0u<<27)
#define	RCC_PLL4CFGR3_PLL4PDIV1_B_0X1			(0x1u<<27)
#define	RCC_PLL4CFGR3_PLL4PDIV1_B_0X7			(0x7u<<27)
#define	RCC_PLL4CFGR3_PLL4PDIV2_B_0X0			(0x0u<<24)
#define	RCC_PLL4CFGR3_PLL4PDIV2_B_0X1			(0x1u<<24)
#define	RCC_PLL4CFGR3_PLL4PDIV2_B_0X7			(0x7u<<24)
#define	RCC_PLL4CFGR3_PLL4MODSPRDW_B_0X0		(0x0u<<4)
#define	RCC_PLL4CFGR3_PLL4MODSPRDW_B_0X1		(0x1u<<4)
#define	RCC_PLL4CFGR3_PLL4MODDSEN_B_0X0			(0x0u<<3)
#define	RCC_PLL4CFGR3_PLL4MODDSEN_B_0X1			(0x1u<<3)
#define	RCC_PLL4CFGR3_PLL4MODSSDIS_B_0X0		(0x0u<<2)
#define	RCC_PLL4CFGR3_PLL4MODSSDIS_B_0X1		(0x1u<<2)
#define	RCC_PLL4CFGR3_PLL4DACEN_B_0X0			(0x0u<<1)
#define	RCC_PLL4CFGR3_PLL4DACEN_B_0X1			(0x1u<<1)
#define	RCC_PLL4CFGR3_PLL4MODSSRST_B_0X0		(0x0u<<0)
#define	RCC_PLL4CFGR3_PLL4MODSSRST_B_0X1		(0x1u<<0)

// IC1CFGR Configuration

