hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
#define	RCC_IC1CFGR_IC1SEL						(0x3u<<28)
#define	RCC_IC1CFGR_IC1SEL_0					(0x1u<<28)
#define	RCC_IC1CFGR_IC1INT						(0xFFu<<16)
#define	RCC_IC1CFGR_IC1INT_0					(0x1u<<16)

#define	RCC_IC1CFGR_IC1SEL_B_0X0				(0x0u<<28)
#define	RCC_IC1CFGR_IC1SEL_B_0X1				(0x1u<<28)
#define	RCC_IC1CFGR_IC1SEL_B_0X2				(0x2u<<28)
#define	RCC_IC1CFGR_IC1SEL_B_0X3				(0x3u<<28)
#define	RCC_IC1CFGR_IC1INT_B_0X0				(0x0u<<16)
#define	RCC_IC1CFGR_IC1INT_B_0X1				(0x1u<<16)
#define	RCC_IC1CFGR_IC1INT_B_0X2				(0x2u<<16)
#define	RCC_IC1CFGR_IC1INT_B_0X3				(0x3u<<16)
#define	RCC_IC1CFGR_IC1INT_B_0XFF				(0xFFu<<16)

// IC2CFGR Configuration

#define	RCC_IC2CFGR_IC2SEL						(0x3u<<28)
#define	RCC_IC2CFGR_IC2SEL_0					(0x1u<<28)
#define	RCC_IC2CFGR_IC2INT						(0xFFu<<16)
#define	RCC_IC2CFGR_IC2INT_0					(0x1u<<16)

#define	RCC_IC2CFGR_IC2SEL_B_0X0				(0x0u<<28)
#define	RCC_IC2CFGR_IC2SEL_B_0X1				(0x1u<<28)
#define	RCC_IC2CFGR_IC2SEL_B_0X2				(0x2u<<28)
#define	RCC_IC2CFGR_IC2SEL_B_0X3				(0x3u<<28)
#define	RCC_IC2CFGR_IC2INT_B_0X0				(0x0u<<16)
#define	RCC_IC2CFGR_IC2INT_B_0X1				(0x1u<<16)
#define	RCC_IC2CFGR_IC2INT_B_0X2				(0x2u<<16)
#define	RCC_IC2CFGR_IC2INT_B_0X3				(0x3u<<16)
#define	RCC_IC2CFGR_IC2INT_B_0XFF				(0xFFu<<16)

// IC3CFGR Configuration

#define	RCC_IC3CFGR_IC3SEL						(0x3u<<28)
#define	RCC_IC3CFGR_IC3SEL_0					(0x1u<<28)
#define	RCC_IC3CFGR_IC3INT						(0xFFu<<16)
#define	RCC_IC3CFGR_IC3INT_0					(0x1u<<16)

#define	RCC_IC3CFGR_IC3SEL_B_0X0				(0x0u<<28)
#define	RCC_IC3CFGR_IC3SEL_B_0X1				(0x1u<<28)
#define	RCC_IC3CFGR_IC3SEL_B_0X2				(0x2u<<28)
#define	RCC_IC3CFGR_IC3SEL_B_0X3				(0x3u<<28)
#define	RCC_IC3CFGR_IC3INT_B_0X0				(0x0u<<16)
#define	RCC_IC3CFGR_IC3INT_B_0X1				(0x1u<<16)
#define	RCC_IC3CFGR_IC3INT_B_0X2				(0x2u<<16)
#define	RCC_IC3CFGR_IC3INT_B_0X3				(0x3u<<16)
#define	RCC_IC3CFGR_IC3INT_B_0XFF				(0xFFu<<16)

// IC4CFGR Configuration

#define	RCC_IC4CFGR_IC4SEL						(0x3u<<28)
#define	RCC_IC4CFGR_IC4SEL_0					(0x1u<<28)
#define	RCC_IC4CFGR_IC4INT						(0xFFu<<16)
#define	RCC_IC4CFGR_IC4INT_0					(0x1u<<16)

#define	RCC_IC4CFGR_IC4SEL_B_0X0				(0x0u<<28)
#define	RCC_IC4CFGR_IC4SEL_B_0X1				(0x1u<<28)
#define	RCC_IC4CFGR_IC4SEL_B_0X2				(0x2u<<28)
#define	RCC_IC4CFGR_IC4SEL_B_0X3				(0x3u<<28)
#define	RCC_IC4CFGR_IC4INT_B_0X0				(0x0u<<16)
#define	RCC_IC4CFGR_IC4INT_B_0X1				(0x1u<<16)
#define	RCC_IC4CFGR_IC4INT_B_0X2				(0x2u<<16)
#define	RCC_IC4CFGR_IC4INT_B_0X3				(0x3u<<16)
#define	RCC_IC4CFGR_IC4INT_B_0XFF				(0xFFu<<16)

// IC5CFGR Configuration

#define	RCC_IC5CFGR_IC5SEL						(0x3u<<28)
#define	RCC_IC5CFGR_IC5SEL_0					(0x1u<<28)
#define	RCC_IC5CFGR_IC5INT						(0xFFu<<16)
#define	RCC_IC5CFGR_IC5INT_0					(0x1u<<16)

#define	RCC_IC5CFGR_IC5SEL_B_0X0				(0x0u<<28)
#define	RCC_IC5CFGR_IC5SEL_B_0X1				(0x1u<<28)
#define	RCC_IC5CFGR_IC5SEL_B_0X2				(0x2u<<28)
#define	RCC_IC5CFGR_IC5SEL_B_0X3				(0x3u<<28)
#define	RCC_IC5CFGR_IC5INT_B_0X0				(0x0u<<16)
#define	RCC_IC5CFGR_IC5INT_B_0X1				(0x1u<<16)
#define	RCC_IC5CFGR_IC5INT_B_0X2				(0x2u<<16)
#define	RCC_IC5CFGR_IC5INT_B_0X3				(0x3u<<16)
#define	RCC_IC5CFGR_IC5INT_B_0XFF				(0xFFu<<16)

// IC6CFGR Configuration

#define	RCC_IC6CFGR_IC6SEL						(0x3u<<28)
#define	RCC_IC6CFGR_IC6SEL_0					(0x1u<<28)
#define	RCC_IC6CFGR_IC6INT						(0xFFu<<16)
#define	RCC_IC6CFGR_IC6INT_0					(0x1u<<16)

#define	RCC_IC6CFGR_IC6SEL_B_0X0				(0x0u<<28)
#define	RCC_IC6CFGR_IC6SEL_B_0X1				(0x1u<<28)
#define	RCC_IC6CFGR_IC6SEL_B_0X2				(0x2u<<28)
#define	RCC_IC6CFGR_IC6SEL_B_0X3				(0x3u<<28)
#define	RCC_IC6CFGR_IC6INT_B_0X0				(0x0u<<16)
#define	RCC_IC6CFGR_IC6INT_B_0X1				(0x1u<<16)
#define	RCC_IC6CFGR_IC6INT_B_0X2				(0x2u<<16)
#define	RCC_IC6CFGR_IC6INT_B_0X3				(0x3u<<16)
#define	RCC_IC6CFGR_IC6INT_B_0XFF				(0xFFu<<16)

// IC7CFGR Configuration

#define	RCC_IC7CFGR_IC7SEL						(0x3u<<28)
#define	RCC_IC7CFGR_IC7SEL_0					(0x1u<<28)
#define	RCC_IC7CFGR_IC7INT						(0xFFu<<16)
#define	RCC_IC7CFGR_IC7INT_0					(0x1u<<16)

#define	RCC_IC7CFGR_IC7SEL_B_0X0				(0x0u<<28)
#define	RCC_IC7CFGR_IC7SEL_B_0X1				(0x1u<<28)
#define	RCC_IC7CFGR_IC7SEL_B_0X2				(0x2u<<28)
#define	RCC_IC7CFGR_IC7SEL_B_0X3				(0x3u<<28)
#define	RCC_IC7CFGR_IC7INT_B_0X0				(0x0u<<16)
#define	RCC_IC7CFGR_IC7INT_B_0X1				(0x1u<<16)
#define	RCC_IC7CFGR_IC7INT_B_0X2				(0x2u<<16)
#define	RCC_IC7CFGR_IC7INT_B_0X3				(0x3u<<16)
#define	RCC_IC7CFGR_IC7INT_B_0XFF				(0xFFu<<16)

// IC8CFGR Configuration

#define	RCC_IC8CFGR_IC8SEL						(0x3u<<28)
#define	RCC_IC8CFGR_IC8SEL_0					(0x1u<<28)
#define	RCC_IC8CFGR_IC8INT						(0xFFu<<16)
#define	RCC_IC8CFGR_IC8INT_0					(0x1u<<16)

#define	RCC_IC8CFGR_IC8SEL_B_0X0				(0x0u<<28)
#define	RCC_IC8CFGR_IC8SEL_B_0X1				(0x1u<<28)
#define	RCC_IC8CFGR_IC8SEL_B_0X2				(0x2u<<28)
#define	RCC_IC8CFGR_IC8SEL_B_0X3				(0x3u<<28)
#define	RCC_IC8CFGR_IC8INT_B_0X0				(0x0u<<16)
#define	RCC_IC8CFGR_IC8INT_B_0X1				(0x1u<<16)
#define	RCC_IC8CFGR_IC8INT_B_0X2				(0x2u<<16)
#define	RCC_IC8CFGR_IC8INT_B_0X3				(0x3u<<16)
#define	RCC_IC8CFGR_IC8INT_B_0XFF				(0xFFu<<16)

// IC9CFGR Configuration

#define	RCC_IC9CFGR_IC9SEL						(0x3u<<28)
#define	RCC_IC9CFGR_IC9SEL_0					(0x1u<<28)
#define	RCC_IC9CFGR_IC9INT						(0xFFu<<16)
#define	RCC_IC9CFGR_IC9INT_0					(0x1u<<16)

#define	RCC_IC9CFGR_IC9SEL_B_0X0				(0x0u<<28)
#define	RCC_IC9CFGR_IC9SEL_B_0X1				(0x1u<<28)
#define	RCC_IC9CFGR_IC9SEL_B_0X2				(0x2u<<28)
#define	RCC_IC9CFGR_IC9SEL_B_0X3				(0x3u<<28)
#define	RCC_IC9CFGR_IC9INT_B_0X0				(0x0u<<16)
#define	RCC_IC9CFGR_IC9INT_B_0X1				(0x1u<<16)
#define	RCC_IC9CFGR_IC9INT_B_0X2				(0x2u<<16)
#define	RCC_IC9CFGR_IC9INT_B_0X3				(0x3u<<16)
#define	RCC_IC9CFGR_IC9INT_B_0XFF				(0xFFu<<16)

// IC10CFGR Configuration

#define	RCC_IC10CFGR_IC10SEL					(0x3u<<28)
#define	RCC_IC10CFGR_IC10SEL_0					(0x1u<<28)
#define	RCC_IC10CFGR_IC10INT					(0xFFu<<16)
#define	RCC_IC10CFGR_IC10INT_0					(0x1u<<16)

#define	RCC_IC10CFGR_IC10SEL_B_0X0				(0x0u<<28)
#define	RCC_IC10CFGR_IC10SEL_B_0X1				(0x1u<<28)
#define	RCC_IC10CFGR_IC10SEL_B_0X2				(0x2u<<28)
#define	RCC_IC10CFGR_IC10SEL_B_0X3				(0x3u<<28)
#define	RCC_IC10CFGR_IC10INT_B_0X0				(0x0u<<16)
#define	RCC_IC10CFGR_IC10INT_B_0X1				(0x1u<<16)
#define	RCC_IC10CFGR_IC10INT_B_0X2				(0x2u<<16)
#define	RCC_IC10CFGR_IC10INT_B_0X3				(0x3u<<16)
#define	RCC_IC10CFGR_IC10INT_B_0XFF				(0xFFu<<16)

// IC11CFGR Configuration

#define	RCC_IC11CFGR_IC11SEL					(0x3u<<28)
#define	RCC_IC11CFGR_IC11SEL_0					(0x1u<<28)
#define	RCC_IC11CFGR_IC11INT					(0xFFu<<16)
#define	RCC_IC11CFGR_IC11INT_0					(0x1u<<16)

#define	RCC_IC11CFGR_IC11SEL_B_0X0				(0x0u<<28)
#define	RCC_IC11CFGR_IC11SEL_B_0X1				(0x1u<<28)
#define	RCC_IC11CFGR_IC11SEL_B_0X2				(0x2u<<28)
#define	RCC_IC11CFGR_IC11SEL_B_0X3				(0x3u<<28)
#define	RCC_IC11CFGR_IC11INT_B_0X0				(0x0u<<16)
#define	RCC_IC11CFGR_IC11INT_B_0X1				(0x1u<<16)
#define	RCC_IC11CFGR_IC11INT_B_0X2				(0x2u<<16)
#define	RCC_IC11CFGR_IC11INT_B_0X3				(0x3u<<16)
#define	RCC_IC11CFGR_IC11INT_B_0XFF				(0xFFu<<16)

// IC12CFGR Configuration

#define	RCC_IC12CFGR_IC12SEL					(0x3u<<28)
#define	RCC_IC12CFGR_IC12SEL_0					(0x1u<<28)
#define	RCC_IC12CFGR_IC12INT					(0xFFu<<16)
#define	RCC_IC12CFGR_IC12INT_0					(0x1u<<16)

