hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
#define	RCC_IC12CFGR_IC12SEL_B_0X0				(0x0u<<28)
#define	RCC_IC12CFGR_IC12SEL_B_0X1				(0x1u<<28)
#define	RCC_IC12CFGR_IC12SEL_B_0X2				(0x2u<<28)
#define	RCC_IC12CFGR_IC12SEL_B_0X3				(0x3u<<28)
#define	RCC_IC12CFGR_IC12INT_B_0X0				(0x0u<<16)
#define	RCC_IC12CFGR_IC12INT_B_0X1				(0x1u<<16)
#define	RCC_IC12CFGR_IC12INT_B_0X2				(0x2u<<16)
#define	RCC_IC12CFGR_IC12INT_B_0X3				(0x3u<<16)
#define	RCC_IC12CFGR_IC12INT_B_0XFF				(0xFFu<<16)

// IC13CFGR Configuration

#define	RCC_IC13CFGR_IC13SEL					(0x3u<<28)
#define	RCC_IC13CFGR_IC13SEL_0					(0x1u<<28)
#define	RCC_IC13CFGR_IC13INT					(0xFFu<<16)
#define	RCC_IC13CFGR_IC13INT_0					(0x1u<<16)

#define	RCC_IC13CFGR_IC13SEL_B_0X0				(0x0u<<28)
#define	RCC_IC13CFGR_IC13SEL_B_0X1				(0x1u<<28)
#define	RCC_IC13CFGR_IC13SEL_B_0X2				(0x2u<<28)
#define	RCC_IC13CFGR_IC13SEL_B_0X3				(0x3u<<28)
#define	RCC_IC13CFGR_IC13INT_B_0X0				(0x0u<<16)
#define	RCC_IC13CFGR_IC13INT_B_0X1				(0x1u<<16)
#define	RCC_IC13CFGR_IC13INT_B_0X2				(0x2u<<16)
#define	RCC_IC13CFGR_IC13INT_B_0X3				(0x3u<<16)
#define	RCC_IC13CFGR_IC13INT_B_0XFF				(0xFFu<<16)

// IC14CFGR Configuration

#define	RCC_IC14CFGR_IC14SEL					(0x3u<<28)
#define	RCC_IC14CFGR_IC14SEL_0					(0x1u<<28)
#define	RCC_IC14CFGR_IC14INT					(0xFFu<<16)
#define	RCC_IC14CFGR_IC14INT_0					(0x1u<<16)

#define	RCC_IC14CFGR_IC14SEL_B_0X0				(0x0u<<28)
#define	RCC_IC14CFGR_IC14SEL_B_0X1				(0x1u<<28)
#define	RCC_IC14CFGR_IC14SEL_B_0X2				(0x2u<<28)
#define	RCC_IC14CFGR_IC14SEL_B_0X3				(0x3u<<28)
#define	RCC_IC14CFGR_IC14INT_B_0X0				(0x0u<<16)
#define	RCC_IC14CFGR_IC14INT_B_0X1				(0x1u<<16)
#define	RCC_IC14CFGR_IC14INT_B_0X2				(0x2u<<16)
#define	RCC_IC14CFGR_IC14INT_B_0X3				(0x3u<<16)
#define	RCC_IC14CFGR_IC14INT_B_0XFF				(0xFFu<<16)

// IC15CFGR Configuration

#define	RCC_IC15CFGR_IC15SEL					(0x3u<<28)
#define	RCC_IC15CFGR_IC15SEL_0					(0x1u<<28)
#define	RCC_IC15CFGR_IC15INT					(0xFFu<<16)
#define	RCC_IC15CFGR_IC15INT_0					(0x1u<<16)

#define	RCC_IC15CFGR_IC15SEL_B_0X0				(0x0u<<28)
#define	RCC_IC15CFGR_IC15SEL_B_0X1				(0x1u<<28)
#define	RCC_IC15CFGR_IC15SEL_B_0X2				(0x2u<<28)
#define	RCC_IC15CFGR_IC15SEL_B_0X3				(0x3u<<28)
#define	RCC_IC15CFGR_IC15INT_B_0X0				(0x0u<<16)
#define	RCC_IC15CFGR_IC15INT_B_0X1				(0x1u<<16)
#define	RCC_IC15CFGR_IC15INT_B_0X2				(0x2u<<16)
#define	RCC_IC15CFGR_IC15INT_B_0X3				(0x3u<<16)
#define	RCC_IC15CFGR_IC15INT_B_0XFF				(0xFFu<<16)

// IC16CFGR Configuration

#define	RCC_IC16CFGR_IC16SEL					(0x3u<<28)
#define	RCC_IC16CFGR_IC16SEL_0					(0x1u<<28)
#define	RCC_IC16CFGR_IC16INT					(0xFFu<<16)
#define	RCC_IC16CFGR_IC16INT_0					(0x1u<<16)

#define	RCC_IC16CFGR_IC16SEL_B_0X0				(0x0u<<28)
#define	RCC_IC16CFGR_IC16SEL_B_0X1				(0x1u<<28)
#define	RCC_IC16CFGR_IC16SEL_B_0X2				(0x2u<<28)
#define	RCC_IC16CFGR_IC16SEL_B_0X3				(0x3u<<28)
#define	RCC_IC16CFGR_IC16INT_B_0X1				(0x1u<<16)
#define	RCC_IC16CFGR_IC16INT_B_0X2				(0x2u<<16)
#define	RCC_IC16CFGR_IC16INT_B_0X3				(0x3u<<16)
#define	RCC_IC16CFGR_IC16INT_B_0XFF				(0xFFu<<16)

// IC17CFGR Configuration

#define	RCC_IC17CFGR_IC17SEL					(0x3u<<28)
#define	RCC_IC17CFGR_IC17SEL_0					(0x1u<<28)
#define	RCC_IC17CFGR_IC17INT					(0xFFu<<16)
#define	RCC_IC17CFGR_IC17INT_0					(0x1u<<16)

#define	RCC_IC17CFGR_IC17SEL_B_0X0				(0x0u<<28)
#define	RCC_IC17CFGR_IC17SEL_B_0X1				(0x1u<<28)
#define	RCC_IC17CFGR_IC17SEL_B_0X2				(0x2u<<28)
#define	RCC_IC17CFGR_IC17SEL_B_0X3				(0x3u<<28)
#define	RCC_IC17CFGR_IC17INT_B_0X0				(0x0u<<16)
#define	RCC_IC17CFGR_IC17INT_B_0X1				(0x1u<<16)
#define	RCC_IC17CFGR_IC17INT_B_0X2				(0x2u<<16)
#define	RCC_IC17CFGR_IC17INT_B_0X3				(0x3u<<16)
#define	RCC_IC17CFGR_IC17INT_B_0XFF				(0xFFu<<16)

// IC18CFGR Configuration

#define	RCC_IC18CFGR_IC18SEL					(0x3u<<28)
#define	RCC_IC18CFGR_IC18SEL_0					(0x1u<<28)
#define	RCC_IC18CFGR_IC18INT					(0xFFu<<16)
#define	RCC_IC18CFGR_IC18INT_0					(0x1u<<16)

#define	RCC_IC18CFGR_IC18SEL_B_0X0				(0x0u<<28)
#define	RCC_IC18CFGR_IC18SEL_B_0X1				(0x1u<<28)
#define	RCC_IC18CFGR_IC18SEL_B_0X2				(0x2u<<28)
#define	RCC_IC18CFGR_IC18SEL_B_0X3				(0x3u<<28)
#define	RCC_IC18CFGR_IC18INT_B_0X0				(0x0u<<16)
#define	RCC_IC18CFGR_IC18INT_B_0X1				(0x1u<<16)
#define	RCC_IC18CFGR_IC18INT_B_0X2				(0x2u<<16)
#define	RCC_IC18CFGR_IC18INT_B_0X3				(0x3u<<16)
#define	RCC_IC18CFGR_IC18INT_B_0XFF				(0xFFu<<16)

// IC19CFGR Configuration

#define	RCC_IC19CFGR_IC19SEL					(0x3u<<28)
#define	RCC_IC19CFGR_IC19SEL_0					(0x1u<<28)
#define	RCC_IC19CFGR_IC19INT					(0xFFu<<16)
#define	RCC_IC19CFGR_IC19INT_0					(0x1u<<16)

#define	RCC_IC19CFGR_IC19SEL_B_0X0				(0x0u<<28)
#define	RCC_IC19CFGR_IC19SEL_B_0X1				(0x1u<<28)
#define	RCC_IC19CFGR_IC19SEL_B_0X2				(0x2u<<28)
#define	RCC_IC19CFGR_IC19SEL_B_0X3				(0x3u<<28)
#define	RCC_IC19CFGR_IC19INT_B_0X0				(0x0u<<16)
#define	RCC_IC19CFGR_IC19INT_B_0X1				(0x1u<<16)
#define	RCC_IC19CFGR_IC19INT_B_0X2				(0x2u<<16)
#define	RCC_IC19CFGR_IC19INT_B_0X3				(0x3u<<16)
#define	RCC_IC19CFGR_IC19INT_B_0XFF				(0xFFu<<16)

// IC20CFGR Configuration

#define	RCC_IC20CFGR_IC20SEL					(0x3u<<28)
#define	RCC_IC20CFGR_IC20SEL_0					(0x1u<<28)
#define	RCC_IC20CFGR_IC20INT					(0xFFu<<16)
#define	RCC_IC20CFGR_IC20INT_0					(0x1u<<16)

#define	RCC_IC20CFGR_IC20SEL_B_0X0				(0x0u<<28)
#define	RCC_IC20CFGR_IC20SEL_B_0X1				(0x1u<<28)
#define	RCC_IC20CFGR_IC20SEL_B_0X2				(0x2u<<28)
#define	RCC_IC20CFGR_IC20SEL_B_0X3				(0x3u<<28)
#define	RCC_IC20CFGR_IC20INT_B_0X0				(0x0u<<16)
#define	RCC_IC20CFGR_IC20INT_B_0X1				(0x1u<<16)
#define	RCC_IC20CFGR_IC20INT_B_0X2				(0x2u<<16)
#define	RCC_IC20CFGR_IC20INT_B_0X3				(0x3u<<16)
#define	RCC_IC20CFGR_IC20INT_B_0XFF				(0xFFu<<16)

// CIER Configuration

#define	RCC_CIER_WKUPIE							(0x1u<<24)
#define	RCC_CIER_HSECSSIE						(0x1u<<17)
#define	RCC_CIER_LSECSSIE						(0x1u<<16)
#define	RCC_CIER_PLL4RDYIE						(0x1u<<11)
#define	RCC_CIER_PLL3RDYIE						(0x1u<<10)
#define	RCC_CIER_PLL2RDYIE						(0x1u<<9)
#define	RCC_CIER_PLL1RDYIE						(0x1u<<8)
#define	RCC_CIER_HSERDYIE						(0x1u<<4)
#define	RCC_CIER_HSIRDYIE						(0x1u<<3)
#define	RCC_CIER_MSIRDYIE						(0x1u<<2)
#define	RCC_CIER_LSERDYIE						(0x1u<<1)
#define	RCC_CIER_LSIRDYIE						(0x1u<<0)

#define	RCC_CIER_WKUPIE_B_0X0					(0x0u<<24)
#define	RCC_CIER_WKUPIE_B_0X1					(0x1u<<24)
#define	RCC_CIER_HSECSSIE_B_0X0					(0x0u<<17)
#define	RCC_CIER_HSECSSIE_B_0X1					(0x1u<<17)
#define	RCC_CIER_LSECSSIE_B_0X0					(0x0u<<16)
#define	RCC_CIER_LSECSSIE_B_0X1					(0x1u<<16)
#define	RCC_CIER_PLL4RDYIE_B_0X0				(0x0u<<11)
#define	RCC_CIER_PLL4RDYIE_B_0X1				(0x1u<<11)
#define	RCC_CIER_PLL3RDYIE_B_0X0				(0x0u<<10)
#define	RCC_CIER_PLL3RDYIE_B_0X1				(0x1u<<10)
#define	RCC_CIER_PLL2RDYIE_B_0X0				(0x0u<<9)
#define	RCC_CIER_PLL2RDYIE_B_0X1				(0x1u<<9)
#define	RCC_CIER_PLL1RDYIE_B_0X0				(0x0u<<8)
#define	RCC_CIER_PLL1RDYIE_B_0X1				(0x1u<<8)
#define	RCC_CIER_HSERDYIE_B_0X0					(0x0u<<4)
#define	RCC_CIER_HSERDYIE_B_0X1					(0x1u<<4)
#define	RCC_CIER_HSIRDYIE_B_0X0					(0x0u<<3)
#define	RCC_CIER_HSIRDYIE_B_0X1					(0x1u<<3)
#define	RCC_CIER_MSIRDYIE_B_0X0					(0x0u<<2)
#define	RCC_CIER_MSIRDYIE_B_0X1					(0x1u<<2)
#define	RCC_CIER_LSERDYIE_B_0X0					(0x0u<<1)
#define	RCC_CIER_LSERDYIE_B_0X1					(0x1u<<1)
#define	RCC_CIER_LSIRDYIE_B_0X0					(0x0u<<0)
#define	RCC_CIER_LSIRDYIE_B_0X1					(0x1u<<0)

// CIFR Configuration

#define	RCC_CIFR_WKUPF							(0x1u<<24)
#define	RCC_CIFR_HSECSSF						(0x1u<<17)
#define	RCC_CIFR_LSECSSF						(0x1u<<16)
#define	RCC_CIFR_PLL4RDYF						(0x1u<<11)
#define	RCC_CIFR_PLL3RDYF						(0x1u<<10)
#define	RCC_CIFR_PLL2RDYF						(0x1u<<9)
#define	RCC_CIFR_PLL1RDYF						(0x1u<<8)
#define	RCC_CIFR_HSERDYF						(0x1u<<4)
#define	RCC_CIFR_HSIRDYF						(0x1u<<3)
#define	RCC_CIFR_MSIRDYF						(0x1u<<2)
#define	RCC_CIFR_LSERDYF						(0x1u<<1)
#define	RCC_CIFR_LSIRDYF						(0x1u<<0)

#define	RCC_CIFR_WKUPF_B_0X0					(0x0u<<24)
#define	RCC_CIFR_WKUPF_B_0X1					(0x1u<<24)
#define	RCC_CIFR_HSECSSF_B_0X0					(0x0u<<17)
#define	RCC_CIFR_HSECSSF_B_0X1					(0x1u<<17)
#define	RCC_CIFR_LSECSSF_B_0X0					(0x0u<<16)
#define	RCC_CIFR_LSECSSF_B_0X1					(0x1u<<16)
#define	RCC_CIFR_PLL4RDYF_B_0X0					(0x0u<<11)
#define	RCC_CIFR_PLL4RDYF_B_0X1					(0x1u<<11)
#define	RCC_CIFR_PLL3RDYF_B_0X0					(0x0u<<10)
#define	RCC_CIFR_PLL3RDYF_B_0X1					(0x1u<<10)
#define	RCC_CIFR_PLL2RDYF_B_0X0					(0x0u<<9)
#define	RCC_CIFR_PLL2RDYF_B_0X1					(0x1u<<9)
#define	RCC_CIFR_PLL1RDYF_B_0X0					(0x0u<<8)
#define	RCC_CIFR_PLL1RDYF_B_0X1					(0x1u<<8)
#define	RCC_CIFR_HSERDYF_B_0X0					(0x0u<<4)
#define	RCC_CIFR_HSERDYF_B_0X1					(0x1u<<4)
#define	RCC_CIFR_HSIRDYF_B_0X0					(0x0u<<3)
#define	RCC_CIFR_HSIRDYF_B_0X1					(0x1u<<3)
#define	RCC_CIFR_MSIRDYF_B_0X0					(0x0u<<2)
#define	RCC_CIFR_MSIRDYF_B_0X1					(0x1u<<2)
#define	RCC_CIFR_LSERDYF_B_0X0					(0x0u<<1)
#define	RCC_CIFR_LSERDYF_B_0X1					(0x1u<<1)
#define	RCC_CIFR_LSIRDYF_B_0X0					(0x0u<<0)
#define	RCC_CIFR_LSIRDYF_B_0X1					(0x1u<<0)

// CICR Configuration

#define	RCC_CICR_WKUPFC							(0x1u<<24)
#define	RCC_CICR_HSECSSC						(0x1u<<17)
#define	RCC_CICR_LSECSSC						(0x1u<<16)
#define	RCC_CICR_PLL4RDYC						(0x1u<<11)
#define	RCC_CICR_PLL3RDYC						(0x1u<<10)
#define	RCC_CICR_PLL2RDYC						(0x1u<<9)
#define	RCC_CICR_PLL1RDYC						(0x1u<<8)
#define	RCC_CICR_HSERDYC						(0x1u<<4)
#define	RCC_CICR_HSIRDYC						(0x1u<<3)
#define	RCC_CICR_MSIRDYC						(0x1u<<2)
#define	RCC_CICR_LSERDYC						(0x1u<<1)
#define	RCC_CICR_LSIRDYC						(0x1u<<0)

#define	RCC_CICR_WKUPFC_B_0X0					(0x0u<<24)
#define	RCC_CICR_WKUPFC_B_0X1					(0x1u<<24)
#define	RCC_CICR_HSECSSC_B_0X0					(0x0u<<17)
#define	RCC_CICR_HSECSSC_B_0X1					(0x1u<<17)
#define	RCC_CICR_LSECSSC_B_0X0					(0x0u<<16)
#define	RCC_CICR_LSECSSC_B_0X1					(0x1u<<16)
#define	RCC_CICR_PLL4RDYC_B_0X0					(0x0u<<11)
#define	RCC_CICR_PLL4RDYC_B_0X1					(0x1u<<11)
#define	RCC_CICR_PLL3RDYC_B_0X0					(0x0u<<10)
#define	RCC_CICR_PLL3RDYC_B_0X1					(0x1u<<10)
#define	RCC_CICR_PLL2RDYC_B_0X0					(0x0u<<9)
#define	RCC_CICR_PLL2RDYC_B_0X1					(0x1u<<9)
#define	RCC_CICR_PLL1RDYC_B_0X0					(0x0u<<8)
#define	RCC_CICR_PLL1RDYC_B_0X1					(0x1u<<8)
#define	RCC_CICR_HSERDYC_B_0X0					(0x0u<<4)
#define	RCC_CICR_HSERDYC_B_0X1					(0x1u<<4)
#define	RCC_CICR_HSIRDYC_B_0X0					(0x0u<<3)
#define	RCC_CICR_HSIRDYC_B_0X1					(0x1u<<3)
#define	RCC_CICR_MSIRDYC_B_0X0					(0x0u<<2)
#define	RCC_CICR_MSIRDYC_B_0X1					(0x1u<<2)
#define	RCC_CICR_LSERDYC_B_0X0					(0x0u<<1)
#define	RCC_CICR_LSERDYC_B_0X1					(0x1u<<1)
#define	RCC_CICR_LSIRDYC_B_0X0					(0x0u<<0)
#define	RCC_CICR_LSIRDYC_B_0X1					(0x1u<<0)

