hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
// CCIPR1 Configuration

#define	RCC_CCIPR1_DCMIPPSEL					(0x3u<<20)
#define	RCC_CCIPR1_DCMIPPSEL_0					(0x1u<<20)
#define	RCC_CCIPR1_ADCPRE						(0xFFu<<8)
#define	RCC_CCIPR1_ADCPRE_0						(0x1u<<8)
#define	RCC_CCIPR1_ADC12SEL						(0x7u<<4)
#define	RCC_CCIPR1_ADC12SEL_0					(0x1u<<4)
#define	RCC_CCIPR1_ADF1SEL						(0x7u<<0)
#define	RCC_CCIPR1_ADF1SEL_0					(0x1u<<0)

#define	RCC_CCIPR1_DCMIPPSEL_B_0X0				(0x0u<<20)
#define	RCC_CCIPR1_DCMIPPSEL_B_0X1				(0x1u<<20)
#define	RCC_CCIPR1_DCMIPPSEL_B_0X2				(0x2u<<20)
#define	RCC_CCIPR1_DCMIPPSEL_B_0X3				(0x3u<<20)
#define	RCC_CCIPR1_ADCPRE_B_0X0					(0x0u<<8)
#define	RCC_CCIPR1_ADCPRE_B_0X1					(0x1u<<8)
#define	RCC_CCIPR1_ADCPRE_B_0X2					(0x2u<<8)
#define	RCC_CCIPR1_ADCPRE_B_0X3					(0x3u<<8)
#define	RCC_CCIPR1_ADC12SEL_B_0X0				(0x0u<<4)
#define	RCC_CCIPR1_ADC12SEL_B_0X1				(0x1u<<4)
#define	RCC_CCIPR1_ADC12SEL_B_0X2				(0x2u<<4)
#define	RCC_CCIPR1_ADC12SEL_B_0X3				(0x3u<<4)
#define	RCC_CCIPR1_ADC12SEL_B_0X4				(0x4u<<4)
#define	RCC_CCIPR1_ADC12SEL_B_0X5				(0x5u<<4)
#define	RCC_CCIPR1_ADC12SEL_B_0X6				(0x6u<<4)
#define	RCC_CCIPR1_ADC12SEL_B_0X7				(0x7u<<4)
#define	RCC_CCIPR1_ADF1SEL_B_0X0				(0x0u<<0)
#define	RCC_CCIPR1_ADF1SEL_B_0X1				(0x1u<<0)
#define	RCC_CCIPR1_ADF1SEL_B_0X2				(0x2u<<0)
#define	RCC_CCIPR1_ADF1SEL_B_0X3				(0x3u<<0)
#define	RCC_CCIPR1_ADF1SEL_B_0X4				(0x4u<<0)
#define	RCC_CCIPR1_ADF1SEL_B_0X5				(0x5u<<0)
#define	RCC_CCIPR1_ADF1SEL_B_0X6				(0x6u<<0)
#define	RCC_CCIPR1_ADF1SEL_B_0X7				(0x7u<<0)

// CCIPR2 Configuration

#define	RCC_CCIPR2_ETH1GTXCLKSEL				(0x1u<<24)
#define	RCC_CCIPR2_ETH1REFCLKSEL				(0x1u<<20)
#define	RCC_CCIPR2_ETH1SEL						(0x7u<<16)
#define	RCC_CCIPR2_ETH1SEL_0					(0x1u<<16)
#define	RCC_CCIPR2_ETH1CLKSEL					(0x3u<<12)
#define	RCC_CCIPR2_ETH1CLKSEL_0					(0x1u<<12)
#define	RCC_CCIPR2_ETH1PWRDOWNACK				(0x1u<<8)
#define	RCC_CCIPR2_ETH1PTPDIV					(0xFu<<4)
#define	RCC_CCIPR2_ETH1PTPDIV_0					(0x1u<<4)
#define	RCC_CCIPR2_ETH1PTPSEL					(0x3u<<0)
#define	RCC_CCIPR2_ETH1PTPSEL_0					(0x1u<<0)

#define	RCC_CCIPR2_ETH1GTXCLKSEL_B_0X0			(0x0u<<24)
#define	RCC_CCIPR2_ETH1GTXCLKSEL_B_0X1			(0x1u<<24)
#define	RCC_CCIPR2_ETH1CLKSEL_B_0X0				(0x0u<<12)
#define	RCC_CCIPR2_ETH1CLKSEL_B_0X1				(0x1u<<12)
#define	RCC_CCIPR2_ETH1CLKSEL_B_0X2				(0x2u<<12)
#define	RCC_CCIPR2_ETH1CLKSEL_B_0X3				(0x3u<<12)
#define	RCC_CCIPR2_ETH1PWRDOWNACK_B_0X0			(0x0u<<8)
#define	RCC_CCIPR2_ETH1PWRDOWNACK_B_0X1			(0x1u<<8)
#define	RCC_CCIPR2_ETH1PTPDIV_B_0X0				(0x0u<<4)
#define	RCC_CCIPR2_ETH1PTPDIV_B_0X1				(0x1u<<4)
#define	RCC_CCIPR2_ETH1PTPDIV_B_0X2				(0x2u<<4)
#define	RCC_CCIPR2_ETH1PTPDIV_B_0X3				(0x3u<<4)
#define	RCC_CCIPR2_ETH1PTPDIV_B_0XF				(0xFu<<4)
#define	RCC_CCIPR2_ETH1PTPSEL_B_0X0				(0x0u<<0)
#define	RCC_CCIPR2_ETH1PTPSEL_B_0X1				(0x1u<<0)
#define	RCC_CCIPR2_ETH1PTPSEL_B_0X2				(0x2u<<0)
#define	RCC_CCIPR2_ETH1PTPSEL_B_0X3				(0x3u<<0)

// CCIPR3 Configuration

#define	RCC_CCIPR3_DFTSEL						(0x1u<<8)
#define	RCC_CCIPR3_FMCSEL						(0x3u<<4)
#define	RCC_CCIPR3_FMCSEL_0						(0x1u<<4)
#define	RCC_CCIPR3_FDCANSEL						(0x3u<<0)
#define	RCC_CCIPR3_FDCANSEL_0					(0x1u<<0)

#define	RCC_CCIPR3_DFTSEL_B_0X0					(0x0u<<8)
#define	RCC_CCIPR3_DFTSEL_B_0X1					(0x1u<<8)
#define	RCC_CCIPR3_FMCSEL_B_0X0					(0x0u<<4)
#define	RCC_CCIPR3_FMCSEL_B_0X1					(0x1u<<4)
#define	RCC_CCIPR3_FMCSEL_B_0X2					(0x2u<<4)
#define	RCC_CCIPR3_FMCSEL_B_0X3					(0x3u<<4)
#define	RCC_CCIPR3_FDCANSEL_B_0X0				(0x0u<<0)
#define	RCC_CCIPR3_FDCANSEL_B_0X1				(0x1u<<0)
#define	RCC_CCIPR3_FDCANSEL_B_0X2				(0x2u<<0)
#define	RCC_CCIPR3_FDCANSEL_B_0X3				(0x3u<<0)

// CCIPR4 Configuration

#define	RCC_CCIPR4_LTDCSEL						(0x3u<<24)
#define	RCC_CCIPR4_LTDCSEL_0					(0x1u<<24)
#define	RCC_CCIPR4_I3C2SEL						(0x7u<<20)
#define	RCC_CCIPR4_I3C2SEL_0					(0x1u<<20)
#define	RCC_CCIPR4_I3C1SEL						(0x7u<<16)
#define	RCC_CCIPR4_I3C1SEL_0					(0x1u<<16)
#define	RCC_CCIPR4_I2C4SEL						(0x7u<<12)
#define	RCC_CCIPR4_I2C4SEL_0					(0x1u<<12)
#define	RCC_CCIPR4_I2C3SEL						(0x7u<<8)
#define	RCC_CCIPR4_I2C3SEL_0					(0x1u<<8)
#define	RCC_CCIPR4_I2C2SEL						(0x7u<<4)
#define	RCC_CCIPR4_I2C2SEL_0					(0x1u<<4)
#define	RCC_CCIPR4_I2C1SEL						(0x7u<<0)
#define	RCC_CCIPR4_I2C1SEL_0					(0x1u<<0)

#define	RCC_CCIPR4_LTDCSEL_B_0X0				(0x0u<<24)
#define	RCC_CCIPR4_LTDCSEL_B_0X1				(0x1u<<24)
#define	RCC_CCIPR4_LTDCSEL_B_0X2				(0x2u<<24)
#define	RCC_CCIPR4_LTDCSEL_B_0X3				(0x3u<<24)
#define	RCC_CCIPR4_I3C2SEL_B_0X0				(0x0u<<20)
#define	RCC_CCIPR4_I3C2SEL_B_0X1				(0x1u<<20)
#define	RCC_CCIPR4_I3C2SEL_B_0X2				(0x2u<<20)
#define	RCC_CCIPR4_I3C2SEL_B_0X3				(0x3u<<20)
#define	RCC_CCIPR4_I3C2SEL_B_0X4				(0x4u<<20)
#define	RCC_CCIPR4_I3C2SEL_B_0X5				(0x5u<<20)
#define	RCC_CCIPR4_I3C1SEL_B_0X0				(0x0u<<16)
#define	RCC_CCIPR4_I3C1SEL_B_0X1				(0x1u<<16)
#define	RCC_CCIPR4_I3C1SEL_B_0X2				(0x2u<<16)
#define	RCC_CCIPR4_I3C1SEL_B_0X3				(0x3u<<16)
#define	RCC_CCIPR4_I3C1SEL_B_0X4				(0x4u<<16)
#define	RCC_CCIPR4_I3C1SEL_B_0X5				(0x5u<<16)
#define	RCC_CCIPR4_I2C4SEL_B_0X0				(0x0u<<12)
#define	RCC_CCIPR4_I2C4SEL_B_0X1				(0x1u<<12)
#define	RCC_CCIPR4_I2C4SEL_B_0X2				(0x2u<<12)
#define	RCC_CCIPR4_I2C4SEL_B_0X3				(0x3u<<12)
#define	RCC_CCIPR4_I2C4SEL_B_0X4				(0x4u<<12)
#define	RCC_CCIPR4_I2C4SEL_B_0X5				(0x5u<<12)
#define	RCC_CCIPR4_I2C3SEL_B_0X0				(0x0u<<8)
#define	RCC_CCIPR4_I2C3SEL_B_0X1				(0x1u<<8)
#define	RCC_CCIPR4_I2C3SEL_B_0X2				(0x2u<<8)
#define	RCC_CCIPR4_I2C3SEL_B_0X3				(0x3u<<8)
#define	RCC_CCIPR4_I2C3SEL_B_0X4				(0x4u<<8)
#define	RCC_CCIPR4_I2C3SEL_B_0X5				(0x5u<<8)
#define	RCC_CCIPR4_I2C2SEL_B_0X0				(0x0u<<4)
#define	RCC_CCIPR4_I2C2SEL_B_0X1				(0x1u<<4)
#define	RCC_CCIPR4_I2C2SEL_B_0X2				(0x2u<<4)
#define	RCC_CCIPR4_I2C2SEL_B_0X3				(0x3u<<4)
#define	RCC_CCIPR4_I2C2SEL_B_0X4				(0x4u<<4)
#define	RCC_CCIPR4_I2C2SEL_B_0X5				(0x5u<<4)
#define	RCC_CCIPR4_I2C1SEL_B_0X0				(0x0u<<0)
#define	RCC_CCIPR4_I2C1SEL_B_0X1				(0x1u<<0)
#define	RCC_CCIPR4_I2C1SEL_B_0X2				(0x2u<<0)
#define	RCC_CCIPR4_I2C1SEL_B_0X3				(0x3u<<0)
#define	RCC_CCIPR4_I2C1SEL_B_0X4				(0x4u<<0)
#define	RCC_CCIPR4_I2C1SEL_B_0X5				(0x5u<<0)

// CCIPR5 Configuration

#define	RCC_CCIPR5_MDF1SEL						(0x7u<<16)
#define	RCC_CCIPR5_MDF1SEL_0					(0x1u<<16)
#define	RCC_CCIPR5_MCO2PRE						(0xFu<<12)
#define	RCC_CCIPR5_MCO2PRE_0					(0x1u<<12)
#define	RCC_CCIPR5_MCO2SEL						(0x7u<<8)
#define	RCC_CCIPR5_MCO2SEL_0					(0x1u<<8)
#define	RCC_CCIPR5_MCO1PRE						(0xFu<<4)
#define	RCC_CCIPR5_MCO1PRE_0					(0x1u<<4)
#define	RCC_CCIPR5_MCO1SEL						(0x7u<<0)
#define	RCC_CCIPR5_MCO1SEL_0					(0x1u<<0)

