hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
#define	RCC_CCIPR5_MDF1SEL_B_0X0				(0x0u<<16)
#define	RCC_CCIPR5_MDF1SEL_B_0X1				(0x1u<<16)
#define	RCC_CCIPR5_MDF1SEL_B_0X2				(0x2u<<16)
#define	RCC_CCIPR5_MDF1SEL_B_0X3				(0x3u<<16)
#define	RCC_CCIPR5_MDF1SEL_B_0X4				(0x4u<<16)
#define	RCC_CCIPR5_MDF1SEL_B_0X5				(0x5u<<16)
#define	RCC_CCIPR5_MDF1SEL_B_0X6				(0x6u<<16)
#define	RCC_CCIPR5_MDF1SEL_B_0X7				(0x7u<<16)
#define	RCC_CCIPR5_MCO2PRE_B_0X0				(0x0u<<12)
#define	RCC_CCIPR5_MCO2PRE_B_0X1				(0x1u<<12)
#define	RCC_CCIPR5_MCO2PRE_B_0X2				(0x2u<<12)
#define	RCC_CCIPR5_MCO2PRE_B_0X3				(0x3u<<12)
#define	RCC_CCIPR5_MCO2PRE_B_0XF				(0xFu<<12)
#define	RCC_CCIPR5_MCO2SEL_B_0X0				(0x0u<<8)
#define	RCC_CCIPR5_MCO2SEL_B_0X1				(0x1u<<8)
#define	RCC_CCIPR5_MCO2SEL_B_0X2				(0x2u<<8)
#define	RCC_CCIPR5_MCO2SEL_B_0X3				(0x3u<<8)
#define	RCC_CCIPR5_MCO2SEL_B_0X4				(0x4u<<8)
#define	RCC_CCIPR5_MCO2SEL_B_0X5				(0x5u<<8)
#define	RCC_CCIPR5_MCO2SEL_B_0X6				(0x6u<<8)
#define	RCC_CCIPR5_MCO2SEL_B_0X7				(0x7u<<8)
#define	RCC_CCIPR5_MCO1PRE_B_0X0				(0x0u<<4)
#define	RCC_CCIPR5_MCO1PRE_B_0X1				(0x1u<<4)
#define	RCC_CCIPR5_MCO1PRE_B_0X2				(0x2u<<4)
#define	RCC_CCIPR5_MCO1PRE_B_0X3				(0x3u<<4)
#define	RCC_CCIPR5_MCO1PRE_B_0XF				(0xFu<<4)
#define	RCC_CCIPR5_MCO1SEL_B_0X0				(0x0u<<0)
#define	RCC_CCIPR5_MCO1SEL_B_0X1				(0x1u<<0)
#define	RCC_CCIPR5_MCO1SEL_B_0X2				(0x2u<<0)
#define	RCC_CCIPR5_MCO1SEL_B_0X3				(0x3u<<0)
#define	RCC_CCIPR5_MCO1SEL_B_0X4				(0x4u<<0)
#define	RCC_CCIPR5_MCO1SEL_B_0X5				(0x5u<<0)
#define	RCC_CCIPR5_MCO1SEL_B_0X6				(0x6u<<0)
#define	RCC_CCIPR5_MCO1SEL_B_0X7				(0x7u<<0)

// CCIPR6 Configuration

#define	RCC_CCIPR6_OTGPHY2CKREFSEL				(0x1u<<24)
#define	RCC_CCIPR6_OTGPHY2SEL					(0x3u<<20)
#define	RCC_CCIPR6_OTGPHY2SEL_0					(0x1u<<20)
#define	RCC_CCIPR6_OTGPHY1CKREFSEL				(0x1u<<16)
#define	RCC_CCIPR6_OTGPHY1SEL					(0x3u<<12)
#define	RCC_CCIPR6_OTGPHY1SEL_0					(0x1u<<12)
#define	RCC_CCIPR6_XSPI3SEL						(0x3u<<8)
#define	RCC_CCIPR6_XSPI3SEL_0					(0x1u<<8)
#define	RCC_CCIPR6_XSPI2SEL						(0x3u<<4)
#define	RCC_CCIPR6_XSPI2SEL_0					(0x1u<<4)
#define	RCC_CCIPR6_XSPI1SEL						(0x3u<<0)
#define	RCC_CCIPR6_XSPI1SEL_0					(0x1u<<0)

#define	RCC_CCIPR6_OTGPHY2SEL_B_0X0				(0x0u<<20)
#define	RCC_CCIPR6_OTGPHY2SEL_B_0X1				(0x1u<<20)
#define	RCC_CCIPR6_OTGPHY2SEL_B_0X2				(0x2u<<20)
#define	RCC_CCIPR6_OTGPHY2SEL_B_0X3				(0x3u<<20)
#define	RCC_CCIPR6_OTGPHY1SEL_B_0X0				(0x0u<<12)
#define	RCC_CCIPR6_OTGPHY1SEL_B_0X1				(0x1u<<12)
#define	RCC_CCIPR6_OTGPHY1SEL_B_0X2				(0x2u<<12)
#define	RCC_CCIPR6_OTGPHY1SEL_B_0X3				(0x3u<<12)
#define	RCC_CCIPR6_XSPI3SEL_B_0X0				(0x0u<<8)
#define	RCC_CCIPR6_XSPI3SEL_B_0X1				(0x1u<<8)
#define	RCC_CCIPR6_XSPI3SEL_B_0X2				(0x2u<<8)
#define	RCC_CCIPR6_XSPI3SEL_B_0X3				(0x3u<<8)
#define	RCC_CCIPR6_XSPI2SEL_B_0X0				(0x0u<<4)
#define	RCC_CCIPR6_XSPI2SEL_B_0X1				(0x1u<<4)
#define	RCC_CCIPR6_XSPI2SEL_B_0X2				(0x2u<<4)
#define	RCC_CCIPR6_XSPI2SEL_B_0X3				(0x3u<<4)
#define	RCC_CCIPR6_XSPI1SEL_B_0X0				(0x0u<<0)
#define	RCC_CCIPR6_XSPI1SEL_B_0X1				(0x1u<<0)
#define	RCC_CCIPR6_XSPI1SEL_B_0X2				(0x2u<<0)
#define	RCC_CCIPR6_XSPI1SEL_B_0X3				(0x3u<<0)

// CCIPR7 Configuration

#define	RCC_CCIPR7_SAI2SEL						(0x7u<<24)
#define	RCC_CCIPR7_SAI2SEL_0					(0x1u<<24)
#define	RCC_CCIPR7_SAI1SEL						(0x7u<<20)
#define	RCC_CCIPR7_SAI1SEL_0					(0x1u<<20)
#define	RCC_CCIPR7_RTCPRE						(0x3Fu<<12)
#define	RCC_CCIPR7_RTCPRE_0						(0x1u<<12)
#define	RCC_CCIPR7_RTCSEL						(0x3u<<8)
#define	RCC_CCIPR7_RTCSEL_0						(0x1u<<8)
#define	RCC_CCIPR7_PSSISEL						(0x3u<<4)
#define	RCC_CCIPR7_PSSISEL_0					(0x1u<<4)
#define	RCC_CCIPR7_PERSEL						(0x7u<<0)
#define	RCC_CCIPR7_PERSEL_0						(0x1u<<0)

#define	RCC_CCIPR7_SAI2SEL_B_0X0				(0x0u<<24)
#define	RCC_CCIPR7_SAI2SEL_B_0X1				(0x1u<<24)
#define	RCC_CCIPR7_SAI2SEL_B_0X2				(0x2u<<24)
#define	RCC_CCIPR7_SAI2SEL_B_0X3				(0x3u<<24)
#define	RCC_CCIPR7_SAI2SEL_B_0X4				(0x4u<<24)
#define	RCC_CCIPR7_SAI2SEL_B_0X5				(0x5u<<24)
#define	RCC_CCIPR7_SAI2SEL_B_0X6				(0x6u<<24)
#define	RCC_CCIPR7_SAI2SEL_B_0X7				(0x7u<<24)
#define	RCC_CCIPR7_SAI1SEL_B_0X0				(0x0u<<20)
#define	RCC_CCIPR7_SAI1SEL_B_0X1				(0x1u<<20)
#define	RCC_CCIPR7_SAI1SEL_B_0X2				(0x2u<<20)
#define	RCC_CCIPR7_SAI1SEL_B_0X3				(0x3u<<20)
#define	RCC_CCIPR7_SAI1SEL_B_0X4				(0x4u<<20)
#define	RCC_CCIPR7_SAI1SEL_B_0X5				(0x5u<<20)
#define	RCC_CCIPR7_SAI1SEL_B_0X6				(0x6u<<20)
#define	RCC_CCIPR7_SAI1SEL_B_0X7				(0x7u<<20)
#define	RCC_CCIPR7_RTCPRE_B_0X0					(0x0u<<12)
#define	RCC_CCIPR7_RTCPRE_B_0X1					(0x1u<<12)
#define	RCC_CCIPR7_RTCPRE_B_0X2					(0x2u<<12)
#define	RCC_CCIPR7_RTCPRE_B_0X3					(0x3u<<12)
#define	RCC_CCIPR7_RTCPRE_B_0X3F				(0x3Fu<<12)
#define	RCC_CCIPR7_RTCSEL_B_0X1					(0x1u<<8)
#define	RCC_CCIPR7_RTCSEL_B_0X2					(0x2u<<8)
#define	RCC_CCIPR7_RTCSEL_B_0X3					(0x3u<<8)
#define	RCC_CCIPR7_PSSISEL_B_0X0				(0x0u<<4)
#define	RCC_CCIPR7_PSSISEL_B_0X1				(0x1u<<4)
#define	RCC_CCIPR7_PSSISEL_B_0X2				(0x2u<<4)
#define	RCC_CCIPR7_PSSISEL_B_0X3				(0x3u<<4)
#define	RCC_CCIPR7_PERSEL_B_0X0					(0x0u<<0)
#define	RCC_CCIPR7_PERSEL_B_0X1					(0x1u<<0)
#define	RCC_CCIPR7_PERSEL_B_0X2					(0x2u<<0)
#define	RCC_CCIPR7_PERSEL_B_0X3					(0x3u<<0)
#define	RCC_CCIPR7_PERSEL_B_0X4					(0x4u<<0)
#define	RCC_CCIPR7_PERSEL_B_0X5					(0x5u<<0)
#define	RCC_CCIPR7_PERSEL_B_0X6					(0x6u<<0)
#define	RCC_CCIPR7_PERSEL_B_0X7					(0x7u<<0)

// CCIPR8 Configuration

#define	RCC_CCIPR8_SDMMC2SEL					(0x3u<<4)
#define	RCC_CCIPR8_SDMMC2SEL_0					(0x1u<<4)
#define	RCC_CCIPR8_SDMMC1SEL					(0x3u<<0)
#define	RCC_CCIPR8_SDMMC1SEL_0					(0x1u<<0)

#define	RCC_CCIPR8_SDMMC2SEL_B_0X0				(0x0u<<4)
#define	RCC_CCIPR8_SDMMC2SEL_B_0X1				(0x1u<<4)
#define	RCC_CCIPR8_SDMMC2SEL_B_0X2				(0x2u<<4)
#define	RCC_CCIPR8_SDMMC2SEL_B_0X3				(0x3u<<4)
#define	RCC_CCIPR8_SDMMC1SEL_B_0X0				(0x0u<<0)
#define	RCC_CCIPR8_SDMMC1SEL_B_0X1				(0x1u<<0)
#define	RCC_CCIPR8_SDMMC1SEL_B_0X2				(0x2u<<0)
#define	RCC_CCIPR8_SDMMC1SEL_B_0X3				(0x3u<<0)

// CCIPR9 Configuration

#define	RCC_CCIPR9_SPI6SEL						(0x7u<<24)
#define	RCC_CCIPR9_SPI6SEL_0					(0x1u<<24)
#define	RCC_CCIPR9_SPI5SEL						(0x7u<<20)
#define	RCC_CCIPR9_SPI5SEL_0					(0x1u<<20)
#define	RCC_CCIPR9_SPI4SEL						(0x7u<<16)
#define	RCC_CCIPR9_SPI4SEL_0					(0x1u<<16)
#define	RCC_CCIPR9_SPI3SEL						(0x7u<<12)
#define	RCC_CCIPR9_SPI3SEL_0					(0x1u<<12)
#define	RCC_CCIPR9_SPI2SEL						(0x7u<<8)
#define	RCC_CCIPR9_SPI2SEL_0					(0x1u<<8)
#define	RCC_CCIPR9_SPI1SEL						(0x7u<<4)
#define	RCC_CCIPR9_SPI1SEL_0					(0x1u<<4)
#define	RCC_CCIPR9_SPDIFRX1SEL					(0x7u<<0)
#define	RCC_CCIPR9_SPDIFRX1SEL_0				(0x1u<<0)

#define	RCC_CCIPR9_SPI6SEL_B_0X0				(0x0u<<24)
#define	RCC_CCIPR9_SPI6SEL_B_0X1				(0x1u<<24)
#define	RCC_CCIPR9_SPI6SEL_B_0X2				(0x2u<<24)
#define	RCC_CCIPR9_SPI6SEL_B_0X3				(0x3u<<24)
#define	RCC_CCIPR9_SPI6SEL_B_0X4				(0x4u<<24)
#define	RCC_CCIPR9_SPI6SEL_B_0X5				(0x5u<<24)
#define	RCC_CCIPR9_SPI6SEL_B_0X6				(0x6u<<24)
#define	RCC_CCIPR9_SPI5SEL_B_0X0				(0x0u<<20)
#define	RCC_CCIPR9_SPI5SEL_B_0X1				(0x1u<<20)
#define	RCC_CCIPR9_SPI5SEL_B_0X2				(0x2u<<20)
#define	RCC_CCIPR9_SPI5SEL_B_0X3				(0x3u<<20)
#define	RCC_CCIPR9_SPI5SEL_B_0X4				(0x4u<<20)
#define	RCC_CCIPR9_SPI5SEL_B_0X5				(0x5u<<20)
#define	RCC_CCIPR9_SPI5SEL_B_0X6				(0x6u<<20)
#define	RCC_CCIPR9_SPI4SEL_B_0X0				(0x0u<<16)
#define	RCC_CCIPR9_SPI4SEL_B_0X1				(0x1u<<16)
#define	RCC_CCIPR9_SPI4SEL_B_0X2				(0x2u<<16)
#define	RCC_CCIPR9_SPI4SEL_B_0X3				(0x3u<<16)
#define	RCC_CCIPR9_SPI4SEL_B_0X4				(0x4u<<16)
#define	RCC_CCIPR9_SPI4SEL_B_0X5				(0x5u<<16)
#define	RCC_CCIPR9_SPI4SEL_B_0X6				(0x6u<<16)
#define	RCC_CCIPR9_SPI3SEL_B_0X0				(0x0u<<12)
#define	RCC_CCIPR9_SPI3SEL_B_0X1				(0x1u<<12)
#define	RCC_CCIPR9_SPI3SEL_B_0X2				(0x2u<<12)
#define	RCC_CCIPR9_SPI3SEL_B_0X3				(0x3u<<12)
#define	RCC_CCIPR9_SPI3SEL_B_0X4				(0x4u<<12)
#define	RCC_CCIPR9_SPI3SEL_B_0X5				(0x5u<<12)
#define	RCC_CCIPR9_SPI3SEL_B_0X6				(0x6u<<12)
#define	RCC_CCIPR9_SPI2SEL_B_0X0				(0x0u<<8)
#define	RCC_CCIPR9_SPI2SEL_B_0X1				(0x1u<<8)
#define	RCC_CCIPR9_SPI2SEL_B_0X2				(0x2u<<8)
#define	RCC_CCIPR9_SPI2SEL_B_0X3				(0x3u<<8)
#define	RCC_CCIPR9_SPI2SEL_B_0X4				(0x4u<<8)
#define	RCC_CCIPR9_SPI2SEL_B_0X5				(0x5u<<8)
#define	RCC_CCIPR9_SPI2SEL_B_0X6				(0x6u<<8)
#define	RCC_CCIPR9_SPI1SEL_B_0X0				(0x0u<<4)
#define	RCC_CCIPR9_SPI1SEL_B_0X1				(0x1u<<4)
#define	RCC_CCIPR9_SPI1SEL_B_0X2				(0x2u<<4)
#define	RCC_CCIPR9_SPI1SEL_B_0X3				(0x3u<<4)
#define	RCC_CCIPR9_SPI1SEL_B_0X4				(0x4u<<4)
#define	RCC_CCIPR9_SPI1SEL_B_0X5				(0x5u<<4)
#define	RCC_CCIPR9_SPI1SEL_B_0X6				(0x6u<<4)
#define	RCC_CCIPR9_SPDIFRX1SEL_B_0X0			(0x0u<<0)
#define	RCC_CCIPR9_SPDIFRX1SEL_B_0X1			(0x1u<<0)
#define	RCC_CCIPR9_SPDIFRX1SEL_B_0X2			(0x2u<<0)
#define	RCC_CCIPR9_SPDIFRX1SEL_B_0X3			(0x3u<<0)
#define	RCC_CCIPR9_SPDIFRX1SEL_B_0X4			(0x4u<<0)
#define	RCC_CCIPR9_SPDIFRX1SEL_B_0X5			(0x5u<<0)
#define	RCC_CCIPR9_SPDIFRX1SEL_B_0X6			(0x6u<<0)

// CCIPR12 Configuration

