hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
#define	RCC_CCIPR12_LPTIM5SEL					(0x7u<<24)
#define	RCC_CCIPR12_LPTIM5SEL_0					(0x1u<<24)
#define	RCC_CCIPR12_LPTIM4SEL					(0x7u<<20)
#define	RCC_CCIPR12_LPTIM4SEL_0					(0x1u<<20)
#define	RCC_CCIPR12_LPTIM3SEL					(0x7u<<16)
#define	RCC_CCIPR12_LPTIM3SEL_0					(0x1u<<16)
#define	RCC_CCIPR12_LPTIM2SEL					(0x7u<<12)
#define	RCC_CCIPR12_LPTIM2SEL_0					(0x1u<<12)
#define	RCC_CCIPR12_LPTIM1SEL					(0x7u<<8)
#define	RCC_CCIPR12_LPTIM1SEL_0					(0x1u<<8)

#define	RCC_CCIPR12_LPTIM5SEL_B_0X0				(0x0u<<24)
#define	RCC_CCIPR12_LPTIM5SEL_B_0X1				(0x1u<<24)
#define	RCC_CCIPR12_LPTIM5SEL_B_0X2				(0x2u<<24)
#define	RCC_CCIPR12_LPTIM5SEL_B_0X3				(0x3u<<24)
#define	RCC_CCIPR12_LPTIM5SEL_B_0X4				(0x4u<<24)
#define	RCC_CCIPR12_LPTIM5SEL_B_0X5				(0x5u<<24)
#define	RCC_CCIPR12_LPTIM4SEL_B_0X0				(0x0u<<20)
#define	RCC_CCIPR12_LPTIM4SEL_B_0X1				(0x1u<<20)
#define	RCC_CCIPR12_LPTIM4SEL_B_0X2				(0x2u<<20)
#define	RCC_CCIPR12_LPTIM4SEL_B_0X3				(0x3u<<20)
#define	RCC_CCIPR12_LPTIM4SEL_B_0X4				(0x4u<<20)
#define	RCC_CCIPR12_LPTIM4SEL_B_0X5				(0x5u<<20)
#define	RCC_CCIPR12_LPTIM3SEL_B_0X0				(0x0u<<16)
#define	RCC_CCIPR12_LPTIM3SEL_B_0X1				(0x1u<<16)
#define	RCC_CCIPR12_LPTIM3SEL_B_0X2				(0x2u<<16)
#define	RCC_CCIPR12_LPTIM3SEL_B_0X3				(0x3u<<16)
#define	RCC_CCIPR12_LPTIM3SEL_B_0X4				(0x4u<<16)
#define	RCC_CCIPR12_LPTIM3SEL_B_0X5				(0x5u<<16)
#define	RCC_CCIPR12_LPTIM2SEL_B_0X0				(0x0u<<12)
#define	RCC_CCIPR12_LPTIM2SEL_B_0X1				(0x1u<<12)
#define	RCC_CCIPR12_LPTIM2SEL_B_0X2				(0x2u<<12)
#define	RCC_CCIPR12_LPTIM2SEL_B_0X3				(0x3u<<12)
#define	RCC_CCIPR12_LPTIM2SEL_B_0X4				(0x4u<<12)
#define	RCC_CCIPR12_LPTIM2SEL_B_0X5				(0x5u<<12)
#define	RCC_CCIPR12_LPTIM1SEL_B_0X0				(0x0u<<8)
#define	RCC_CCIPR12_LPTIM1SEL_B_0X1				(0x1u<<8)
#define	RCC_CCIPR12_LPTIM1SEL_B_0X2				(0x2u<<8)
#define	RCC_CCIPR12_LPTIM1SEL_B_0X3				(0x3u<<8)
#define	RCC_CCIPR12_LPTIM1SEL_B_0X4				(0x4u<<8)
#define	RCC_CCIPR12_LPTIM1SEL_B_0X5				(0x5u<<8)

// CCIPR13 Configuration

#define	RCC_CCIPR13_UART8SEL					(0x7u<<28)
#define	RCC_CCIPR13_UART8SEL_0					(0x1u<<28)
#define	RCC_CCIPR13_UART7SEL					(0x7u<<24)
#define	RCC_CCIPR13_UART7SEL_0					(0x1u<<24)
#define	RCC_CCIPR13_USART6SEL					(0x7u<<20)
#define	RCC_CCIPR13_USART6SEL_0					(0x1u<<20)
#define	RCC_CCIPR13_UART5SEL					(0x7u<<16)
#define	RCC_CCIPR13_UART5SEL_0					(0x1u<<16)
#define	RCC_CCIPR13_UART4SEL					(0x7u<<12)
#define	RCC_CCIPR13_UART4SEL_0					(0x1u<<12)
#define	RCC_CCIPR13_USART3SEL					(0x7u<<8)
#define	RCC_CCIPR13_USART3SEL_0					(0x1u<<8)
#define	RCC_CCIPR13_USART2SEL					(0x7u<<4)
#define	RCC_CCIPR13_USART2SEL_0					(0x1u<<4)
#define	RCC_CCIPR13_USART1SEL					(0x7u<<0)
#define	RCC_CCIPR13_USART1SEL_0					(0x1u<<0)

#define	RCC_CCIPR13_UART8SEL_B_0X0				(0x0u<<28)
#define	RCC_CCIPR13_UART8SEL_B_0X1				(0x1u<<28)
#define	RCC_CCIPR13_UART8SEL_B_0X2				(0x2u<<28)
#define	RCC_CCIPR13_UART8SEL_B_0X3				(0x3u<<28)
#define	RCC_CCIPR13_UART8SEL_B_0X4				(0x4u<<28)
#define	RCC_CCIPR13_UART8SEL_B_0X5				(0x5u<<28)
#define	RCC_CCIPR13_UART8SEL_B_0X6				(0x6u<<28)
#define	RCC_CCIPR13_UART7SEL_B_0X0				(0x0u<<24)
#define	RCC_CCIPR13_UART7SEL_B_0X1				(0x1u<<24)
#define	RCC_CCIPR13_UART7SEL_B_0X2				(0x2u<<24)
#define	RCC_CCIPR13_UART7SEL_B_0X3				(0x3u<<24)
#define	RCC_CCIPR13_UART7SEL_B_0X4				(0x4u<<24)
#define	RCC_CCIPR13_UART7SEL_B_0X5				(0x5u<<24)
#define	RCC_CCIPR13_UART7SEL_B_0X6				(0x6u<<24)
#define	RCC_CCIPR13_USART6SEL_B_0X0				(0x0u<<20)
#define	RCC_CCIPR13_USART6SEL_B_0X1				(0x1u<<20)
#define	RCC_CCIPR13_USART6SEL_B_0X2				(0x2u<<20)
#define	RCC_CCIPR13_USART6SEL_B_0X3				(0x3u<<20)
#define	RCC_CCIPR13_USART6SEL_B_0X4				(0x4u<<20)
#define	RCC_CCIPR13_USART6SEL_B_0X5				(0x5u<<20)
#define	RCC_CCIPR13_USART6SEL_B_0X6				(0x6u<<20)
#define	RCC_CCIPR13_UART5SEL_B_0X0				(0x0u<<16)
#define	RCC_CCIPR13_UART5SEL_B_0X1				(0x1u<<16)
#define	RCC_CCIPR13_UART5SEL_B_0X2				(0x2u<<16)
#define	RCC_CCIPR13_UART5SEL_B_0X3				(0x3u<<16)
#define	RCC_CCIPR13_UART5SEL_B_0X4				(0x4u<<16)
#define	RCC_CCIPR13_UART5SEL_B_0X5				(0x5u<<16)
#define	RCC_CCIPR13_UART5SEL_B_0X6				(0x6u<<16)
#define	RCC_CCIPR13_UART4SEL_B_0X0				(0x0u<<12)
#define	RCC_CCIPR13_UART4SEL_B_0X1				(0x1u<<12)
#define	RCC_CCIPR13_UART4SEL_B_0X2				(0x2u<<12)
#define	RCC_CCIPR13_UART4SEL_B_0X3				(0x3u<<12)
#define	RCC_CCIPR13_UART4SEL_B_0X4				(0x4u<<12)
#define	RCC_CCIPR13_UART4SEL_B_0X5				(0x5u<<12)
#define	RCC_CCIPR13_UART4SEL_B_0X6				(0x6u<<12)
#define	RCC_CCIPR13_USART3SEL_B_0X0				(0x0u<<8)
#define	RCC_CCIPR13_USART3SEL_B_0X1				(0x1u<<8)
#define	RCC_CCIPR13_USART3SEL_B_0X2				(0x2u<<8)
#define	RCC_CCIPR13_USART3SEL_B_0X3				(0x3u<<8)
#define	RCC_CCIPR13_USART3SEL_B_0X4				(0x4u<<8)
#define	RCC_CCIPR13_USART3SEL_B_0X5				(0x5u<<8)
#define	RCC_CCIPR13_USART3SEL_B_0X6				(0x6u<<8)
#define	RCC_CCIPR13_USART2SEL_B_0X0				(0x0u<<4)
#define	RCC_CCIPR13_USART2SEL_B_0X1				(0x1u<<4)
#define	RCC_CCIPR13_USART2SEL_B_0X2				(0x2u<<4)
#define	RCC_CCIPR13_USART2SEL_B_0X3				(0x3u<<4)
#define	RCC_CCIPR13_USART2SEL_B_0X4				(0x4u<<4)
#define	RCC_CCIPR13_USART2SEL_B_0X5				(0x5u<<4)
#define	RCC_CCIPR13_USART2SEL_B_0X6				(0x6u<<4)
#define	RCC_CCIPR13_USART1SEL_B_0X0				(0x0u<<0)
#define	RCC_CCIPR13_USART1SEL_B_0X1				(0x1u<<0)
#define	RCC_CCIPR13_USART1SEL_B_0X2				(0x2u<<0)
#define	RCC_CCIPR13_USART1SEL_B_0X3				(0x3u<<0)
#define	RCC_CCIPR13_USART1SEL_B_0X4				(0x4u<<0)
#define	RCC_CCIPR13_USART1SEL_B_0X5				(0x5u<<0)
#define	RCC_CCIPR13_USART1SEL_B_0X6				(0x6u<<0)

// CCIPR14 Configuration

#define	RCC_CCIPR14_LPUART1SEL					(0x7u<<8)
#define	RCC_CCIPR14_LPUART1SEL_0				(0x1u<<8)
#define	RCC_CCIPR14_USART10SEL					(0x7u<<4)
#define	RCC_CCIPR14_USART10SEL_0				(0x1u<<4)
#define	RCC_CCIPR14_UART9SEL					(0x7u<<0)
#define	RCC_CCIPR14_UART9SEL_0					(0x1u<<0)

#define	RCC_CCIPR14_LPUART1SEL_B_0X0			(0x0u<<8)
#define	RCC_CCIPR14_LPUART1SEL_B_0X1			(0x1u<<8)
#define	RCC_CCIPR14_LPUART1SEL_B_0X2			(0x2u<<8)
#define	RCC_CCIPR14_LPUART1SEL_B_0X3			(0x3u<<8)
#define	RCC_CCIPR14_LPUART1SEL_B_0X4			(0x4u<<8)
#define	RCC_CCIPR14_LPUART1SEL_B_0X5			(0x5u<<8)
#define	RCC_CCIPR14_LPUART1SEL_B_0X6			(0x6u<<8)
#define	RCC_CCIPR14_USART10SEL_B_0X0			(0x0u<<4)
#define	RCC_CCIPR14_USART10SEL_B_0X1			(0x1u<<4)
#define	RCC_CCIPR14_USART10SEL_B_0X2			(0x2u<<4)
#define	RCC_CCIPR14_USART10SEL_B_0X3			(0x3u<<4)
#define	RCC_CCIPR14_USART10SEL_B_0X4			(0x4u<<4)
#define	RCC_CCIPR14_USART10SEL_B_0X5			(0x5u<<4)
#define	RCC_CCIPR14_USART10SEL_B_0X6			(0x6u<<4)
#define	RCC_CCIPR14_UART9SEL_B_0X0				(0x0u<<0)
#define	RCC_CCIPR14_UART9SEL_B_0X1				(0x1u<<0)
#define	RCC_CCIPR14_UART9SEL_B_0X2				(0x2u<<0)
#define	RCC_CCIPR14_UART9SEL_B_0X3				(0x3u<<0)
#define	RCC_CCIPR14_UART9SEL_B_0X4				(0x4u<<0)
#define	RCC_CCIPR14_UART9SEL_B_0X5				(0x5u<<0)
#define	RCC_CCIPR14_UART9SEL_B_0X6				(0x6u<<0)

// BUSRSTR Configuration

#define	RCC_BUSRSTR_NOCRST						(0x1u<<13)
#define	RCC_BUSRSTR_APB5RST						(0x1u<<12)
#define	RCC_BUSRSTR_APB4RST						(0x1u<<11)
#define	RCC_BUSRSTR_APB3RST						(0x1u<<10)
#define	RCC_BUSRSTR_APB2RST						(0x1u<<9)
#define	RCC_BUSRSTR_APB1RST						(0x1u<<8)
#define	RCC_BUSRSTR_AHB5RST						(0x1u<<7)
#define	RCC_BUSRSTR_AHB4RST						(0x1u<<6)
#define	RCC_BUSRSTR_AHB3RST						(0x1u<<5)
#define	RCC_BUSRSTR_AHB2RST						(0x1u<<4)
#define	RCC_BUSRSTR_AHB1RST						(0x1u<<3)
#define	RCC_BUSRSTR_AHBMRST						(0x1u<<2)
#define	RCC_BUSRSTR_ACLKNRST					(0x1u<<0)

#define	RCC_BUSRSTR_NOCRST_B_0X0				(0x0u<<13)
#define	RCC_BUSRSTR_NOCRST_B_0X1				(0x1u<<13)
#define	RCC_BUSRSTR_APB5RST_B_0X0				(0x0u<<12)
#define	RCC_BUSRSTR_APB5RST_B_0X1				(0x1u<<12)
#define	RCC_BUSRSTR_APB4RST_B_0X0				(0x0u<<11)
#define	RCC_BUSRSTR_APB4RST_B_0X1				(0x1u<<11)
#define	RCC_BUSRSTR_APB3RST_B_0X0				(0x0u<<10)
#define	RCC_BUSRSTR_APB3RST_B_0X1				(0x1u<<10)
#define	RCC_BUSRSTR_APB2RST_B_0X0				(0x0u<<9)
#define	RCC_BUSRSTR_APB2RST_B_0X1				(0x1u<<9)
#define	RCC_BUSRSTR_APB1RST_B_0X0				(0x0u<<8)
#define	RCC_BUSRSTR_APB1RST_B_0X1				(0x1u<<8)
#define	RCC_BUSRSTR_AHB5RST_B_0X0				(0x0u<<7)
#define	RCC_BUSRSTR_AHB5RST_B_0X1				(0x1u<<7)
#define	RCC_BUSRSTR_AHB4RST_B_0X0				(0x0u<<6)
#define	RCC_BUSRSTR_AHB4RST_B_0X1				(0x1u<<6)
#define	RCC_BUSRSTR_AHB3RST_B_0X0				(0x0u<<5)
#define	RCC_BUSRSTR_AHB3RST_B_0X1				(0x1u<<5)
#define	RCC_BUSRSTR_AHB2RST_B_0X0				(0x0u<<4)
#define	RCC_BUSRSTR_AHB2RST_B_0X1				(0x1u<<4)
#define	RCC_BUSRSTR_AHB1RST_B_0X0				(0x0u<<3)
#define	RCC_BUSRSTR_AHB1RST_B_0X1				(0x1u<<3)
#define	RCC_BUSRSTR_AHBMRST_B_0X0				(0x0u<<2)
#define	RCC_BUSRSTR_AHBMRST_B_0X1				(0x1u<<2)
#define	RCC_BUSRSTR_ACLKNRST_B_0X0				(0x0u<<0)
#define	RCC_BUSRSTR_ACLKNRST_B_0X1				(0x1u<<0)

// MISCRSTR Configuration

