hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
#define	RCC_MISCRSTR_SDMMC2DLLRST				(0x1u<<8)
#define	RCC_MISCRSTR_SDMMC1DLLRST				(0x1u<<7)
#define	RCC_MISCRSTR_XSPIPHY2RST				(0x1u<<5)
#define	RCC_MISCRSTR_XSPIPHY1RST				(0x1u<<4)
#define	RCC_MISCRSTR_DBGRST						(0x1u<<0)

#define	RCC_MISCRSTR_SDMMC2DLLRST_B_0X0			(0x0u<<8)
#define	RCC_MISCRSTR_SDMMC2DLLRST_B_0X1			(0x1u<<8)
#define	RCC_MISCRSTR_SDMMC1DLLRST_B_0X0			(0x0u<<7)
#define	RCC_MISCRSTR_SDMMC1DLLRST_B_0X1			(0x1u<<7)
#define	RCC_MISCRSTR_XSPIPHY2RST_B_0X0			(0x0u<<5)
#define	RCC_MISCRSTR_XSPIPHY2RST_B_0X1			(0x1u<<5)
#define	RCC_MISCRSTR_XSPIPHY1RST_B_0X0			(0x0u<<4)
#define	RCC_MISCRSTR_XSPIPHY1RST_B_0X1			(0x1u<<4)
#define	RCC_MISCRSTR_DBGRST_B_0X0				(0x0u<<0)
#define	RCC_MISCRSTR_DBGRST_B_0X1				(0x1u<<0)

// MEMRSTR Configuration

#define	RCC_MEMRSTR_BOOTROMRST					(0x1u<<12)
#define	RCC_MEMRSTR_VENCRAMRST					(0x1u<<11)
#define	RCC_MEMRSTR_NPUCACHERAMRST				(0x1u<<10)
#define	RCC_MEMRSTR_FLEXRAMRST					(0x1u<<9)
#define	RCC_MEMRSTR_AXISRAM2RST					(0x1u<<8)
#define	RCC_MEMRSTR_AXISRAM1RST					(0x1u<<7)
#define	RCC_MEMRSTR_AHBSRAM2RST					(0x1u<<5)
#define	RCC_MEMRSTR_AHBSRAM1RST					(0x1u<<4)
#define	RCC_MEMRSTR_AXISRAM6RST					(0x1u<<3)
#define	RCC_MEMRSTR_AXISRAM5RST					(0x1u<<2)
#define	RCC_MEMRSTR_AXISRAM4RST					(0x1u<<1)
#define	RCC_MEMRSTR_AXISRAM3RST					(0x1u<<0)

#define	RCC_MEMRSTR_BOOTROMRST_B_0X0			(0x0u<<12)
#define	RCC_MEMRSTR_BOOTROMRST_B_0X1			(0x1u<<12)
#define	RCC_MEMRSTR_VENCRAMRST_B_0X0			(0x0u<<11)
#define	RCC_MEMRSTR_VENCRAMRST_B_0X1			(0x1u<<11)
#define	RCC_MEMRSTR_NPUCACHERAMRST_B_0X0		(0x0u<<10)
#define	RCC_MEMRSTR_NPUCACHERAMRST_B_0X1		(0x1u<<10)
#define	RCC_MEMRSTR_FLEXRAMRST_B_0X0			(0x0u<<9)
#define	RCC_MEMRSTR_FLEXRAMRST_B_0X1			(0x1u<<9)
#define	RCC_MEMRSTR_AXISRAM2RST_B_0X0			(0x0u<<8)
#define	RCC_MEMRSTR_AXISRAM2RST_B_0X1			(0x1u<<8)
#define	RCC_MEMRSTR_AXISRAM1RST_B_0X0			(0x0u<<7)
#define	RCC_MEMRSTR_AXISRAM1RST_B_0X1			(0x1u<<7)
#define	RCC_MEMRSTR_AHBSRAM2RST_B_0X0			(0x0u<<5)
#define	RCC_MEMRSTR_AHBSRAM2RST_B_0X1			(0x1u<<5)
#define	RCC_MEMRSTR_AHBSRAM1RST_B_0X0			(0x0u<<4)
#define	RCC_MEMRSTR_AHBSRAM1RST_B_0X1			(0x1u<<4)
#define	RCC_MEMRSTR_AXISRAM6RST_B_0X0			(0x0u<<3)
#define	RCC_MEMRSTR_AXISRAM6RST_B_0X1			(0x1u<<3)
#define	RCC_MEMRSTR_AXISRAM5RST_B_0X0			(0x0u<<2)
#define	RCC_MEMRSTR_AXISRAM5RST_B_0X1			(0x1u<<2)
#define	RCC_MEMRSTR_AXISRAM4RST_B_0X0			(0x0u<<1)
#define	RCC_MEMRSTR_AXISRAM4RST_B_0X1			(0x1u<<1)
#define	RCC_MEMRSTR_AXISRAM3RST_B_0X0			(0x0u<<0)
#define	RCC_MEMRSTR_AXISRAM3RST_B_0X1			(0x1u<<0)

// AHB1RSTR Configuration

#define	RCC_AHB1RSTR_ADC12RST					(0x1u<<5)
#define	RCC_AHB1RSTR_GPDMA1RST					(0x1u<<4)

#define	RCC_AHB1RSTR_ADC12RST_B_0X0				(0x0u<<5)
#define	RCC_AHB1RSTR_ADC12RST_B_0X1				(0x1u<<5)
#define	RCC_AHB1RSTR_GPDMA1RST_B_0X0			(0x0u<<4)
#define	RCC_AHB1RSTR_GPDMA1RST_B_0X1			(0x1u<<4)

// AHB2RSTR Configuration

#define	RCC_AHB2RSTR_ADF1RST					(0x1u<<17)
#define	RCC_AHB2RSTR_MDF1RST					(0x1u<<16)
#define	RCC_AHB2RSTR_RAMCFGRST					(0x1u<<12)

#define	RCC_AHB2RSTR_ADF1RST_B_0X0				(0x0u<<17)
#define	RCC_AHB2RSTR_ADF1RST_B_0X1				(0x1u<<17)
#define	RCC_AHB2RSTR_MDF1RST_B_0X0				(0x0u<<16)
#define	RCC_AHB2RSTR_MDF1RST_B_0X1				(0x1u<<16)
#define	RCC_AHB2RSTR_RAMCFGRST_B_0X0			(0x0u<<12)
#define	RCC_AHB2RSTR_RAMCFGRST_B_0X1			(0x1u<<12)

// AHB3RSTR Configuration

#define	RCC_AHB3RSTR_IACRST						(0x1u<<10)
#define	RCC_AHB3RSTR_PKARST						(0x1u<<8)
#define	RCC_AHB3RSTR_SAESRST					(0x1u<<4)
#define	RCC_AHB3RSTR_CRYPRST					(0x1u<<2)
#define	RCC_AHB3RSTR_HASHRST					(0x1u<<1)
#define	RCC_AHB3RSTR_RNGRST						(0x1u<<0)

#define	RCC_AHB3RSTR_IACRST_B_0X0				(0x0u<<10)
#define	RCC_AHB3RSTR_IACRST_B_0X1				(0x1u<<10)
#define	RCC_AHB3RSTR_PKARST_B_0X0				(0x0u<<8)
#define	RCC_AHB3RSTR_PKARST_B_0X1				(0x1u<<8)
#define	RCC_AHB3RSTR_SAESRST_B_0X0				(0x0u<<4)
#define	RCC_AHB3RSTR_SAESRST_B_0X1				(0x1u<<4)
#define	RCC_AHB3RSTR_CRYPRST_B_0X0				(0x0u<<2)
#define	RCC_AHB3RSTR_CRYPRST_B_0X1				(0x1u<<2)
#define	RCC_AHB3RSTR_HASHRST_B_0X0				(0x0u<<1)
#define	RCC_AHB3RSTR_HASHRST_B_0X1				(0x1u<<1)
#define	RCC_AHB3RSTR_RNGRST_B_0X0				(0x0u<<0)
#define	RCC_AHB3RSTR_RNGRST_B_0X1				(0x1u<<0)

// AHB4RSTR Configuration

#define	RCC_AHB4RSTR_CRCRST						(0x1u<<19)
#define	RCC_AHB4RSTR_PWRRST						(0x1u<<18)
#define	RCC_AHB4RSTR_GPIOQRST					(0x1u<<16)
#define	RCC_AHB4RSTR_GPIOPRST					(0x1u<<15)
#define	RCC_AHB4RSTR_GPIOORST					(0x1u<<14)
#define	RCC_AHB4RSTR_GPIONRST					(0x1u<<13)
#define	RCC_AHB4RSTR_GPIOHRST					(0x1u<<7)
#define	RCC_AHB4RSTR_GPIOGRST					(0x1u<<6)
#define	RCC_AHB4RSTR_GPIOFRST					(0x1u<<5)
#define	RCC_AHB4RSTR_GPIOERST					(0x1u<<4)
#define	RCC_AHB4RSTR_GPIODRST					(0x1u<<3)
#define	RCC_AHB4RSTR_GPIOCRST					(0x1u<<2)
#define	RCC_AHB4RSTR_GPIOBRST					(0x1u<<1)
#define	RCC_AHB4RSTR_GPIOARST					(0x1u<<0)

#define	RCC_AHB4RSTR_CRCRST_B_0X0				(0x0u<<19)
#define	RCC_AHB4RSTR_CRCRST_B_0X1				(0x1u<<19)
#define	RCC_AHB4RSTR_PWRRST_B_0X0				(0x0u<<18)
#define	RCC_AHB4RSTR_PWRRST_B_0X1				(0x1u<<18)
#define	RCC_AHB4RSTR_GPIOQRST_B_0X0				(0x0u<<16)
#define	RCC_AHB4RSTR_GPIOQRST_B_0X1				(0x1u<<16)
#define	RCC_AHB4RSTR_GPIOPRST_B_0X0				(0x0u<<15)
#define	RCC_AHB4RSTR_GPIOPRST_B_0X1				(0x1u<<15)
#define	RCC_AHB4RSTR_GPIOORST_B_0X0				(0x0u<<14)
#define	RCC_AHB4RSTR_GPIOORST_B_0X1				(0x1u<<14)
#define	RCC_AHB4RSTR_GPIONRST_B_0X0				(0x0u<<13)
#define	RCC_AHB4RSTR_GPIONRST_B_0X1				(0x1u<<13)
#define	RCC_AHB4RSTR_GPIOHRST_B_0X0				(0x0u<<7)
#define	RCC_AHB4RSTR_GPIOHRST_B_0X1				(0x1u<<7)
#define	RCC_AHB4RSTR_GPIOGRST_B_0X0				(0x0u<<6)
#define	RCC_AHB4RSTR_GPIOGRST_B_0X1				(0x1u<<6)
#define	RCC_AHB4RSTR_GPIOFRST_B_0X0				(0x0u<<5)
#define	RCC_AHB4RSTR_GPIOFRST_B_0X1				(0x1u<<5)
#define	RCC_AHB4RSTR_GPIOERST_B_0X0				(0x0u<<4)
#define	RCC_AHB4RSTR_GPIOERST_B_0X1				(0x1u<<4)
#define	RCC_AHB4RSTR_GPIODRST_B_0X0				(0x0u<<3)
#define	RCC_AHB4RSTR_GPIODRST_B_0X1				(0x1u<<3)
#define	RCC_AHB4RSTR_GPIOCRST_B_0X0				(0x0u<<2)
#define	RCC_AHB4RSTR_GPIOCRST_B_0X1				(0x1u<<2)
#define	RCC_AHB4RSTR_GPIOBRST_B_0X0				(0x0u<<1)
#define	RCC_AHB4RSTR_GPIOBRST_B_0X1				(0x1u<<1)
#define	RCC_AHB4RSTR_GPIOARST_B_0X0				(0x0u<<0)
#define	RCC_AHB4RSTR_GPIOARST_B_0X1				(0x1u<<0)

// AHB5RSTR Configuration

#define	RCC_AHB5RSTR_NPURST						(0x1u<<31)
#define	RCC_AHB5RSTR_NPUCACHERST				(0x1u<<30)
#define	RCC_AHB5RSTR_OTG2RST					(0x1u<<29)
#define	RCC_AHB5RSTR_OTGPHY2RST					(0x1u<<28)
#define	RCC_AHB5RSTR_OTGPHY1RST					(0x1u<<27)
#define	RCC_AHB5RSTR_OTG1RST					(0x1u<<26)
#define	RCC_AHB5RSTR_ETH1RST					(0x1u<<25)
#define	RCC_AHB5RSTR_SYSCFGOTGHSPHY2RST			(0x1u<<24)
#define	RCC_AHB5RSTR_SYSCFGOTGHSPHY1RST			(0x1u<<23)
#define	RCC_AHB5RSTR_GPURST						(0x1u<<20)
#define	RCC_AHB5RSTR_GFXMMURST					(0x1u<<19)
#define	RCC_AHB5RSTR_MCE4RST					(0x1u<<18)
#define	RCC_AHB5RSTR_XSPI3RST					(0x1u<<17)
#define	RCC_AHB5RSTR_XSPIMRST					(0x1u<<13)
#define	RCC_AHB5RSTR_XSPI2RST					(0x1u<<12)
#define	RCC_AHB5RSTR_SDMMC1RST					(0x1u<<8)
#define	RCC_AHB5RSTR_SDMMC2RST					(0x1u<<7)
#define	RCC_AHB5RSTR_PSSIRST					(0x1u<<6)
#define	RCC_AHB5RSTR_XSPI1RST					(0x1u<<5)
#define	RCC_AHB5RSTR_FMCRST						(0x1u<<4)
#define	RCC_AHB5RSTR_JPEGRST					(0x1u<<3)
#define	RCC_AHB5RSTR_DMA2DRST					(0x1u<<1)
#define	RCC_AHB5RSTR_HPDMA1RST					(0x1u<<0)

#define	RCC_AHB5RSTR_NPURST_B_0X0				(0x0u<<31)
#define	RCC_AHB5RSTR_NPURST_B_0X1				(0x1u<<31)
#define	RCC_AHB5RSTR_NPUCACHERST_B_0X0			(0x0u<<30)
#define	RCC_AHB5RSTR_NPUCACHERST_B_0X1			(0x1u<<30)
#define	RCC_AHB5RSTR_OTG2RST_B_0X0				(0x0u<<29)
#define	RCC_AHB5RSTR_OTG2RST_B_0X1				(0x1u<<29)
#define	RCC_AHB5RSTR_OTGPHY2RST_B_0X0			(0x0u<<28)
#define	RCC_AHB5RSTR_OTGPHY2RST_B_0X1			(0x1u<<28)
#define	RCC_AHB5RSTR_OTGPHY1RST_B_0X0			(0x0u<<27)
#define	RCC_AHB5RSTR_OTGPHY1RST_B_0X1			(0x1u<<27)
#define	RCC_AHB5RSTR_OTG1RST_B_0X0				(0x0u<<26)
#define	RCC_AHB5RSTR_OTG1RST_B_0X1				(0x1u<<26)
#define	RCC_AHB5RSTR_ETH1RST_B_0X0				(0x0u<<25)
#define	RCC_AHB5RSTR_ETH1RST_B_0X1				(0x1u<<25)
#define	RCC_AHB5RSTR_SYSCFGOTGHSPHY2RST_B_0X0	(0x0u<<24)
#define	RCC_AHB5RSTR_SYSCFGOTGHSPHY2RST_B_0X1	(0x1u<<24)
#define	RCC_AHB5RSTR_SYSCFGOTGHSPHY1RST_B_0X0	(0x0u<<23)
#define	RCC_AHB5RSTR_SYSCFGOTGHSPHY1RST_B_0X1	(0x1u<<23)
#define	RCC_AHB5RSTR_GPURST_B_0X0				(0x0u<<20)
#define	RCC_AHB5RSTR_GPURST_B_0X1				(0x1u<<20)
#define	RCC_AHB5RSTR_GFXMMURST_B_0X0			(0x0u<<19)
#define	RCC_AHB5RSTR_GFXMMURST_B_0X1			(0x1u<<19)
#define	RCC_AHB5RSTR_MCE4RST_B_0X0				(0x0u<<18)
#define	RCC_AHB5RSTR_MCE4RST_B_0X1				(0x1u<<18)
#define	RCC_AHB5RSTR_XSPI3RST_B_0X0				(0x0u<<17)
#define	RCC_AHB5RSTR_XSPI3RST_B_0X1				(0x1u<<17)
#define	RCC_AHB5RSTR_XSPIMRST_B_0X0				(0x0u<<13)
#define	RCC_AHB5RSTR_XSPIMRST_B_0X1				(0x1u<<13)
#define	RCC_AHB5RSTR_XSPI2RST_B_0X0				(0x0u<<12)
#define	RCC_AHB5RSTR_XSPI2RST_B_0X1				(0x1u<<12)
#define	RCC_AHB5RSTR_SDMMC1RST_B_0X0			(0x0u<<8)
#define	RCC_AHB5RSTR_SDMMC1RST_B_0X1			(0x1u<<8)
#define	RCC_AHB5RSTR_SDMMC2RST_B_0X0			(0x0u<<7)
#define	RCC_AHB5RSTR_SDMMC2RST_B_0X1			(0x1u<<7)
#define	RCC_AHB5RSTR_PSSIRST_B_0X0				(0x0u<<6)
#define	RCC_AHB5RSTR_PSSIRST_B_0X1				(0x1u<<6)
#define	RCC_AHB5RSTR_XSPI1RST_B_0X0				(0x0u<<5)
#define	RCC_AHB5RSTR_XSPI1RST_B_0X1				(0x1u<<5)
#define	RCC_AHB5RSTR_FMCRST_B_0X0				(0x0u<<4)
#define	RCC_AHB5RSTR_FMCRST_B_0X1				(0x1u<<4)
#define	RCC_AHB5RSTR_JPEGRST_B_0X0				(0x0u<<3)
#define	RCC_AHB5RSTR_JPEGRST_B_0X1				(0x1u<<3)
#define	RCC_AHB5RSTR_DMA2DRST_B_0X0				(0x0u<<1)
#define	RCC_AHB5RSTR_DMA2DRST_B_0X1				(0x1u<<1)
#define	RCC_AHB5RSTR_HPDMA1RST_B_0X0			(0x0u<<0)
#define	RCC_AHB5RSTR_HPDMA1RST_B_0X1			(0x1u<<0)

// APB1LRSTR Configuration

#define	RCC_APB1LRSTR_UART8RST					(0x1u<<31)
#define	RCC_APB1LRSTR_UART7RST					(0x1u<<30)
#define	RCC_APB1LRSTR_I3C2RST					(0x1u<<25)
#define	RCC_APB1LRSTR_I3C1RST					(0x1u<<24)
#define	RCC_APB1LRSTR_I2C3RST					(0x1u<<23)
#define	RCC_APB1LRSTR_I2C2RST					(0x1u<<22)
#define	RCC_APB1LRSTR_I2C1RST					(0x1u<<21)
#define	RCC_APB1LRSTR_UART5RST					(0x1u<<20)
#define	RCC_APB1LRSTR_UART4RST					(0x1u<<19)
#define	RCC_APB1LRSTR_USART3RST					(0x1u<<18)
#define	RCC_APB1LRSTR_USART2RST					(0x1u<<17)
#define	RCC_APB1LRSTR_SPDIFRX1RST				(0x1u<<16)
#define	RCC_APB1LRSTR_SPI3RST					(0x1u<<15)
#define	RCC_APB1LRSTR_SPI2RST					(0x1u<<14)
#define	RCC_APB1LRSTR_TIM11RST					(0x1u<<13)
#define	RCC_APB1LRSTR_TIM10RST					(0x1u<<12)
#define	RCC_APB1LRSTR_WWDGRST					(0x1u<<11)
#define	RCC_APB1LRSTR_LPTIM1RST					(0x1u<<9)
#define	RCC_APB1LRSTR_TIM14RST					(0x1u<<8)
#define	RCC_APB1LRSTR_TIM13RST					(0x1u<<7)
#define	RCC_APB1LRSTR_TIM12RST					(0x1u<<6)
#define	RCC_APB1LRSTR_TIM7RST					(0x1u<<5)
#define	RCC_APB1LRSTR_TIM6RST					(0x1u<<4)
#define	RCC_APB1LRSTR_TIM5RST					(0x1u<<3)
#define	RCC_APB1LRSTR_TIM4RST					(0x1u<<2)
#define	RCC_APB1LRSTR_TIM3RST					(0x1u<<1)
#define	RCC_APB1LRSTR_TIM2RST					(0x1u<<0)

