hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
#define	RCC_APB1LRSTR_UART8RST_B_0X0			(0x0u<<31)
#define	RCC_APB1LRSTR_UART8RST_B_0X1			(0x1u<<31)
#define	RCC_APB1LRSTR_UART7RST_B_0X0			(0x0u<<30)
#define	RCC_APB1LRSTR_UART7RST_B_0X1			(0x1u<<30)
#define	RCC_APB1LRSTR_I3C2RST_B_0X0				(0x0u<<25)
#define	RCC_APB1LRSTR_I3C2RST_B_0X1				(0x1u<<25)
#define	RCC_APB1LRSTR_I3C1RST_B_0X0				(0x0u<<24)
#define	RCC_APB1LRSTR_I3C1RST_B_0X1				(0x1u<<24)
#define	RCC_APB1LRSTR_I2C3RST_B_0X0				(0x0u<<23)
#define	RCC_APB1LRSTR_I2C3RST_B_0X1				(0x1u<<23)
#define	RCC_APB1LRSTR_I2C2RST_B_0X0				(0x0u<<22)
#define	RCC_APB1LRSTR_I2C2RST_B_0X1				(0x1u<<22)
#define	RCC_APB1LRSTR_I2C1RST_B_0X0				(0x0u<<21)
#define	RCC_APB1LRSTR_I2C1RST_B_0X1				(0x1u<<21)
#define	RCC_APB1LRSTR_UART5RST_B_0X0			(0x0u<<20)
#define	RCC_APB1LRSTR_UART5RST_B_0X1			(0x1u<<20)
#define	RCC_APB1LRSTR_UART4RST_B_0X0			(0x0u<<19)
#define	RCC_APB1LRSTR_UART4RST_B_0X1			(0x1u<<19)
#define	RCC_APB1LRSTR_USART3RST_B_0X0			(0x0u<<18)
#define	RCC_APB1LRSTR_USART3RST_B_0X1			(0x1u<<18)
#define	RCC_APB1LRSTR_USART2RST_B_0X0			(0x0u<<17)
#define	RCC_APB1LRSTR_USART2RST_B_0X1			(0x1u<<17)
#define	RCC_APB1LRSTR_SPDIFRX1RST_B_0X0			(0x0u<<16)
#define	RCC_APB1LRSTR_SPDIFRX1RST_B_0X1			(0x1u<<16)
#define	RCC_APB1LRSTR_SPI3RST_B_0X0				(0x0u<<15)
#define	RCC_APB1LRSTR_SPI3RST_B_0X1				(0x1u<<15)
#define	RCC_APB1LRSTR_SPI2RST_B_0X0				(0x0u<<14)
#define	RCC_APB1LRSTR_SPI2RST_B_0X1				(0x1u<<14)
#define	RCC_APB1LRSTR_TIM11RST_B_0X0			(0x0u<<13)
#define	RCC_APB1LRSTR_TIM11RST_B_0X1			(0x1u<<13)
#define	RCC_APB1LRSTR_TIM10RST_B_0X0			(0x0u<<12)
#define	RCC_APB1LRSTR_TIM10RST_B_0X1			(0x1u<<12)
#define	RCC_APB1LRSTR_WWDGRST_B_0X0				(0x0u<<11)
#define	RCC_APB1LRSTR_WWDGRST_B_0X1				(0x1u<<11)
#define	RCC_APB1LRSTR_LPTIM1RST_B_0X0			(0x0u<<9)
#define	RCC_APB1LRSTR_LPTIM1RST_B_0X1			(0x1u<<9)
#define	RCC_APB1LRSTR_TIM14RST_B_0X0			(0x0u<<8)
#define	RCC_APB1LRSTR_TIM14RST_B_0X1			(0x1u<<8)
#define	RCC_APB1LRSTR_TIM13RST_B_0X0			(0x0u<<7)
#define	RCC_APB1LRSTR_TIM13RST_B_0X1			(0x1u<<7)
#define	RCC_APB1LRSTR_TIM12RST_B_0X0			(0x0u<<6)
#define	RCC_APB1LRSTR_TIM12RST_B_0X1			(0x1u<<6)
#define	RCC_APB1LRSTR_TIM7RST_B_0X0				(0x0u<<5)
#define	RCC_APB1LRSTR_TIM7RST_B_0X1				(0x1u<<5)
#define	RCC_APB1LRSTR_TIM6RST_B_0X0				(0x0u<<4)
#define	RCC_APB1LRSTR_TIM6RST_B_0X1				(0x1u<<4)
#define	RCC_APB1LRSTR_TIM5RST_B_0X0				(0x0u<<3)
#define	RCC_APB1LRSTR_TIM5RST_B_0X1				(0x1u<<3)
#define	RCC_APB1LRSTR_TIM4RST_B_0X0				(0x0u<<2)
#define	RCC_APB1LRSTR_TIM4RST_B_0X1				(0x1u<<2)
#define	RCC_APB1LRSTR_TIM3RST_B_0X0				(0x0u<<1)
#define	RCC_APB1LRSTR_TIM3RST_B_0X1				(0x1u<<1)
#define	RCC_APB1LRSTR_TIM2RST_B_0X0				(0x0u<<0)
#define	RCC_APB1LRSTR_TIM2RST_B_0X1				(0x1u<<0)

// APB1HRSTR Configuration

#define	RCC_APB1HRSTR_UCPD1RST					(0x1u<<18)
#define	RCC_APB1HRSTR_FDCANRST					(0x1u<<8)
#define	RCC_APB1HRSTR_MDIOSRST					(0x1u<<5)

#define	RCC_APB1HRSTR_UCPD1RST_B_0X0			(0x0u<<18)
#define	RCC_APB1HRSTR_UCPD1RST_B_0X1			(0x1u<<18)
#define	RCC_APB1HRSTR_FDCANRST_B_0X0			(0x0u<<8)
#define	RCC_APB1HRSTR_FDCANRST_B_0X1			(0x1u<<8)
#define	RCC_APB1HRSTR_MDIOSRST_B_0X0			(0x0u<<5)
#define	RCC_APB1HRSTR_MDIOSRST_B_0X1			(0x1u<<5)

// APB2RSTR Configuration

#define	RCC_APB2RSTR_SAI2RST					(0x1u<<22)
#define	RCC_APB2RSTR_SAI1RST					(0x1u<<21)
#define	RCC_APB2RSTR_SPI5RST					(0x1u<<20)
#define	RCC_APB2RSTR_TIM9RST					(0x1u<<19)
#define	RCC_APB2RSTR_TIM17RST					(0x1u<<18)
#define	RCC_APB2RSTR_TIM16RST					(0x1u<<17)
#define	RCC_APB2RSTR_TIM15RST					(0x1u<<16)
#define	RCC_APB2RSTR_TIM18RST					(0x1u<<15)
#define	RCC_APB2RSTR_SPI4RST					(0x1u<<13)
#define	RCC_APB2RSTR_SPI1RST					(0x1u<<12)
#define	RCC_APB2RSTR_USART10RST					(0x1u<<7)
#define	RCC_APB2RSTR_UART9RST					(0x1u<<6)
#define	RCC_APB2RSTR_USART6RST					(0x1u<<5)
#define	RCC_APB2RSTR_USART1RST					(0x1u<<4)
#define	RCC_APB2RSTR_TIM8RST					(0x1u<<1)
#define	RCC_APB2RSTR_TIM1RST					(0x1u<<0)

#define	RCC_APB2RSTR_SAI2RST_B_0X0				(0x0u<<22)
#define	RCC_APB2RSTR_SAI2RST_B_0X1				(0x1u<<22)
#define	RCC_APB2RSTR_SAI1RST_B_0X0				(0x0u<<21)
#define	RCC_APB2RSTR_SAI1RST_B_0X1				(0x1u<<21)
#define	RCC_APB2RSTR_SPI5RST_B_0X0				(0x0u<<20)
#define	RCC_APB2RSTR_SPI5RST_B_0X1				(0x1u<<20)
#define	RCC_APB2RSTR_TIM9RST_B_0X0				(0x0u<<19)
#define	RCC_APB2RSTR_TIM9RST_B_0X1				(0x1u<<19)
#define	RCC_APB2RSTR_TIM17RST_B_0X0				(0x0u<<18)
#define	RCC_APB2RSTR_TIM17RST_B_0X1				(0x1u<<18)
#define	RCC_APB2RSTR_TIM16RST_B_0X0				(0x0u<<17)
#define	RCC_APB2RSTR_TIM16RST_B_0X1				(0x1u<<17)
#define	RCC_APB2RSTR_TIM15RST_B_0X0				(0x0u<<16)
#define	RCC_APB2RSTR_TIM15RST_B_0X1				(0x1u<<16)
#define	RCC_APB2RSTR_TIM18RST_B_0X0				(0x0u<<15)
#define	RCC_APB2RSTR_TIM18RST_B_0X1				(0x1u<<15)
#define	RCC_APB2RSTR_SPI4RST_B_0X0				(0x0u<<13)
#define	RCC_APB2RSTR_SPI4RST_B_0X1				(0x1u<<13)
#define	RCC_APB2RSTR_SPI1RST_B_0X0				(0x0u<<12)
#define	RCC_APB2RSTR_SPI1RST_B_0X1				(0x1u<<12)
#define	RCC_APB2RSTR_USART10RST_B_0X0			(0x0u<<7)
#define	RCC_APB2RSTR_USART10RST_B_0X1			(0x1u<<7)
#define	RCC_APB2RSTR_UART9RST_B_0X0				(0x0u<<6)
#define	RCC_APB2RSTR_UART9RST_B_0X1				(0x1u<<6)
#define	RCC_APB2RSTR_USART6RST_B_0X0			(0x0u<<5)
#define	RCC_APB2RSTR_USART6RST_B_0X1			(0x1u<<5)
#define	RCC_APB2RSTR_USART1RST_B_0X0			(0x0u<<4)
#define	RCC_APB2RSTR_USART1RST_B_0X1			(0x1u<<4)
#define	RCC_APB2RSTR_TIM8RST_B_0X0				(0x0u<<1)
#define	RCC_APB2RSTR_TIM8RST_B_0X1				(0x1u<<1)
#define	RCC_APB2RSTR_TIM1RST_B_0X0				(0x0u<<0)
#define	RCC_APB2RSTR_TIM1RST_B_0X1				(0x1u<<0)

// APB4LRSTR Configuration

#define	RCC_APB4LRSTR_SERFRST					(0x1u<<31)
#define	RCC_APB4LRSTR_R2GNPURST					(0x1u<<23)
#define	RCC_APB4LRSTR_R2GRETRST					(0x1u<<22)
#define	RCC_APB4LRSTR_RTCRST					(0x1u<<16)
#define	RCC_APB4LRSTR_VREFBUFRST				(0x1u<<15)
#define	RCC_APB4LRSTR_LPTIM5RST					(0x1u<<12)
#define	RCC_APB4LRSTR_LPTIM4RST					(0x1u<<11)
#define	RCC_APB4LRSTR_LPTIM3RST					(0x1u<<10)
#define	RCC_APB4LRSTR_LPTIM2RST					(0x1u<<9)
#define	RCC_APB4LRSTR_I2C4RST					(0x1u<<7)
#define	RCC_APB4LRSTR_SPI6RST					(0x1u<<5)
#define	RCC_APB4LRSTR_LPUART1RST				(0x1u<<3)
#define	RCC_APB4LRSTR_HDPRST					(0x1u<<2)

#define	RCC_APB4LRSTR_SERFRST_B_0X0				(0x0u<<31)
#define	RCC_APB4LRSTR_SERFRST_B_0X1				(0x1u<<31)
#define	RCC_APB4LRSTR_R2GNPURST_B_0X0			(0x0u<<23)
#define	RCC_APB4LRSTR_R2GNPURST_B_0X1			(0x1u<<23)
#define	RCC_APB4LRSTR_R2GRETRST_B_0X0			(0x0u<<22)
#define	RCC_APB4LRSTR_R2GRETRST_B_0X1			(0x1u<<22)
#define	RCC_APB4LRSTR_RTCRST_B_0X0				(0x0u<<16)
#define	RCC_APB4LRSTR_RTCRST_B_0X1				(0x1u<<16)
#define	RCC_APB4LRSTR_VREFBUFRST_B_0X0			(0x0u<<15)
#define	RCC_APB4LRSTR_VREFBUFRST_B_0X1			(0x1u<<15)
#define	RCC_APB4LRSTR_LPTIM5RST_B_0X0			(0x0u<<12)
#define	RCC_APB4LRSTR_LPTIM5RST_B_0X1			(0x1u<<12)
#define	RCC_APB4LRSTR_LPTIM4RST_B_0X0			(0x0u<<11)
#define	RCC_APB4LRSTR_LPTIM4RST_B_0X1			(0x1u<<11)
#define	RCC_APB4LRSTR_LPTIM3RST_B_0X0			(0x0u<<10)
#define	RCC_APB4LRSTR_LPTIM3RST_B_0X1			(0x1u<<10)
#define	RCC_APB4LRSTR_LPTIM2RST_B_0X0			(0x0u<<9)
#define	RCC_APB4LRSTR_LPTIM2RST_B_0X1			(0x1u<<9)
#define	RCC_APB4LRSTR_I2C4RST_B_0X0				(0x0u<<7)
#define	RCC_APB4LRSTR_I2C4RST_B_0X1				(0x1u<<7)
#define	RCC_APB4LRSTR_SPI6RST_B_0X0				(0x0u<<5)
#define	RCC_APB4LRSTR_SPI6RST_B_0X1				(0x1u<<5)
#define	RCC_APB4LRSTR_LPUART1RST_B_0X0			(0x0u<<3)
#define	RCC_APB4LRSTR_LPUART1RST_B_0X1			(0x1u<<3)
#define	RCC_APB4LRSTR_HDPRST_B_0X0				(0x0u<<2)
#define	RCC_APB4LRSTR_HDPRST_B_0X1				(0x1u<<2)

// APB4HRSTR Configuration

#define	RCC_APB4HRSTR_BUSPERFMRST				(0x1u<<4)
#define	RCC_APB4HRSTR_DTSRST					(0x1u<<2)
#define	RCC_APB4HRSTR_SYSCFGRST					(0x1u<<0)

