hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
#define	RCC_APB4HRSTR_BUSPERFMRST_B_0X0			(0x0u<<4)
#define	RCC_APB4HRSTR_BUSPERFMRST_B_0X1			(0x1u<<4)
#define	RCC_APB4HRSTR_DTSRST_B_0X0				(0x0u<<2)
#define	RCC_APB4HRSTR_DTSRST_B_0X1				(0x1u<<2)
#define	RCC_APB4HRSTR_SYSCFGRST_B_0X0			(0x0u<<0)
#define	RCC_APB4HRSTR_SYSCFGRST_B_0X1			(0x1u<<0)

// APB5RSTR Configuration

#define	RCC_APB5RSTR_CSIRST						(0x1u<<6)
#define	RCC_APB5RSTR_VENCRST					(0x1u<<5)
#define	RCC_APB5RSTR_GFXTIMRST					(0x1u<<4)
#define	RCC_APB5RSTR_DCMIPPRST					(0x1u<<2)
#define	RCC_APB5RSTR_LTDCRST					(0x1u<<1)

#define	RCC_APB5RSTR_CSIRST_B_0X0				(0x0u<<6)
#define	RCC_APB5RSTR_CSIRST_B_0X1				(0x1u<<6)
#define	RCC_APB5RSTR_VENCRST_B_0X0				(0x0u<<5)
#define	RCC_APB5RSTR_VENCRST_B_0X1				(0x1u<<5)
#define	RCC_APB5RSTR_GFXTIMRST_B_0X0			(0x0u<<4)
#define	RCC_APB5RSTR_GFXTIMRST_B_0X1			(0x1u<<4)
#define	RCC_APB5RSTR_DCMIPPRST_B_0X0			(0x0u<<2)
#define	RCC_APB5RSTR_DCMIPPRST_B_0X1			(0x1u<<2)
#define	RCC_APB5RSTR_LTDCRST_B_0X0				(0x0u<<1)
#define	RCC_APB5RSTR_LTDCRST_B_0X1				(0x1u<<1)

// DIVENR Configuration

#define	RCC_DIVENR_IC20EN						(0x1u<<19)
#define	RCC_DIVENR_IC19EN						(0x1u<<18)
#define	RCC_DIVENR_IC18EN						(0x1u<<17)
#define	RCC_DIVENR_IC17EN						(0x1u<<16)
#define	RCC_DIVENR_IC16EN						(0x1u<<15)
#define	RCC_DIVENR_IC15EN						(0x1u<<14)
#define	RCC_DIVENR_IC14EN						(0x1u<<13)
#define	RCC_DIVENR_IC13EN						(0x1u<<12)
#define	RCC_DIVENR_IC12EN						(0x1u<<11)
#define	RCC_DIVENR_IC11EN						(0x1u<<10)
#define	RCC_DIVENR_IC10EN						(0x1u<<9)
#define	RCC_DIVENR_IC9EN						(0x1u<<8)
#define	RCC_DIVENR_IC8EN						(0x1u<<7)
#define	RCC_DIVENR_IC7EN						(0x1u<<6)
#define	RCC_DIVENR_IC6EN						(0x1u<<5)
#define	RCC_DIVENR_IC5EN						(0x1u<<4)
#define	RCC_DIVENR_IC4EN						(0x1u<<3)
#define	RCC_DIVENR_IC3EN						(0x1u<<2)
#define	RCC_DIVENR_IC2EN						(0x1u<<1)
#define	RCC_DIVENR_IC1EN						(0x1u<<0)

#define	RCC_DIVENR_IC20EN_B_0X0					(0x0u<<19)
#define	RCC_DIVENR_IC20EN_B_0X1					(0x1u<<19)
#define	RCC_DIVENR_IC19EN_B_0X0					(0x0u<<18)
#define	RCC_DIVENR_IC19EN_B_0X1					(0x1u<<18)
#define	RCC_DIVENR_IC18EN_B_0X0					(0x0u<<17)
#define	RCC_DIVENR_IC18EN_B_0X1					(0x1u<<17)
#define	RCC_DIVENR_IC17EN_B_0X0					(0x0u<<16)
#define	RCC_DIVENR_IC17EN_B_0X1					(0x1u<<16)
#define	RCC_DIVENR_IC16EN_B_0X0					(0x0u<<15)
#define	RCC_DIVENR_IC16EN_B_0X1					(0x1u<<15)
#define	RCC_DIVENR_IC15EN_B_0X0					(0x0u<<14)
#define	RCC_DIVENR_IC15EN_B_0X1					(0x1u<<14)
#define	RCC_DIVENR_IC14EN_B_0X0					(0x0u<<13)
#define	RCC_DIVENR_IC14EN_B_0X1					(0x1u<<13)
#define	RCC_DIVENR_IC13EN_B_0X0					(0x0u<<12)
#define	RCC_DIVENR_IC13EN_B_0X1					(0x1u<<12)
#define	RCC_DIVENR_IC12EN_B_0X0					(0x0u<<11)
#define	RCC_DIVENR_IC12EN_B_0X1					(0x1u<<11)
#define	RCC_DIVENR_IC11EN_B_0X0					(0x0u<<10)
#define	RCC_DIVENR_IC11EN_B_0X1					(0x1u<<10)
#define	RCC_DIVENR_IC10EN_B_0X0					(0x0u<<9)
#define	RCC_DIVENR_IC10EN_B_0X1					(0x1u<<9)
#define	RCC_DIVENR_IC9EN_B_0X0					(0x0u<<8)
#define	RCC_DIVENR_IC9EN_B_0X1					(0x1u<<8)
#define	RCC_DIVENR_IC8EN_B_0X0					(0x0u<<7)
#define	RCC_DIVENR_IC8EN_B_0X1					(0x1u<<7)
#define	RCC_DIVENR_IC7EN_B_0X0					(0x0u<<6)
#define	RCC_DIVENR_IC7EN_B_0X1					(0x1u<<6)
#define	RCC_DIVENR_IC6EN_B_0X0					(0x0u<<5)
#define	RCC_DIVENR_IC6EN_B_0X1					(0x1u<<5)
#define	RCC_DIVENR_IC5EN_B_0X0					(0x0u<<4)
#define	RCC_DIVENR_IC5EN_B_0X1					(0x1u<<4)
#define	RCC_DIVENR_IC4EN_B_0X0					(0x0u<<3)
#define	RCC_DIVENR_IC4EN_B_0X1					(0x1u<<3)
#define	RCC_DIVENR_IC3EN_B_0X0					(0x0u<<2)
#define	RCC_DIVENR_IC3EN_B_0X1					(0x1u<<2)
#define	RCC_DIVENR_IC2EN_B_0X0					(0x0u<<1)
#define	RCC_DIVENR_IC2EN_B_0X1					(0x1u<<1)
#define	RCC_DIVENR_IC1EN_B_0X0					(0x0u<<0)
#define	RCC_DIVENR_IC1EN_B_0X1					(0x1u<<0)

// BUSENR Configuration

#define	RCC_BUSENR_APB5EN						(0x1u<<12)
#define	RCC_BUSENR_APB4EN						(0x1u<<11)
#define	RCC_BUSENR_APB3EN						(0x1u<<10)
#define	RCC_BUSENR_APB2EN						(0x1u<<9)
#define	RCC_BUSENR_APB1EN						(0x1u<<8)
#define	RCC_BUSENR_AHB5EN						(0x1u<<7)
#define	RCC_BUSENR_AHB4EN						(0x1u<<6)
#define	RCC_BUSENR_AHB3EN						(0x1u<<5)
#define	RCC_BUSENR_AHB2EN						(0x1u<<4)
#define	RCC_BUSENR_AHB1EN						(0x1u<<3)
#define	RCC_BUSENR_AHBMEN						(0x1u<<2)
#define	RCC_BUSENR_ACLKNCEN						(0x1u<<1)
#define	RCC_BUSENR_ACLKNEN						(0x1u<<0)

#define	RCC_BUSENR_APB5EN_B_0X0					(0x0u<<12)
#define	RCC_BUSENR_APB5EN_B_0X1					(0x1u<<12)
#define	RCC_BUSENR_APB4EN_B_0X0					(0x0u<<11)
#define	RCC_BUSENR_APB4EN_B_0X1					(0x1u<<11)
#define	RCC_BUSENR_APB3EN_B_0X0					(0x0u<<10)
#define	RCC_BUSENR_APB3EN_B_0X1					(0x1u<<10)
#define	RCC_BUSENR_APB2EN_B_0X0					(0x0u<<9)
#define	RCC_BUSENR_APB2EN_B_0X1					(0x1u<<9)
#define	RCC_BUSENR_APB1EN_B_0X0					(0x0u<<8)
#define	RCC_BUSENR_APB1EN_B_0X1					(0x1u<<8)
#define	RCC_BUSENR_AHB5EN_B_0X0					(0x0u<<7)
#define	RCC_BUSENR_AHB5EN_B_0X1					(0x1u<<7)
#define	RCC_BUSENR_AHB4EN_B_0X0					(0x0u<<6)
#define	RCC_BUSENR_AHB4EN_B_0X1					(0x1u<<6)
#define	RCC_BUSENR_AHB3EN_B_0X0					(0x0u<<5)
#define	RCC_BUSENR_AHB3EN_B_0X1					(0x1u<<5)
#define	RCC_BUSENR_AHB2EN_B_0X0					(0x0u<<4)
#define	RCC_BUSENR_AHB2EN_B_0X1					(0x1u<<4)
#define	RCC_BUSENR_AHB1EN_B_0X0					(0x0u<<3)
#define	RCC_BUSENR_AHB1EN_B_0X1					(0x1u<<3)
#define	RCC_BUSENR_AHBMEN_B_0X0					(0x0u<<2)
#define	RCC_BUSENR_AHBMEN_B_0X1					(0x1u<<2)
#define	RCC_BUSENR_ACLKNCEN_B_0X0				(0x0u<<1)
#define	RCC_BUSENR_ACLKNCEN_B_0X1				(0x1u<<1)
#define	RCC_BUSENR_ACLKNEN_B_0X0				(0x0u<<0)
#define	RCC_BUSENR_ACLKNEN_B_0X1				(0x1u<<0)

// MISCENR Configuration

#define	RCC_MISCENR_PEREN						(0x1u<<6)
#define	RCC_MISCENR_XSPIPHYCOMPEN				(0x1u<<3)
#define	RCC_MISCENR_MCO2EN						(0x1u<<2)
#define	RCC_MISCENR_MCO1EN						(0x1u<<1)
#define	RCC_MISCENR_DBGEN						(0x1u<<0)

#define	RCC_MISCENR_PEREN_B_0X0					(0x0u<<6)
#define	RCC_MISCENR_PEREN_B_0X1					(0x1u<<6)
#define	RCC_MISCENR_XSPIPHYCOMPEN_B_0X0			(0x0u<<3)
#define	RCC_MISCENR_XSPIPHYCOMPEN_B_0X1			(0x1u<<3)
#define	RCC_MISCENR_MCO2EN_B_0X0				(0x0u<<2)
#define	RCC_MISCENR_MCO2EN_B_0X1				(0x1u<<2)
#define	RCC_MISCENR_MCO1EN_B_0X0				(0x0u<<1)
#define	RCC_MISCENR_MCO1EN_B_0X1				(0x1u<<1)
#define	RCC_MISCENR_DBGEN_B_0X0					(0x0u<<0)
#define	RCC_MISCENR_DBGEN_B_0X1					(0x1u<<0)

// MEMENR Configuration

