hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
#define	RCC_MEMENR_BOOTROMEN					(0x1u<<12)
#define	RCC_MEMENR_VENCRAMEN					(0x1u<<11)
#define	RCC_MEMENR_NPUCACHERAMEN				(0x1u<<10)
#define	RCC_MEMENR_FLEXRAMEN					(0x1u<<9)
#define	RCC_MEMENR_AXISRAM2EN					(0x1u<<8)
#define	RCC_MEMENR_AXISRAM1EN					(0x1u<<7)
#define	RCC_MEMENR_BKPSRAMEN					(0x1u<<6)
#define	RCC_MEMENR_AHBSRAM2EN					(0x1u<<5)
#define	RCC_MEMENR_AHBSRAM1EN					(0x1u<<4)
#define	RCC_MEMENR_AXISRAM6EN					(0x1u<<3)
#define	RCC_MEMENR_AXISRAM5EN					(0x1u<<2)
#define	RCC_MEMENR_AXISRAM4EN					(0x1u<<1)
#define	RCC_MEMENR_AXISRAM3EN					(0x1u<<0)

#define	RCC_MEMENR_BOOTROMEN_B_0X0				(0x0u<<12)
#define	RCC_MEMENR_BOOTROMEN_B_0X1				(0x1u<<12)
#define	RCC_MEMENR_VENCRAMEN_B_0X0				(0x0u<<11)
#define	RCC_MEMENR_VENCRAMEN_B_0X1				(0x1u<<11)
#define	RCC_MEMENR_NPUCACHERAMEN_B_0X0			(0x0u<<10)
#define	RCC_MEMENR_NPUCACHERAMEN_B_0X1			(0x1u<<10)
#define	RCC_MEMENR_FLEXRAMEN_B_0X0				(0x0u<<9)
#define	RCC_MEMENR_FLEXRAMEN_B_0X1				(0x1u<<9)
#define	RCC_MEMENR_AXISRAM2EN_B_0X0				(0x0u<<8)
#define	RCC_MEMENR_AXISRAM2EN_B_0X1				(0x1u<<8)
#define	RCC_MEMENR_AXISRAM1EN_B_0X0				(0x0u<<7)
#define	RCC_MEMENR_AXISRAM1EN_B_0X1				(0x1u<<7)
#define	RCC_MEMENR_BKPSRAMEN_B_0X0				(0x0u<<6)
#define	RCC_MEMENR_BKPSRAMEN_B_0X1				(0x1u<<6)
#define	RCC_MEMENR_AHBSRAM2EN_B_0X0				(0x0u<<5)
#define	RCC_MEMENR_AHBSRAM2EN_B_0X1				(0x1u<<5)
#define	RCC_MEMENR_AHBSRAM1EN_B_0X0				(0x0u<<4)
#define	RCC_MEMENR_AHBSRAM1EN_B_0X1				(0x1u<<4)
#define	RCC_MEMENR_AXISRAM6EN_B_0X0				(0x0u<<3)
#define	RCC_MEMENR_AXISRAM6EN_B_0X1				(0x1u<<3)
#define	RCC_MEMENR_AXISRAM5EN_B_0X0				(0x0u<<2)
#define	RCC_MEMENR_AXISRAM5EN_B_0X1				(0x1u<<2)
#define	RCC_MEMENR_AXISRAM4EN_B_0X0				(0x0u<<1)
#define	RCC_MEMENR_AXISRAM4EN_B_0X1				(0x1u<<1)
#define	RCC_MEMENR_AXISRAM3EN_B_0X0				(0x0u<<0)
#define	RCC_MEMENR_AXISRAM3EN_B_0X1				(0x1u<<0)

// AHB1ENR Configuration

#define	RCC_AHB1ENR_ADC12EN						(0x1u<<5)
#define	RCC_AHB1ENR_GPDMA1EN					(0x1u<<4)

#define	RCC_AHB1ENR_ADC12EN_B_0X0				(0x0u<<5)
#define	RCC_AHB1ENR_ADC12EN_B_0X1				(0x1u<<5)
#define	RCC_AHB1ENR_GPDMA1EN_B_0X0				(0x0u<<4)
#define	RCC_AHB1ENR_GPDMA1EN_B_0X1				(0x1u<<4)

// AHB2ENR Configuration

#define	RCC_AHB2ENR_ADF1EN						(0x1u<<17)
#define	RCC_AHB2ENR_MDF1EN						(0x1u<<16)
#define	RCC_AHB2ENR_RAMCFGEN					(0x1u<<12)

#define	RCC_AHB2ENR_ADF1EN_B_0X0				(0x0u<<17)
#define	RCC_AHB2ENR_ADF1EN_B_0X1				(0x1u<<17)
#define	RCC_AHB2ENR_MDF1EN_B_0X0				(0x0u<<16)
#define	RCC_AHB2ENR_MDF1EN_B_0X1				(0x1u<<16)
#define	RCC_AHB2ENR_RAMCFGEN_B_0X0				(0x0u<<12)
#define	RCC_AHB2ENR_RAMCFGEN_B_0X1				(0x1u<<12)

// AHB3ENR Configuration

#define	RCC_AHB3ENR_RISAFEN						(0x1u<<14)
#define	RCC_AHB3ENR_IACEN						(0x1u<<10)
#define	RCC_AHB3ENR_RIFSCEN						(0x1u<<9)
#define	RCC_AHB3ENR_PKAEN						(0x1u<<8)
#define	RCC_AHB3ENR_SAESEN						(0x1u<<4)
#define	RCC_AHB3ENR_CRYPEN						(0x1u<<2)
#define	RCC_AHB3ENR_HASHEN						(0x1u<<1)
#define	RCC_AHB3ENR_RNGEN						(0x1u<<0)

#define	RCC_AHB3ENR_RISAFEN_B_0X0				(0x0u<<14)
#define	RCC_AHB3ENR_RISAFEN_B_0X1				(0x1u<<14)
#define	RCC_AHB3ENR_IACEN_B_0X0					(0x0u<<10)
#define	RCC_AHB3ENR_IACEN_B_0X1					(0x1u<<10)
#define	RCC_AHB3ENR_RIFSCEN_B_0X0				(0x0u<<9)
#define	RCC_AHB3ENR_RIFSCEN_B_0X1				(0x1u<<9)
#define	RCC_AHB3ENR_PKAEN_B_0X0					(0x0u<<8)
#define	RCC_AHB3ENR_PKAEN_B_0X1					(0x1u<<8)
#define	RCC_AHB3ENR_SAESEN_B_0X0				(0x0u<<4)
#define	RCC_AHB3ENR_SAESEN_B_0X1				(0x1u<<4)
#define	RCC_AHB3ENR_CRYPEN_B_0X0				(0x0u<<2)
#define	RCC_AHB3ENR_CRYPEN_B_0X1				(0x1u<<2)
#define	RCC_AHB3ENR_HASHEN_B_0X0				(0x0u<<1)
#define	RCC_AHB3ENR_HASHEN_B_0X1				(0x1u<<1)
#define	RCC_AHB3ENR_RNGEN_B_0X0					(0x0u<<0)
#define	RCC_AHB3ENR_RNGEN_B_0X1					(0x1u<<0)

// AHB4ENR Configuration

#define	RCC_AHB4ENR_CRCEN						(0x1u<<19)
#define	RCC_AHB4ENR_PWREN						(0x1u<<18)
#define	RCC_AHB4ENR_GPIOQEN						(0x1u<<16)
#define	RCC_AHB4ENR_GPIOPEN						(0x1u<<15)
#define	RCC_AHB4ENR_GPIOOEN						(0x1u<<14)
#define	RCC_AHB4ENR_GPIONEN						(0x1u<<13)
#define	RCC_AHB4ENR_GPIOHEN						(0x1u<<7)
#define	RCC_AHB4ENR_GPIOGEN						(0x1u<<6)
#define	RCC_AHB4ENR_GPIOFEN						(0x1u<<5)
#define	RCC_AHB4ENR_GPIOEEN						(0x1u<<4)
#define	RCC_AHB4ENR_GPIODEN						(0x1u<<3)
#define	RCC_AHB4ENR_GPIOCEN						(0x1u<<2)
#define	RCC_AHB4ENR_GPIOBEN						(0x1u<<1)
#define	RCC_AHB4ENR_GPIOAEN						(0x1u<<0)

#define	RCC_AHB4ENR_CRCEN_B_0X0					(0x0u<<19)
#define	RCC_AHB4ENR_CRCEN_B_0X1					(0x1u<<19)
#define	RCC_AHB4ENR_PWREN_B_0X0					(0x0u<<18)
#define	RCC_AHB4ENR_PWREN_B_0X1					(0x1u<<18)
#define	RCC_AHB4ENR_GPIOQEN_B_0X0				(0x0u<<16)
#define	RCC_AHB4ENR_GPIOQEN_B_0X1				(0x1u<<16)
#define	RCC_AHB4ENR_GPIOPEN_B_0X0				(0x0u<<15)
#define	RCC_AHB4ENR_GPIOPEN_B_0X1				(0x1u<<15)
#define	RCC_AHB4ENR_GPIOOEN_B_0X0				(0x0u<<14)
#define	RCC_AHB4ENR_GPIOOEN_B_0X1				(0x1u<<14)
#define	RCC_AHB4ENR_GPIONEN_B_0X0				(0x0u<<13)
#define	RCC_AHB4ENR_GPIONEN_B_0X1				(0x1u<<13)
#define	RCC_AHB4ENR_GPIOHEN_B_0X0				(0x0u<<7)
#define	RCC_AHB4ENR_GPIOHEN_B_0X1				(0x1u<<7)
#define	RCC_AHB4ENR_GPIOGEN_B_0X0				(0x0u<<6)
#define	RCC_AHB4ENR_GPIOGEN_B_0X1				(0x1u<<6)
#define	RCC_AHB4ENR_GPIOFEN_B_0X0				(0x0u<<5)
#define	RCC_AHB4ENR_GPIOFEN_B_0X1				(0x1u<<5)
#define	RCC_AHB4ENR_GPIOEEN_B_0X0				(0x0u<<4)
#define	RCC_AHB4ENR_GPIOEEN_B_0X1				(0x1u<<4)
#define	RCC_AHB4ENR_GPIODEN_B_0X0				(0x0u<<3)
#define	RCC_AHB4ENR_GPIODEN_B_0X1				(0x1u<<3)
#define	RCC_AHB4ENR_GPIOCEN_B_0X0				(0x0u<<2)
#define	RCC_AHB4ENR_GPIOCEN_B_0X1				(0x1u<<2)
#define	RCC_AHB4ENR_GPIOBEN_B_0X0				(0x0u<<1)
#define	RCC_AHB4ENR_GPIOBEN_B_0X1				(0x1u<<1)
#define	RCC_AHB4ENR_GPIOAEN_B_0X0				(0x0u<<0)
#define	RCC_AHB4ENR_GPIOAEN_B_0X1				(0x1u<<0)

// AHB5ENR Configuration

#define	RCC_AHB5ENR_NPUEN						(0x1u<<31)
#define	RCC_AHB5ENR_NPUCACHEEN					(0x1u<<30)
#define	RCC_AHB5ENR_OTG2EN						(0x1u<<29)
#define	RCC_AHB5ENR_OTGPHY2EN					(0x1u<<28)
#define	RCC_AHB5ENR_OTGPHY1EN					(0x1u<<27)
#define	RCC_AHB5ENR_OTG1EN						(0x1u<<26)
#define	RCC_AHB5ENR_ETH1EN						(0x1u<<25)
#define	RCC_AHB5ENR_ETH1RXEN					(0x1u<<24)
#define	RCC_AHB5ENR_ETH1TXEN					(0x1u<<23)
#define	RCC_AHB5ENR_ETH1MACEN					(0x1u<<22)
#define	RCC_AHB5ENR_GPUEN						(0x1u<<20)
#define	RCC_AHB5ENR_GFXMMUEN					(0x1u<<19)
#define	RCC_AHB5ENR_MCE4EN						(0x1u<<18)
#define	RCC_AHB5ENR_XSPI3EN						(0x1u<<17)
#define	RCC_AHB5ENR_MCE3EN						(0x1u<<16)
#define	RCC_AHB5ENR_MCE2EN						(0x1u<<15)
#define	RCC_AHB5ENR_MCE1EN						(0x1u<<14)
#define	RCC_AHB5ENR_XSPIMEN						(0x1u<<13)
#define	RCC_AHB5ENR_XSPI2EN						(0x1u<<12)
#define	RCC_AHB5ENR_SDMMC1EN					(0x1u<<8)
#define	RCC_AHB5ENR_SDMMC2EN					(0x1u<<7)
#define	RCC_AHB5ENR_PSSIEN						(0x1u<<6)
#define	RCC_AHB5ENR_XSPI1EN						(0x1u<<5)
#define	RCC_AHB5ENR_FMCEN						(0x1u<<4)
#define	RCC_AHB5ENR_JPEGEN						(0x1u<<3)
#define	RCC_AHB5ENR_DMA2DEN						(0x1u<<1)
#define	RCC_AHB5ENR_HPDMA1EN					(0x1u<<0)

#define	RCC_AHB5ENR_NPUEN_B_0X0					(0x0u<<31)
#define	RCC_AHB5ENR_NPUEN_B_0X1					(0x1u<<31)
#define	RCC_AHB5ENR_NPUCACHEEN_B_0X0			(0x0u<<30)
#define	RCC_AHB5ENR_NPUCACHEEN_B_0X1			(0x1u<<30)
#define	RCC_AHB5ENR_OTG2EN_B_0X0				(0x0u<<29)
#define	RCC_AHB5ENR_OTG2EN_B_0X1				(0x1u<<29)
#define	RCC_AHB5ENR_OTGPHY2EN_B_0X0				(0x0u<<28)
#define	RCC_AHB5ENR_OTGPHY2EN_B_0X1				(0x1u<<28)
#define	RCC_AHB5ENR_OTGPHY1EN_B_0X0				(0x0u<<27)
#define	RCC_AHB5ENR_OTGPHY1EN_B_0X1				(0x1u<<27)
#define	RCC_AHB5ENR_OTG1EN_B_0X0				(0x0u<<26)
#define	RCC_AHB5ENR_OTG1EN_B_0X1				(0x1u<<26)
#define	RCC_AHB5ENR_ETH1EN_B_0X0				(0x0u<<25)
#define	RCC_AHB5ENR_ETH1EN_B_0X1				(0x1u<<25)
#define	RCC_AHB5ENR_ETH1RXEN_B_0X0				(0x0u<<24)
#define	RCC_AHB5ENR_ETH1RXEN_B_0X1				(0x1u<<24)
#define	RCC_AHB5ENR_ETH1TXEN_B_0X0				(0x0u<<23)
#define	RCC_AHB5ENR_ETH1TXEN_B_0X1				(0x1u<<23)
#define	RCC_AHB5ENR_ETH1MACEN_B_0X0				(0x0u<<22)
#define	RCC_AHB5ENR_ETH1MACEN_B_0X1				(0x1u<<22)
#define	RCC_AHB5ENR_GPUEN_B_0X0					(0x0u<<20)
#define	RCC_AHB5ENR_GPUEN_B_0X1					(0x1u<<20)
#define	RCC_AHB5ENR_GFXMMUEN_B_0X0				(0x0u<<19)
#define	RCC_AHB5ENR_GFXMMUEN_B_0X1				(0x1u<<19)
#define	RCC_AHB5ENR_MCE4EN_B_0X0				(0x0u<<18)
#define	RCC_AHB5ENR_MCE4EN_B_0X1				(0x1u<<18)
#define	RCC_AHB5ENR_XSPI3EN_B_0X0				(0x0u<<17)
#define	RCC_AHB5ENR_XSPI3EN_B_0X1				(0x1u<<17)
#define	RCC_AHB5ENR_MCE3EN_B_0X0				(0x0u<<16)
#define	RCC_AHB5ENR_MCE3EN_B_0X1				(0x1u<<16)
#define	RCC_AHB5ENR_MCE2EN_B_0X0				(0x0u<<15)
#define	RCC_AHB5ENR_MCE2EN_B_0X1				(0x1u<<15)
#define	RCC_AHB5ENR_MCE1EN_B_0X0				(0x0u<<14)
#define	RCC_AHB5ENR_MCE1EN_B_0X1				(0x1u<<14)
#define	RCC_AHB5ENR_XSPIMEN_B_0X0				(0x0u<<13)
#define	RCC_AHB5ENR_XSPIMEN_B_0X1				(0x1u<<13)
#define	RCC_AHB5ENR_XSPI2EN_B_0X0				(0x0u<<12)
#define	RCC_AHB5ENR_XSPI2EN_B_0X1				(0x1u<<12)
#define	RCC_AHB5ENR_SDMMC1EN_B_0X0				(0x0u<<8)
#define	RCC_AHB5ENR_SDMMC1EN_B_0X1				(0x1u<<8)
#define	RCC_AHB5ENR_SDMMC2EN_B_0X0				(0x0u<<7)
#define	RCC_AHB5ENR_SDMMC2EN_B_0X1				(0x1u<<7)
#define	RCC_AHB5ENR_PSSIEN_B_0X0				(0x0u<<6)
#define	RCC_AHB5ENR_PSSIEN_B_0X1				(0x1u<<6)
#define	RCC_AHB5ENR_XSPI1EN_B_0X0				(0x0u<<5)
#define	RCC_AHB5ENR_XSPI1EN_B_0X1				(0x1u<<5)
#define	RCC_AHB5ENR_FMCEN_B_0X0					(0x0u<<4)
#define	RCC_AHB5ENR_FMCEN_B_0X1					(0x1u<<4)
#define	RCC_AHB5ENR_JPEGEN_B_0X0				(0x0u<<3)
#define	RCC_AHB5ENR_JPEGEN_B_0X1				(0x1u<<3)
#define	RCC_AHB5ENR_DMA2DEN_B_0X0				(0x0u<<1)
#define	RCC_AHB5ENR_DMA2DEN_B_0X1				(0x1u<<1)
#define	RCC_AHB5ENR_HPDMA1EN_B_0X0				(0x0u<<0)
#define	RCC_AHB5ENR_HPDMA1EN_B_0X1				(0x1u<<0)

// APB1LENR Configuration

