hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
#define	RCC_APB1LENR_UART8EN					(0x1u<<31)
#define	RCC_APB1LENR_UART7EN					(0x1u<<30)
#define	RCC_APB1LENR_I3C2EN						(0x1u<<25)
#define	RCC_APB1LENR_I3C1EN						(0x1u<<24)
#define	RCC_APB1LENR_I2C3EN						(0x1u<<23)
#define	RCC_APB1LENR_I2C2EN						(0x1u<<22)
#define	RCC_APB1LENR_I2C1EN						(0x1u<<21)
#define	RCC_APB1LENR_UART5EN					(0x1u<<20)
#define	RCC_APB1LENR_UART4EN					(0x1u<<19)
#define	RCC_APB1LENR_USART3EN					(0x1u<<18)
#define	RCC_APB1LENR_USART2EN					(0x1u<<17)
#define	RCC_APB1LENR_SPDIFRX1EN					(0x1u<<16)
#define	RCC_APB1LENR_SPI3EN						(0x1u<<15)
#define	RCC_APB1LENR_SPI2EN						(0x1u<<14)
#define	RCC_APB1LENR_TIM11EN					(0x1u<<13)
#define	RCC_APB1LENR_TIM10EN					(0x1u<<12)
#define	RCC_APB1LENR_WWDGEN						(0x1u<<11)
#define	RCC_APB1LENR_LPTIM1EN					(0x1u<<9)
#define	RCC_APB1LENR_TIM14EN					(0x1u<<8)
#define	RCC_APB1LENR_TIM13EN					(0x1u<<7)
#define	RCC_APB1LENR_TIM12EN					(0x1u<<6)
#define	RCC_APB1LENR_TIM7EN						(0x1u<<5)
#define	RCC_APB1LENR_TIM6EN						(0x1u<<4)
#define	RCC_APB1LENR_TIM5EN						(0x1u<<3)
#define	RCC_APB1LENR_TIM4EN						(0x1u<<2)
#define	RCC_APB1LENR_TIM3EN						(0x1u<<1)
#define	RCC_APB1LENR_TIM2EN						(0x1u<<0)

#define	RCC_APB1LENR_UART8EN_B_0X0				(0x0u<<31)
#define	RCC_APB1LENR_UART8EN_B_0X1				(0x1u<<31)
#define	RCC_APB1LENR_UART7EN_B_0X0				(0x0u<<30)
#define	RCC_APB1LENR_UART7EN_B_0X1				(0x1u<<30)
#define	RCC_APB1LENR_I3C2EN_B_0X0				(0x0u<<25)
#define	RCC_APB1LENR_I3C2EN_B_0X1				(0x1u<<25)
#define	RCC_APB1LENR_I3C1EN_B_0X0				(0x0u<<24)
#define	RCC_APB1LENR_I3C1EN_B_0X1				(0x1u<<24)
#define	RCC_APB1LENR_I2C3EN_B_0X0				(0x0u<<23)
#define	RCC_APB1LENR_I2C3EN_B_0X1				(0x1u<<23)
#define	RCC_APB1LENR_I2C2EN_B_0X0				(0x0u<<22)
#define	RCC_APB1LENR_I2C2EN_B_0X1				(0x1u<<22)
#define	RCC_APB1LENR_I2C1EN_B_0X0				(0x0u<<21)
#define	RCC_APB1LENR_I2C1EN_B_0X1				(0x1u<<21)
#define	RCC_APB1LENR_UART5EN_B_0X0				(0x0u<<20)
#define	RCC_APB1LENR_UART5EN_B_0X1				(0x1u<<20)
#define	RCC_APB1LENR_UART4EN_B_0X0				(0x0u<<19)
#define	RCC_APB1LENR_UART4EN_B_0X1				(0x1u<<19)
#define	RCC_APB1LENR_USART3EN_B_0X0				(0x0u<<18)
#define	RCC_APB1LENR_USART3EN_B_0X1				(0x1u<<18)
#define	RCC_APB1LENR_USART2EN_B_0X0				(0x0u<<17)
#define	RCC_APB1LENR_USART2EN_B_0X1				(0x1u<<17)
#define	RCC_APB1LENR_SPDIFRX1EN_B_0X0			(0x0u<<16)
#define	RCC_APB1LENR_SPDIFRX1EN_B_0X1			(0x1u<<16)
#define	RCC_APB1LENR_SPI3EN_B_0X0				(0x0u<<15)
#define	RCC_APB1LENR_SPI3EN_B_0X1				(0x1u<<15)
#define	RCC_APB1LENR_SPI2EN_B_0X0				(0x0u<<14)
#define	RCC_APB1LENR_SPI2EN_B_0X1				(0x1u<<14)
#define	RCC_APB1LENR_TIM11EN_B_0X0				(0x0u<<13)
#define	RCC_APB1LENR_TIM11EN_B_0X1				(0x1u<<13)
#define	RCC_APB1LENR_TIM10EN_B_0X0				(0x0u<<12)
#define	RCC_APB1LENR_TIM10EN_B_0X1				(0x1u<<12)
#define	RCC_APB1LENR_WWDGEN_B_0X0				(0x0u<<11)
#define	RCC_APB1LENR_WWDGEN_B_0X1				(0x1u<<11)
#define	RCC_APB1LENR_LPTIM1EN_B_0X0				(0x0u<<9)
#define	RCC_APB1LENR_LPTIM1EN_B_0X1				(0x1u<<9)
#define	RCC_APB1LENR_TIM14EN_B_0X0				(0x0u<<8)
#define	RCC_APB1LENR_TIM14EN_B_0X1				(0x1u<<8)
#define	RCC_APB1LENR_TIM13EN_B_0X0				(0x0u<<7)
#define	RCC_APB1LENR_TIM13EN_B_0X1				(0x1u<<7)
#define	RCC_APB1LENR_TIM12EN_B_0X0				(0x0u<<6)
#define	RCC_APB1LENR_TIM12EN_B_0X1				(0x1u<<6)
#define	RCC_APB1LENR_TIM7EN_B_0X0				(0x0u<<5)
#define	RCC_APB1LENR_TIM7EN_B_0X1				(0x1u<<5)
#define	RCC_APB1LENR_TIM6EN_B_0X0				(0x0u<<4)
#define	RCC_APB1LENR_TIM6EN_B_0X1				(0x1u<<4)
#define	RCC_APB1LENR_TIM5EN_B_0X0				(0x0u<<3)
#define	RCC_APB1LENR_TIM5EN_B_0X1				(0x1u<<3)
#define	RCC_APB1LENR_TIM4EN_B_0X0				(0x0u<<2)
#define	RCC_APB1LENR_TIM4EN_B_0X1				(0x1u<<2)
#define	RCC_APB1LENR_TIM3EN_B_0X0				(0x0u<<1)
#define	RCC_APB1LENR_TIM3EN_B_0X1				(0x1u<<1)
#define	RCC_APB1LENR_TIM2EN_B_0X0				(0x0u<<0)
#define	RCC_APB1LENR_TIM2EN_B_0X1				(0x1u<<0)

// APB1HENR Configuration

#define	RCC_APB1HENR_UCPD1EN					(0x1u<<18)
#define	RCC_APB1HENR_FDCANEN					(0x1u<<8)
#define	RCC_APB1HENR_MDIOSEN					(0x1u<<5)

#define	RCC_APB1HENR_UCPD1EN_B_0X0				(0x0u<<18)
#define	RCC_APB1HENR_UCPD1EN_B_0X1				(0x1u<<18)
#define	RCC_APB1HENR_FDCANEN_B_0X0				(0x0u<<8)
#define	RCC_APB1HENR_FDCANEN_B_0X1				(0x1u<<8)
#define	RCC_APB1HENR_MDIOSEN_B_0X0				(0x0u<<5)
#define	RCC_APB1HENR_MDIOSEN_B_0X1				(0x1u<<5)

// APB2ENR Configuration

#define	RCC_APB2ENR_SAI2EN						(0x1u<<22)
#define	RCC_APB2ENR_SAI1EN						(0x1u<<21)
#define	RCC_APB2ENR_SPI5EN						(0x1u<<20)
#define	RCC_APB2ENR_TIM9EN						(0x1u<<19)
#define	RCC_APB2ENR_TIM17EN						(0x1u<<18)
#define	RCC_APB2ENR_TIM16EN						(0x1u<<17)
#define	RCC_APB2ENR_TIM15EN						(0x1u<<16)
#define	RCC_APB2ENR_TIM18EN						(0x1u<<15)
#define	RCC_APB2ENR_SPI4EN						(0x1u<<13)
#define	RCC_APB2ENR_SPI1EN						(0x1u<<12)
#define	RCC_APB2ENR_USART10EN					(0x1u<<7)
#define	RCC_APB2ENR_UART9EN						(0x1u<<6)
#define	RCC_APB2ENR_USART6EN					(0x1u<<5)
#define	RCC_APB2ENR_USART1EN					(0x1u<<4)
#define	RCC_APB2ENR_TIM8EN						(0x1u<<1)
#define	RCC_APB2ENR_TIM1EN						(0x1u<<0)

#define	RCC_APB2ENR_SAI2EN_B_0X0				(0x0u<<22)
#define	RCC_APB2ENR_SAI2EN_B_0X1				(0x1u<<22)
#define	RCC_APB2ENR_SAI1EN_B_0X0				(0x0u<<21)
#define	RCC_APB2ENR_SAI1EN_B_0X1				(0x1u<<21)
#define	RCC_APB2ENR_SPI5EN_B_0X0				(0x0u<<20)
#define	RCC_APB2ENR_SPI5EN_B_0X1				(0x1u<<20)
#define	RCC_APB2ENR_TIM9EN_B_0X0				(0x0u<<19)
#define	RCC_APB2ENR_TIM9EN_B_0X1				(0x1u<<19)
#define	RCC_APB2ENR_TIM17EN_B_0X0				(0x0u<<18)
#define	RCC_APB2ENR_TIM17EN_B_0X1				(0x1u<<18)
#define	RCC_APB2ENR_TIM16EN_B_0X0				(0x0u<<17)
#define	RCC_APB2ENR_TIM16EN_B_0X1				(0x1u<<17)
#define	RCC_APB2ENR_TIM15EN_B_0X0				(0x0u<<16)
#define	RCC_APB2ENR_TIM15EN_B_0X1				(0x1u<<16)
#define	RCC_APB2ENR_TIM18EN_B_0X0				(0x0u<<15)
#define	RCC_APB2ENR_TIM18EN_B_0X1				(0x1u<<15)
#define	RCC_APB2ENR_SPI4EN_B_0X0				(0x0u<<13)
#define	RCC_APB2ENR_SPI4EN_B_0X1				(0x1u<<13)
#define	RCC_APB2ENR_SPI1EN_B_0X0				(0x0u<<12)
#define	RCC_APB2ENR_SPI1EN_B_0X1				(0x1u<<12)
#define	RCC_APB2ENR_USART10EN_B_0X0				(0x0u<<7)
#define	RCC_APB2ENR_USART10EN_B_0X1				(0x1u<<7)
#define	RCC_APB2ENR_UART9EN_B_0X0				(0x0u<<6)
#define	RCC_APB2ENR_UART9EN_B_0X1				(0x1u<<6)
#define	RCC_APB2ENR_USART6EN_B_0X0				(0x0u<<5)
#define	RCC_APB2ENR_USART6EN_B_0X1				(0x1u<<5)
#define	RCC_APB2ENR_USART1EN_B_0X0				(0x0u<<4)
#define	RCC_APB2ENR_USART1EN_B_0X1				(0x1u<<4)
#define	RCC_APB2ENR_TIM8EN_B_0X0				(0x0u<<1)
#define	RCC_APB2ENR_TIM8EN_B_0X1				(0x1u<<1)
#define	RCC_APB2ENR_TIM1EN_B_0X0				(0x0u<<0)
#define	RCC_APB2ENR_TIM1EN_B_0X1				(0x1u<<0)

// APB3ENR Configuration

#define	RCC_APB3ENR_DFTEN						(0x1u<<2)

#define	RCC_APB3ENR_DFTEN_B_0X0					(0x0u<<2)
#define	RCC_APB3ENR_DFTEN_B_0X1					(0x1u<<2)

// APB4LENR Configuration

#define	RCC_APB4LENR_SERFEN						(0x1u<<31)
#define	RCC_APB4LENR_R2GNPUEN					(0x1u<<23)
#define	RCC_APB4LENR_R2GRETEN					(0x1u<<22)
#define	RCC_APB4LENR_RTCAPBEN					(0x1u<<17)
#define	RCC_APB4LENR_RTCEN						(0x1u<<16)
#define	RCC_APB4LENR_VREFBUFEN					(0x1u<<15)
#define	RCC_APB4LENR_LPTIM5EN					(0x1u<<12)
#define	RCC_APB4LENR_LPTIM4EN					(0x1u<<11)
#define	RCC_APB4LENR_LPTIM3EN					(0x1u<<10)
#define	RCC_APB4LENR_LPTIM2EN					(0x1u<<9)
#define	RCC_APB4LENR_I2C4EN						(0x1u<<7)
#define	RCC_APB4LENR_SPI6EN						(0x1u<<5)
#define	RCC_APB4LENR_LPUART1EN					(0x1u<<3)
#define	RCC_APB4LENR_HDPEN						(0x1u<<2)

#define	RCC_APB4LENR_SERFEN_B_0X0				(0x0u<<31)
#define	RCC_APB4LENR_SERFEN_B_0X1				(0x1u<<31)
#define	RCC_APB4LENR_R2GNPUEN_B_0X0				(0x0u<<23)
#define	RCC_APB4LENR_R2GNPUEN_B_0X1				(0x1u<<23)
#define	RCC_APB4LENR_R2GRETEN_B_0X0				(0x0u<<22)
#define	RCC_APB4LENR_R2GRETEN_B_0X1				(0x1u<<22)
#define	RCC_APB4LENR_RTCAPBEN_B_0X0				(0x0u<<17)
#define	RCC_APB4LENR_RTCAPBEN_B_0X1				(0x1u<<17)
#define	RCC_APB4LENR_RTCEN_B_0X0				(0x0u<<16)
#define	RCC_APB4LENR_RTCEN_B_0X1				(0x1u<<16)
#define	RCC_APB4LENR_VREFBUFEN_B_0X0			(0x0u<<15)
#define	RCC_APB4LENR_VREFBUFEN_B_0X1			(0x1u<<15)
#define	RCC_APB4LENR_LPTIM5EN_B_0X0				(0x0u<<12)
#define	RCC_APB4LENR_LPTIM5EN_B_0X1				(0x1u<<12)
#define	RCC_APB4LENR_LPTIM4EN_B_0X0				(0x0u<<11)
#define	RCC_APB4LENR_LPTIM4EN_B_0X1				(0x1u<<11)
#define	RCC_APB4LENR_LPTIM3EN_B_0X0				(0x0u<<10)
#define	RCC_APB4LENR_LPTIM3EN_B_0X1				(0x1u<<10)
#define	RCC_APB4LENR_LPTIM2EN_B_0X0				(0x0u<<9)
#define	RCC_APB4LENR_LPTIM2EN_B_0X1				(0x1u<<9)
#define	RCC_APB4LENR_I2C4EN_B_0X0				(0x0u<<7)
#define	RCC_APB4LENR_I2C4EN_B_0X1				(0x1u<<7)
#define	RCC_APB4LENR_SPI6EN_B_0X0				(0x0u<<5)
#define	RCC_APB4LENR_SPI6EN_B_0X1				(0x1u<<5)
#define	RCC_APB4LENR_LPUART1EN_B_0X0			(0x0u<<3)
#define	RCC_APB4LENR_LPUART1EN_B_0X1			(0x1u<<3)
#define	RCC_APB4LENR_HDPEN_B_0X0				(0x0u<<2)
#define	RCC_APB4LENR_HDPEN_B_0X1				(0x1u<<2)

// APB4HENR Configuration

#define	RCC_APB4HENR_BUSPERFMEN					(0x1u<<4)
#define	RCC_APB4HENR_DTSEN						(0x1u<<2)
#define	RCC_APB4HENR_BSECEN						(0x1u<<1)
#define	RCC_APB4HENR_SYSCFGEN					(0x1u<<0)

#define	RCC_APB4HENR_BUSPERFMEN_B_0X0			(0x0u<<4)
#define	RCC_APB4HENR_BUSPERFMEN_B_0X1			(0x1u<<4)
#define	RCC_APB4HENR_DTSEN_B_0X0				(0x0u<<2)
#define	RCC_APB4HENR_DTSEN_B_0X1				(0x1u<<2)
#define	RCC_APB4HENR_BSECEN_B_0X0				(0x0u<<1)
#define	RCC_APB4HENR_BSECEN_B_0X1				(0x1u<<1)
#define	RCC_APB4HENR_SYSCFGEN_B_0X0				(0x0u<<0)
#define	RCC_APB4HENR_SYSCFGEN_B_0X1				(0x1u<<0)

