hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
// APB5ENR Configuration

#define	RCC_APB5ENR_CSIEN						(0x1u<<6)
#define	RCC_APB5ENR_VENCEN						(0x1u<<5)
#define	RCC_APB5ENR_GFXTIMEN					(0x1u<<4)
#define	RCC_APB5ENR_DCMIPPEN					(0x1u<<2)
#define	RCC_APB5ENR_LTDCEN						(0x1u<<1)

#define	RCC_APB5ENR_CSIEN_B_0X0					(0x0u<<6)
#define	RCC_APB5ENR_CSIEN_B_0X1					(0x1u<<6)
#define	RCC_APB5ENR_VENCEN_B_0X0				(0x0u<<5)
#define	RCC_APB5ENR_VENCEN_B_0X1				(0x1u<<5)
#define	RCC_APB5ENR_GFXTIMEN_B_0X0				(0x0u<<4)
#define	RCC_APB5ENR_GFXTIMEN_B_0X1				(0x1u<<4)
#define	RCC_APB5ENR_DCMIPPEN_B_0X0				(0x0u<<2)
#define	RCC_APB5ENR_DCMIPPEN_B_0X1				(0x1u<<2)
#define	RCC_APB5ENR_LTDCEN_B_0X0				(0x0u<<1)
#define	RCC_APB5ENR_LTDCEN_B_0X1				(0x1u<<1)

// DIVLPENR Configuration

#define	RCC_DIVLPENR_IC20LPEN					(0x1u<<19)
#define	RCC_DIVLPENR_IC19LPEN					(0x1u<<18)
#define	RCC_DIVLPENR_IC18LPEN					(0x1u<<17)
#define	RCC_DIVLPENR_IC17LPEN					(0x1u<<16)
#define	RCC_DIVLPENR_IC16LPEN					(0x1u<<15)
#define	RCC_DIVLPENR_IC15LPEN					(0x1u<<14)
#define	RCC_DIVLPENR_IC14LPEN					(0x1u<<13)
#define	RCC_DIVLPENR_IC13LPEN					(0x1u<<12)
#define	RCC_DIVLPENR_IC12LPEN					(0x1u<<11)
#define	RCC_DIVLPENR_IC11LPEN					(0x1u<<10)
#define	RCC_DIVLPENR_IC10LPEN					(0x1u<<9)
#define	RCC_DIVLPENR_IC9LPEN					(0x1u<<8)
#define	RCC_DIVLPENR_IC8LPEN					(0x1u<<7)
#define	RCC_DIVLPENR_IC7LPEN					(0x1u<<6)
#define	RCC_DIVLPENR_IC6LPEN					(0x1u<<5)
#define	RCC_DIVLPENR_IC5LPEN					(0x1u<<4)
#define	RCC_DIVLPENR_IC4LPEN					(0x1u<<3)
#define	RCC_DIVLPENR_IC3LPEN					(0x1u<<2)
#define	RCC_DIVLPENR_IC2LPEN					(0x1u<<1)
#define	RCC_DIVLPENR_IC1LPEN					(0x1u<<0)

#define	RCC_DIVLPENR_IC20LPEN_B_0X0				(0x0u<<19)
#define	RCC_DIVLPENR_IC20LPEN_B_0X1				(0x1u<<19)
#define	RCC_DIVLPENR_IC19LPEN_B_0X0				(0x0u<<18)
#define	RCC_DIVLPENR_IC19LPEN_B_0X1				(0x1u<<18)
#define	RCC_DIVLPENR_IC18LPEN_B_0X0				(0x0u<<17)
#define	RCC_DIVLPENR_IC18LPEN_B_0X1				(0x1u<<17)
#define	RCC_DIVLPENR_IC17LPEN_B_0X0				(0x0u<<16)
#define	RCC_DIVLPENR_IC17LPEN_B_0X1				(0x1u<<16)
#define	RCC_DIVLPENR_IC16LPEN_B_0X0				(0x0u<<15)
#define	RCC_DIVLPENR_IC16LPEN_B_0X1				(0x1u<<15)
#define	RCC_DIVLPENR_IC15LPEN_B_0X0				(0x0u<<14)
#define	RCC_DIVLPENR_IC15LPEN_B_0X1				(0x1u<<14)
#define	RCC_DIVLPENR_IC14LPEN_B_0X0				(0x0u<<13)
#define	RCC_DIVLPENR_IC14LPEN_B_0X1				(0x1u<<13)
#define	RCC_DIVLPENR_IC13LPEN_B_0X0				(0x0u<<12)
#define	RCC_DIVLPENR_IC13LPEN_B_0X1				(0x1u<<12)
#define	RCC_DIVLPENR_IC12LPEN_B_0X0				(0x0u<<11)
#define	RCC_DIVLPENR_IC12LPEN_B_0X1				(0x1u<<11)
#define	RCC_DIVLPENR_IC11LPEN_B_0X0				(0x0u<<10)
#define	RCC_DIVLPENR_IC11LPEN_B_0X1				(0x1u<<10)
#define	RCC_DIVLPENR_IC10LPEN_B_0X0				(0x0u<<9)
#define	RCC_DIVLPENR_IC10LPEN_B_0X1				(0x1u<<9)
#define	RCC_DIVLPENR_IC9LPEN_B_0X0				(0x0u<<8)
#define	RCC_DIVLPENR_IC9LPEN_B_0X1				(0x1u<<8)
#define	RCC_DIVLPENR_IC8LPEN_B_0X0				(0x0u<<7)
#define	RCC_DIVLPENR_IC8LPEN_B_0X1				(0x1u<<7)
#define	RCC_DIVLPENR_IC7LPEN_B_0X0				(0x0u<<6)
#define	RCC_DIVLPENR_IC7LPEN_B_0X1				(0x1u<<6)
#define	RCC_DIVLPENR_IC6LPEN_B_0X0				(0x0u<<5)
#define	RCC_DIVLPENR_IC6LPEN_B_0X1				(0x1u<<5)
#define	RCC_DIVLPENR_IC5LPEN_B_0X0				(0x0u<<4)
#define	RCC_DIVLPENR_IC5LPEN_B_0X1				(0x1u<<4)
#define	RCC_DIVLPENR_IC4LPEN_B_0X0				(0x0u<<3)
#define	RCC_DIVLPENR_IC4LPEN_B_0X1				(0x1u<<3)
#define	RCC_DIVLPENR_IC3LPEN_B_0X0				(0x0u<<2)
#define	RCC_DIVLPENR_IC3LPEN_B_0X1				(0x1u<<2)
#define	RCC_DIVLPENR_IC2LPEN_B_0X0				(0x0u<<1)
#define	RCC_DIVLPENR_IC2LPEN_B_0X1				(0x1u<<1)
#define	RCC_DIVLPENR_IC1LPEN_B_0X0				(0x0u<<0)
#define	RCC_DIVLPENR_IC1LPEN_B_0X1				(0x1u<<0)

// BUSLPENR Configuration

#define	RCC_BUSLPENR_APB5LPEN					(0x1u<<12)
#define	RCC_BUSLPENR_APB4LPEN					(0x1u<<11)
#define	RCC_BUSLPENR_APB3LPEN					(0x1u<<10)
#define	RCC_BUSLPENR_APB2LPEN					(0x1u<<9)
#define	RCC_BUSLPENR_APB1LPEN					(0x1u<<8)
#define	RCC_BUSLPENR_AHB5LPEN					(0x1u<<7)
#define	RCC_BUSLPENR_AHB4LPEN					(0x1u<<6)
#define	RCC_BUSLPENR_AHB3LPEN					(0x1u<<5)
#define	RCC_BUSLPENR_AHB2LPEN					(0x1u<<4)
#define	RCC_BUSLPENR_AHB1LPEN					(0x1u<<3)
#define	RCC_BUSLPENR_AHBMLPEN					(0x1u<<2)
#define	RCC_BUSLPENR_ACLKNCLPEN					(0x1u<<1)
#define	RCC_BUSLPENR_ACLKNLPEN					(0x1u<<0)

#define	RCC_BUSLPENR_APB5LPEN_B_0X0				(0x0u<<12)
#define	RCC_BUSLPENR_APB5LPEN_B_0X1				(0x1u<<12)
#define	RCC_BUSLPENR_APB4LPEN_B_0X0				(0x0u<<11)
#define	RCC_BUSLPENR_APB4LPEN_B_0X1				(0x1u<<11)
#define	RCC_BUSLPENR_APB3LPEN_B_0X0				(0x0u<<10)
#define	RCC_BUSLPENR_APB3LPEN_B_0X1				(0x1u<<10)
#define	RCC_BUSLPENR_APB2LPEN_B_0X0				(0x0u<<9)
#define	RCC_BUSLPENR_APB2LPEN_B_0X1				(0x1u<<9)
#define	RCC_BUSLPENR_APB1LPEN_B_0X0				(0x0u<<8)
#define	RCC_BUSLPENR_APB1LPEN_B_0X1				(0x1u<<8)
#define	RCC_BUSLPENR_AHB5LPEN_B_0X0				(0x0u<<7)
#define	RCC_BUSLPENR_AHB5LPEN_B_0X1				(0x1u<<7)
#define	RCC_BUSLPENR_AHB4LPEN_B_0X0				(0x0u<<6)
#define	RCC_BUSLPENR_AHB4LPEN_B_0X1				(0x1u<<6)
#define	RCC_BUSLPENR_AHB3LPEN_B_0X0				(0x0u<<5)
#define	RCC_BUSLPENR_AHB3LPEN_B_0X1				(0x1u<<5)
#define	RCC_BUSLPENR_AHB2LPEN_B_0X0				(0x0u<<4)
#define	RCC_BUSLPENR_AHB2LPEN_B_0X1				(0x1u<<4)
#define	RCC_BUSLPENR_AHB1LPEN_B_0X0				(0x0u<<3)
#define	RCC_BUSLPENR_AHB1LPEN_B_0X1				(0x1u<<3)
#define	RCC_BUSLPENR_AHBMLPEN_B_0X0				(0x0u<<2)
#define	RCC_BUSLPENR_AHBMLPEN_B_0X1				(0x1u<<2)
#define	RCC_BUSLPENR_ACLKNCLPEN_B_0X0			(0x0u<<1)
#define	RCC_BUSLPENR_ACLKNCLPEN_B_0X1			(0x1u<<1)
#define	RCC_BUSLPENR_ACLKNLPEN_B_0X0			(0x0u<<0)
#define	RCC_BUSLPENR_ACLKNLPEN_B_0X1			(0x1u<<0)

// MISCLPENR Configuration

#define	RCC_MISCLPENR_PERLPEN					(0x1u<<6)
#define	RCC_MISCLPENR_XSPIPHYCOMPLPEN			(0x1u<<3)
#define	RCC_MISCLPENR_DBGLPEN					(0x1u<<0)

#define	RCC_MISCLPENR_PERLPEN_B_0X0				(0x0u<<6)
#define	RCC_MISCLPENR_PERLPEN_B_0X1				(0x1u<<6)
#define	RCC_MISCLPENR_XSPIPHYCOMPLPEN_B_0X0		(0x0u<<3)
#define	RCC_MISCLPENR_XSPIPHYCOMPLPEN_B_0X1		(0x1u<<3)
#define	RCC_MISCLPENR_DBGLPEN_B_0X0				(0x0u<<0)
#define	RCC_MISCLPENR_DBGLPEN_B_0X1				(0x1u<<0)

// MEMLPENR Configuration

#define	RCC_MEMLPENR_BOOTROMLPEN				(0x1u<<12)
#define	RCC_MEMLPENR_VENCRAMLPEN				(0x1u<<11)
#define	RCC_MEMLPENR_NPUCACHERAMLPEN			(0x1u<<10)
#define	RCC_MEMLPENR_FLEXRAMLPEN				(0x1u<<9)
#define	RCC_MEMLPENR_AXISRAM2LPEN				(0x1u<<8)
#define	RCC_MEMLPENR_AXISRAM1LPEN				(0x1u<<7)
#define	RCC_MEMLPENR_BKPSRAMLPEN				(0x1u<<6)
#define	RCC_MEMLPENR_AHBSRAM2LPEN				(0x1u<<5)
#define	RCC_MEMLPENR_AHBSRAM1LPEN				(0x1u<<4)
#define	RCC_MEMLPENR_AXISRAM6LPEN				(0x1u<<3)
#define	RCC_MEMLPENR_AXISRAM5LPEN				(0x1u<<2)
#define	RCC_MEMLPENR_AXISRAM4LPEN				(0x1u<<1)
#define	RCC_MEMLPENR_AXISRAM3LPEN				(0x1u<<0)

#define	RCC_MEMLPENR_BOOTROMLPEN_B_0X0			(0x0u<<12)
#define	RCC_MEMLPENR_BOOTROMLPEN_B_0X1			(0x1u<<12)
#define	RCC_MEMLPENR_VENCRAMLPEN_B_0X0			(0x0u<<11)
#define	RCC_MEMLPENR_VENCRAMLPEN_B_0X1			(0x1u<<11)
#define	RCC_MEMLPENR_NPUCACHERAMLPEN_B_0X0		(0x0u<<10)
#define	RCC_MEMLPENR_NPUCACHERAMLPEN_B_0X1		(0x1u<<10)
#define	RCC_MEMLPENR_FLEXRAMLPEN_B_0X0			(0x0u<<9)
#define	RCC_MEMLPENR_FLEXRAMLPEN_B_0X1			(0x1u<<9)
#define	RCC_MEMLPENR_AXISRAM2LPEN_B_0X0			(0x0u<<8)
#define	RCC_MEMLPENR_AXISRAM2LPEN_B_0X1			(0x1u<<8)
#define	RCC_MEMLPENR_AXISRAM1LPEN_B_0X0			(0x0u<<7)
#define	RCC_MEMLPENR_AXISRAM1LPEN_B_0X1			(0x1u<<7)
#define	RCC_MEMLPENR_BKPSRAMLPEN_B_0X0			(0x0u<<6)
#define	RCC_MEMLPENR_BKPSRAMLPEN_B_0X1			(0x1u<<6)
#define	RCC_MEMLPENR_AHBSRAM2LPEN_B_0X0			(0x0u<<5)
#define	RCC_MEMLPENR_AHBSRAM2LPEN_B_0X1			(0x1u<<5)
#define	RCC_MEMLPENR_AHBSRAM1LPEN_B_0X0			(0x0u<<4)
#define	RCC_MEMLPENR_AHBSRAM1LPEN_B_0X1			(0x1u<<4)
#define	RCC_MEMLPENR_AXISRAM6LPEN_B_0X0			(0x0u<<3)
#define	RCC_MEMLPENR_AXISRAM6LPEN_B_0X1			(0x1u<<3)
#define	RCC_MEMLPENR_AXISRAM5LPEN_B_0X0			(0x0u<<2)
#define	RCC_MEMLPENR_AXISRAM5LPEN_B_0X1			(0x1u<<2)
#define	RCC_MEMLPENR_AXISRAM4LPEN_B_0X0			(0x0u<<1)
#define	RCC_MEMLPENR_AXISRAM4LPEN_B_0X1			(0x1u<<1)
#define	RCC_MEMLPENR_AXISRAM3LPEN_B_0X0			(0x0u<<0)
#define	RCC_MEMLPENR_AXISRAM3LPEN_B_0X1			(0x1u<<0)

// AHB1LPENR Configuration

#define	RCC_AHB1LPENR_ADC12LPEN					(0x1u<<5)
#define	RCC_AHB1LPENR_GPDMA1LPEN				(0x1u<<4)

#define	RCC_AHB1LPENR_ADC12LPEN_B_0X0			(0x0u<<5)
#define	RCC_AHB1LPENR_ADC12LPEN_B_0X1			(0x1u<<5)
#define	RCC_AHB1LPENR_GPDMA1LPEN_B_0X0			(0x0u<<4)
#define	RCC_AHB1LPENR_GPDMA1LPEN_B_0X1			(0x1u<<4)

