hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
// AHB2LPENR Configuration

#define	RCC_AHB2LPENR_ADF1LPEN					(0x1u<<17)
#define	RCC_AHB2LPENR_MDF1LPEN					(0x1u<<16)
#define	RCC_AHB2LPENR_RAMCFGLPEN				(0x1u<<12)

#define	RCC_AHB2LPENR_ADF1LPEN_B_0X0			(0x0u<<17)
#define	RCC_AHB2LPENR_ADF1LPEN_B_0X1			(0x1u<<17)
#define	RCC_AHB2LPENR_MDF1LPEN_B_0X0			(0x0u<<16)
#define	RCC_AHB2LPENR_MDF1LPEN_B_0X1			(0x1u<<16)
#define	RCC_AHB2LPENR_RAMCFGLPEN_B_0X0			(0x0u<<12)
#define	RCC_AHB2LPENR_RAMCFGLPEN_B_0X1			(0x1u<<12)

// AHB3LPENR Configuration

#define	RCC_AHB3LPENR_RISAFLPEN					(0x1u<<14)
#define	RCC_AHB3LPENR_IACLPEN					(0x1u<<10)
#define	RCC_AHB3LPENR_RIFSCLPEN					(0x1u<<9)
#define	RCC_AHB3LPENR_PKALPEN					(0x1u<<8)
#define	RCC_AHB3LPENR_SAESLPEN					(0x1u<<4)
#define	RCC_AHB3LPENR_CRYPLPEN					(0x1u<<2)
#define	RCC_AHB3LPENR_HASHLPEN					(0x1u<<1)
#define	RCC_AHB3LPENR_RNGLPEN					(0x1u<<0)

#define	RCC_AHB3LPENR_RISAFLPEN_B_0X0			(0x0u<<14)
#define	RCC_AHB3LPENR_RISAFLPEN_B_0X1			(0x1u<<14)
#define	RCC_AHB3LPENR_IACLPEN_B_0X0				(0x0u<<10)
#define	RCC_AHB3LPENR_IACLPEN_B_0X1				(0x1u<<10)
#define	RCC_AHB3LPENR_RIFSCLPEN_B_0X0			(0x0u<<9)
#define	RCC_AHB3LPENR_RIFSCLPEN_B_0X1			(0x1u<<9)
#define	RCC_AHB3LPENR_PKALPEN_B_0X0				(0x0u<<8)
#define	RCC_AHB3LPENR_PKALPEN_B_0X1				(0x1u<<8)
#define	RCC_AHB3LPENR_SAESLPEN_B_0X0			(0x0u<<4)
#define	RCC_AHB3LPENR_SAESLPEN_B_0X1			(0x1u<<4)
#define	RCC_AHB3LPENR_CRYPLPEN_B_0X0			(0x0u<<2)
#define	RCC_AHB3LPENR_CRYPLPEN_B_0X1			(0x1u<<2)
#define	RCC_AHB3LPENR_HASHLPEN_B_0X0			(0x0u<<1)
#define	RCC_AHB3LPENR_HASHLPEN_B_0X1			(0x1u<<1)
#define	RCC_AHB3LPENR_RNGLPEN_B_0X0				(0x0u<<0)
#define	RCC_AHB3LPENR_RNGLPEN_B_0X1				(0x1u<<0)

// AHB4LPENR Configuration

#define	RCC_AHB4LPENR_CRCLPEN					(0x1u<<19)
#define	RCC_AHB4LPENR_PWRLPEN					(0x1u<<18)
#define	RCC_AHB4LPENR_GPIOQLPEN					(0x1u<<16)
#define	RCC_AHB4LPENR_GPIOPLPEN					(0x1u<<15)
#define	RCC_AHB4LPENR_GPIOOLPEN					(0x1u<<14)
#define	RCC_AHB4LPENR_GPIONLPEN					(0x1u<<13)
#define	RCC_AHB4LPENR_GPIOHLPEN					(0x1u<<7)
#define	RCC_AHB4LPENR_GPIOGLPEN					(0x1u<<6)
#define	RCC_AHB4LPENR_GPIOFLPEN					(0x1u<<5)
#define	RCC_AHB4LPENR_GPIOELPEN					(0x1u<<4)
#define	RCC_AHB4LPENR_GPIODLPEN					(0x1u<<3)
#define	RCC_AHB4LPENR_GPIOCLPEN					(0x1u<<2)
#define	RCC_AHB4LPENR_GPIOBLPEN					(0x1u<<1)
#define	RCC_AHB4LPENR_GPIOALPEN					(0x1u<<0)

#define	RCC_AHB4LPENR_CRCLPEN_B_0X0				(0x0u<<19)
#define	RCC_AHB4LPENR_CRCLPEN_B_0X1				(0x1u<<19)
#define	RCC_AHB4LPENR_PWRLPEN_B_0X0				(0x0u<<18)
#define	RCC_AHB4LPENR_PWRLPEN_B_0X1				(0x1u<<18)
#define	RCC_AHB4LPENR_GPIOQLPEN_B_0X0			(0x0u<<16)
#define	RCC_AHB4LPENR_GPIOQLPEN_B_0X1			(0x1u<<16)
#define	RCC_AHB4LPENR_GPIOPLPEN_B_0X0			(0x0u<<15)
#define	RCC_AHB4LPENR_GPIOPLPEN_B_0X1			(0x1u<<15)
#define	RCC_AHB4LPENR_GPIOOLPEN_B_0X0			(0x0u<<14)
#define	RCC_AHB4LPENR_GPIOOLPEN_B_0X1			(0x1u<<14)
#define	RCC_AHB4LPENR_GPIONLPEN_B_0X0			(0x0u<<13)
#define	RCC_AHB4LPENR_GPIONLPEN_B_0X1			(0x1u<<13)
#define	RCC_AHB4LPENR_GPIOHLPEN_B_0X0			(0x0u<<7)
#define	RCC_AHB4LPENR_GPIOHLPEN_B_0X1			(0x1u<<7)
#define	RCC_AHB4LPENR_GPIOGLPEN_B_0X0			(0x0u<<6)
#define	RCC_AHB4LPENR_GPIOGLPEN_B_0X1			(0x1u<<6)
#define	RCC_AHB4LPENR_GPIOFLPEN_B_0X0			(0x0u<<5)
#define	RCC_AHB4LPENR_GPIOFLPEN_B_0X1			(0x1u<<5)
#define	RCC_AHB4LPENR_GPIOELPEN_B_0X0			(0x0u<<4)
#define	RCC_AHB4LPENR_GPIOELPEN_B_0X1			(0x1u<<4)
#define	RCC_AHB4LPENR_GPIODLPEN_B_0X0			(0x0u<<3)
#define	RCC_AHB4LPENR_GPIODLPEN_B_0X1			(0x1u<<3)
#define	RCC_AHB4LPENR_GPIOCLPEN_B_0X0			(0x0u<<2)
#define	RCC_AHB4LPENR_GPIOCLPEN_B_0X1			(0x1u<<2)
#define	RCC_AHB4LPENR_GPIOBLPEN_B_0X0			(0x0u<<1)
#define	RCC_AHB4LPENR_GPIOBLPEN_B_0X1			(0x1u<<1)
#define	RCC_AHB4LPENR_GPIOALPEN_B_0X0			(0x0u<<0)
#define	RCC_AHB4LPENR_GPIOALPEN_B_0X1			(0x1u<<0)

// AHB5LPENR Configuration

#define	RCC_AHB5LPENR_NPULPEN					(0x1u<<31)
#define	RCC_AHB5LPENR_NPUCACHELPEN				(0x1u<<30)
#define	RCC_AHB5LPENR_OTG2LPEN					(0x1u<<29)
#define	RCC_AHB5LPENR_OTGPHY2LPEN				(0x1u<<28)
#define	RCC_AHB5LPENR_OTGPHY1LPEN				(0x1u<<27)
#define	RCC_AHB5LPENR_OTG1LPEN					(0x1u<<26)
#define	RCC_AHB5LPENR_ETH1LPEN					(0x1u<<25)
#define	RCC_AHB5LPENR_ETH1RXLPEN				(0x1u<<24)
#define	RCC_AHB5LPENR_ETH1TXLPEN				(0x1u<<23)
#define	RCC_AHB5LPENR_ETH1MACLPEN				(0x1u<<22)
#define	RCC_AHB5LPENR_GPULPEN					(0x1u<<20)
#define	RCC_AHB5LPENR_GFXMMULPEN				(0x1u<<19)
#define	RCC_AHB5LPENR_MCE4LPEN					(0x1u<<18)
#define	RCC_AHB5LPENR_XSPI3LPEN					(0x1u<<17)
#define	RCC_AHB5LPENR_MCE3LPEN					(0x1u<<16)
#define	RCC_AHB5LPENR_MCE2LPEN					(0x1u<<15)
#define	RCC_AHB5LPENR_MCE1LPEN					(0x1u<<14)
#define	RCC_AHB5LPENR_XSPIMLPEN					(0x1u<<13)
#define	RCC_AHB5LPENR_XSPI2LPEN					(0x1u<<12)
#define	RCC_AHB5LPENR_SDMMC1LPEN				(0x1u<<8)
#define	RCC_AHB5LPENR_SDMMC2LPEN				(0x1u<<7)
#define	RCC_AHB5LPENR_PSSILPEN					(0x1u<<6)
#define	RCC_AHB5LPENR_XSPI1LPEN					(0x1u<<5)
#define	RCC_AHB5LPENR_FMCLPEN					(0x1u<<4)
#define	RCC_AHB5LPENR_JPEGLPEN					(0x1u<<3)
#define	RCC_AHB5LPENR_DMA2DLPEN					(0x1u<<1)
#define	RCC_AHB5LPENR_HPDMA1LPEN				(0x1u<<0)

#define	RCC_AHB5LPENR_NPULPEN_B_0X0				(0x0u<<31)
#define	RCC_AHB5LPENR_NPULPEN_B_0X1				(0x1u<<31)
#define	RCC_AHB5LPENR_NPUCACHELPEN_B_0X0		(0x0u<<30)
#define	RCC_AHB5LPENR_NPUCACHELPEN_B_0X1		(0x1u<<30)
#define	RCC_AHB5LPENR_OTG2LPEN_B_0X0			(0x0u<<29)
#define	RCC_AHB5LPENR_OTG2LPEN_B_0X1			(0x1u<<29)
#define	RCC_AHB5LPENR_OTGPHY2LPEN_B_0X0			(0x0u<<28)
#define	RCC_AHB5LPENR_OTGPHY2LPEN_B_0X1			(0x1u<<28)
#define	RCC_AHB5LPENR_OTGPHY1LPEN_B_0X0			(0x0u<<27)
#define	RCC_AHB5LPENR_OTGPHY1LPEN_B_0X1			(0x1u<<27)
#define	RCC_AHB5LPENR_OTG1LPEN_B_0X0			(0x0u<<26)
#define	RCC_AHB5LPENR_OTG1LPEN_B_0X1			(0x1u<<26)
#define	RCC_AHB5LPENR_ETH1LPEN_B_0X0			(0x0u<<25)
#define	RCC_AHB5LPENR_ETH1LPEN_B_0X1			(0x1u<<25)
#define	RCC_AHB5LPENR_ETH1RXLPEN_B_0X0			(0x0u<<24)
#define	RCC_AHB5LPENR_ETH1RXLPEN_B_0X1			(0x1u<<24)
#define	RCC_AHB5LPENR_ETH1TXLPEN_B_0X0			(0x0u<<23)
#define	RCC_AHB5LPENR_ETH1TXLPEN_B_0X1			(0x1u<<23)
#define	RCC_AHB5LPENR_ETH1MACLPEN_B_0X0			(0x0u<<22)
#define	RCC_AHB5LPENR_ETH1MACLPEN_B_0X1			(0x1u<<22)
#define	RCC_AHB5LPENR_GPULPEN_B_0X0				(0x0u<<20)
#define	RCC_AHB5LPENR_GPULPEN_B_0X1				(0x1u<<20)
#define	RCC_AHB5LPENR_GFXMMULPEN_B_0X0			(0x0u<<19)
#define	RCC_AHB5LPENR_GFXMMULPEN_B_0X1			(0x1u<<19)
#define	RCC_AHB5LPENR_MCE4LPEN_B_0X0			(0x0u<<18)
#define	RCC_AHB5LPENR_MCE4LPEN_B_0X1			(0x1u<<18)
#define	RCC_AHB5LPENR_XSPI3LPEN_B_0X0			(0x0u<<17)
#define	RCC_AHB5LPENR_XSPI3LPEN_B_0X1			(0x1u<<17)
#define	RCC_AHB5LPENR_MCE3LPEN_B_0X0			(0x0u<<16)
#define	RCC_AHB5LPENR_MCE3LPEN_B_0X1			(0x1u<<16)
#define	RCC_AHB5LPENR_MCE2LPEN_B_0X0			(0x0u<<15)
#define	RCC_AHB5LPENR_MCE2LPEN_B_0X1			(0x1u<<15)
#define	RCC_AHB5LPENR_MCE1LPEN_B_0X0			(0x0u<<14)
#define	RCC_AHB5LPENR_MCE1LPEN_B_0X1			(0x1u<<14)
#define	RCC_AHB5LPENR_XSPIMLPEN_B_0X0			(0x0u<<13)
#define	RCC_AHB5LPENR_XSPIMLPEN_B_0X1			(0x1u<<13)
#define	RCC_AHB5LPENR_XSPI2LPEN_B_0X0			(0x0u<<12)
#define	RCC_AHB5LPENR_XSPI2LPEN_B_0X1			(0x1u<<12)
#define	RCC_AHB5LPENR_SDMMC1LPEN_B_0X0			(0x0u<<8)
#define	RCC_AHB5LPENR_SDMMC1LPEN_B_0X1			(0x1u<<8)
#define	RCC_AHB5LPENR_SDMMC2LPEN_B_0X0			(0x0u<<7)
#define	RCC_AHB5LPENR_SDMMC2LPEN_B_0X1			(0x1u<<7)
#define	RCC_AHB5LPENR_PSSILPEN_B_0X0			(0x0u<<6)
#define	RCC_AHB5LPENR_PSSILPEN_B_0X1			(0x1u<<6)
#define	RCC_AHB5LPENR_XSPI1LPEN_B_0X0			(0x0u<<5)
#define	RCC_AHB5LPENR_XSPI1LPEN_B_0X1			(0x1u<<5)
#define	RCC_AHB5LPENR_FMCLPEN_B_0X0				(0x0u<<4)
#define	RCC_AHB5LPENR_FMCLPEN_B_0X1				(0x1u<<4)
#define	RCC_AHB5LPENR_JPEGLPEN_B_0X0			(0x0u<<3)
#define	RCC_AHB5LPENR_JPEGLPEN_B_0X1			(0x1u<<3)
#define	RCC_AHB5LPENR_DMA2DLPEN_B_0X0			(0x0u<<1)
#define	RCC_AHB5LPENR_DMA2DLPEN_B_0X1			(0x1u<<1)
#define	RCC_AHB5LPENR_HPDMA1LPEN_B_0X0			(0x0u<<0)
#define	RCC_AHB5LPENR_HPDMA1LPEN_B_0X1			(0x1u<<0)

// APB1LLPENR Configuration

#define	RCC_APB1LLPENR_UART8LPEN				(0x1u<<31)
#define	RCC_APB1LLPENR_UART7LPEN				(0x1u<<30)
#define	RCC_APB1LLPENR_I3C2LPEN					(0x1u<<25)
#define	RCC_APB1LLPENR_I3C1LPEN					(0x1u<<24)
#define	RCC_APB1LLPENR_I2C3LPEN					(0x1u<<23)
#define	RCC_APB1LLPENR_I2C2LPEN					(0x1u<<22)
#define	RCC_APB1LLPENR_I2C1LPEN					(0x1u<<21)
#define	RCC_APB1LLPENR_UART5LPEN				(0x1u<<20)
#define	RCC_APB1LLPENR_UART4LPEN				(0x1u<<19)
#define	RCC_APB1LLPENR_USART3LPEN				(0x1u<<18)
#define	RCC_APB1LLPENR_USART2LPEN				(0x1u<<17)
#define	RCC_APB1LLPENR_SPDIFRX1LPEN				(0x1u<<16)
#define	RCC_APB1LLPENR_SPI3LPEN					(0x1u<<15)
#define	RCC_APB1LLPENR_SPI2LPEN					(0x1u<<14)
#define	RCC_APB1LLPENR_TIM11LPEN				(0x1u<<13)
#define	RCC_APB1LLPENR_TIM10LPEN				(0x1u<<12)
#define	RCC_APB1LLPENR_WWDGLPEN					(0x1u<<11)
#define	RCC_APB1LLPENR_LPTIM1LPEN				(0x1u<<9)
#define	RCC_APB1LLPENR_TIM14LPEN				(0x1u<<8)
#define	RCC_APB1LLPENR_TIM13LPEN				(0x1u<<7)
#define	RCC_APB1LLPENR_TIM12LPEN				(0x1u<<6)
#define	RCC_APB1LLPENR_TIM7LPEN					(0x1u<<5)
#define	RCC_APB1LLPENR_TIM6LPEN					(0x1u<<4)
#define	RCC_APB1LLPENR_TIM5LPEN					(0x1u<<3)
#define	RCC_APB1LLPENR_TIM4LPEN					(0x1u<<2)
#define	RCC_APB1LLPENR_TIM3LPEN					(0x1u<<1)
#define	RCC_APB1LLPENR_TIM2LPEN					(0x1u<<0)

