hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
#define	RCC_APB1LLPENR_UART8LPEN_B_0X0			(0x0u<<31)
#define	RCC_APB1LLPENR_UART8LPEN_B_0X1			(0x1u<<31)
#define	RCC_APB1LLPENR_UART7LPEN_B_0X0			(0x0u<<30)
#define	RCC_APB1LLPENR_UART7LPEN_B_0X1			(0x1u<<30)
#define	RCC_APB1LLPENR_I3C2LPEN_B_0X0			(0x0u<<25)
#define	RCC_APB1LLPENR_I3C2LPEN_B_0X1			(0x1u<<25)
#define	RCC_APB1LLPENR_I3C1LPEN_B_0X0			(0x0u<<24)
#define	RCC_APB1LLPENR_I3C1LPEN_B_0X1			(0x1u<<24)
#define	RCC_APB1LLPENR_I2C3LPEN_B_0X0			(0x0u<<23)
#define	RCC_APB1LLPENR_I2C3LPEN_B_0X1			(0x1u<<23)
#define	RCC_APB1LLPENR_I2C2LPEN_B_0X0			(0x0u<<22)
#define	RCC_APB1LLPENR_I2C2LPEN_B_0X1			(0x1u<<22)
#define	RCC_APB1LLPENR_I2C1LPEN_B_0X0			(0x0u<<21)
#define	RCC_APB1LLPENR_I2C1LPEN_B_0X1			(0x1u<<21)
#define	RCC_APB1LLPENR_UART5LPEN_B_0X0			(0x0u<<20)
#define	RCC_APB1LLPENR_UART5LPEN_B_0X1			(0x1u<<20)
#define	RCC_APB1LLPENR_UART4LPEN_B_0X0			(0x0u<<19)
#define	RCC_APB1LLPENR_UART4LPEN_B_0X1			(0x1u<<19)
#define	RCC_APB1LLPENR_USART3LPEN_B_0X0			(0x0u<<18)
#define	RCC_APB1LLPENR_USART3LPEN_B_0X1			(0x1u<<18)
#define	RCC_APB1LLPENR_USART2LPEN_B_0X0			(0x0u<<17)
#define	RCC_APB1LLPENR_USART2LPEN_B_0X1			(0x1u<<17)
#define	RCC_APB1LLPENR_SPDIFRX1LPEN_B_0X0		(0x0u<<16)
#define	RCC_APB1LLPENR_SPDIFRX1LPEN_B_0X1		(0x1u<<16)
#define	RCC_APB1LLPENR_SPI3LPEN_B_0X0			(0x0u<<15)
#define	RCC_APB1LLPENR_SPI3LPEN_B_0X1			(0x1u<<15)
#define	RCC_APB1LLPENR_SPI2LPEN_B_0X0			(0x0u<<14)
#define	RCC_APB1LLPENR_SPI2LPEN_B_0X1			(0x1u<<14)
#define	RCC_APB1LLPENR_TIM11LPEN_B_0X0			(0x0u<<13)
#define	RCC_APB1LLPENR_TIM11LPEN_B_0X1			(0x1u<<13)
#define	RCC_APB1LLPENR_TIM10LPEN_B_0X0			(0x0u<<12)
#define	RCC_APB1LLPENR_TIM10LPEN_B_0X1			(0x1u<<12)
#define	RCC_APB1LLPENR_WWDGLPEN_B_0X0			(0x0u<<11)
#define	RCC_APB1LLPENR_WWDGLPEN_B_0X1			(0x1u<<11)
#define	RCC_APB1LLPENR_LPTIM1LPEN_B_0X0			(0x0u<<9)
#define	RCC_APB1LLPENR_LPTIM1LPEN_B_0X1			(0x1u<<9)
#define	RCC_APB1LLPENR_TIM14LPEN_B_0X0			(0x0u<<8)
#define	RCC_APB1LLPENR_TIM14LPEN_B_0X1			(0x1u<<8)
#define	RCC_APB1LLPENR_TIM13LPEN_B_0X0			(0x0u<<7)
#define	RCC_APB1LLPENR_TIM13LPEN_B_0X1			(0x1u<<7)
#define	RCC_APB1LLPENR_TIM12LPEN_B_0X0			(0x0u<<6)
#define	RCC_APB1LLPENR_TIM12LPEN_B_0X1			(0x1u<<6)
#define	RCC_APB1LLPENR_TIM7LPEN_B_0X0			(0x0u<<5)
#define	RCC_APB1LLPENR_TIM7LPEN_B_0X1			(0x1u<<5)
#define	RCC_APB1LLPENR_TIM6LPEN_B_0X0			(0x0u<<4)
#define	RCC_APB1LLPENR_TIM6LPEN_B_0X1			(0x1u<<4)
#define	RCC_APB1LLPENR_TIM5LPEN_B_0X0			(0x0u<<3)
#define	RCC_APB1LLPENR_TIM5LPEN_B_0X1			(0x1u<<3)
#define	RCC_APB1LLPENR_TIM4LPEN_B_0X0			(0x0u<<2)
#define	RCC_APB1LLPENR_TIM4LPEN_B_0X1			(0x1u<<2)
#define	RCC_APB1LLPENR_TIM3LPEN_B_0X0			(0x0u<<1)
#define	RCC_APB1LLPENR_TIM3LPEN_B_0X1			(0x1u<<1)
#define	RCC_APB1LLPENR_TIM2LPEN_B_0X0			(0x0u<<0)
#define	RCC_APB1LLPENR_TIM2LPEN_B_0X1			(0x1u<<0)

// APB1HLPENR Configuration

#define	RCC_APB1HLPENR_UCPD1LPEN				(0x1u<<18)
#define	RCC_APB1HLPENR_FDCANLPEN				(0x1u<<8)
#define	RCC_APB1HLPENR_MDIOSLPEN				(0x1u<<5)

#define	RCC_APB1HLPENR_UCPD1LPEN_B_0X0			(0x0u<<18)
#define	RCC_APB1HLPENR_UCPD1LPEN_B_0X1			(0x1u<<18)
#define	RCC_APB1HLPENR_FDCANLPEN_B_0X0			(0x0u<<8)
#define	RCC_APB1HLPENR_FDCANLPEN_B_0X1			(0x1u<<8)
#define	RCC_APB1HLPENR_MDIOSLPEN_B_0X0			(0x0u<<5)
#define	RCC_APB1HLPENR_MDIOSLPEN_B_0X1			(0x1u<<5)

// APB2LPENR Configuration

#define	RCC_APB2LPENR_SAI2LPEN					(0x1u<<22)
#define	RCC_APB2LPENR_SAI1LPEN					(0x1u<<21)
#define	RCC_APB2LPENR_SPI5LPEN					(0x1u<<20)
#define	RCC_APB2LPENR_TIM9LPEN					(0x1u<<19)
#define	RCC_APB2LPENR_TIM17LPEN					(0x1u<<18)
#define	RCC_APB2LPENR_TIM16LPEN					(0x1u<<17)
#define	RCC_APB2LPENR_TIM15LPEN					(0x1u<<16)
#define	RCC_APB2LPENR_TIM18LPEN					(0x1u<<15)
#define	RCC_APB2LPENR_SPI4LPEN					(0x1u<<13)
#define	RCC_APB2LPENR_SPI1LPEN					(0x1u<<12)
#define	RCC_APB2LPENR_USART10LPEN				(0x1u<<7)
#define	RCC_APB2LPENR_UART9LPEN					(0x1u<<6)
#define	RCC_APB2LPENR_USART6LPEN				(0x1u<<5)
#define	RCC_APB2LPENR_USART1LPEN				(0x1u<<4)
#define	RCC_APB2LPENR_TIM8LPEN					(0x1u<<1)
#define	RCC_APB2LPENR_TIM1LPEN					(0x1u<<0)

#define	RCC_APB2LPENR_SAI2LPEN_B_0X0			(0x0u<<22)
#define	RCC_APB2LPENR_SAI2LPEN_B_0X1			(0x1u<<22)
#define	RCC_APB2LPENR_SAI1LPEN_B_0X0			(0x0u<<21)
#define	RCC_APB2LPENR_SAI1LPEN_B_0X1			(0x1u<<21)
#define	RCC_APB2LPENR_SPI5LPEN_B_0X0			(0x0u<<20)
#define	RCC_APB2LPENR_SPI5LPEN_B_0X1			(0x1u<<20)
#define	RCC_APB2LPENR_TIM9LPEN_B_0X0			(0x0u<<19)
#define	RCC_APB2LPENR_TIM9LPEN_B_0X1			(0x1u<<19)
#define	RCC_APB2LPENR_TIM17LPEN_B_0X0			(0x0u<<18)
#define	RCC_APB2LPENR_TIM17LPEN_B_0X1			(0x1u<<18)
#define	RCC_APB2LPENR_TIM16LPEN_B_0X0			(0x0u<<17)
#define	RCC_APB2LPENR_TIM16LPEN_B_0X1			(0x1u<<17)
#define	RCC_APB2LPENR_TIM15LPEN_B_0X0			(0x0u<<16)
#define	RCC_APB2LPENR_TIM15LPEN_B_0X1			(0x1u<<16)
#define	RCC_APB2LPENR_TIM18LPEN_B_0X0			(0x0u<<15)
#define	RCC_APB2LPENR_TIM18LPEN_B_0X1			(0x1u<<15)
#define	RCC_APB2LPENR_SPI4LPEN_B_0X0			(0x0u<<13)
#define	RCC_APB2LPENR_SPI4LPEN_B_0X1			(0x1u<<13)
#define	RCC_APB2LPENR_SPI1LPEN_B_0X0			(0x0u<<12)
#define	RCC_APB2LPENR_SPI1LPEN_B_0X1			(0x1u<<12)
#define	RCC_APB2LPENR_USART10LPEN_B_0X0			(0x0u<<7)
#define	RCC_APB2LPENR_USART10LPEN_B_0X1			(0x1u<<7)
#define	RCC_APB2LPENR_UART9LPEN_B_0X0			(0x0u<<6)
#define	RCC_APB2LPENR_UART9LPEN_B_0X1			(0x1u<<6)
#define	RCC_APB2LPENR_USART6LPEN_B_0X0			(0x0u<<5)
#define	RCC_APB2LPENR_USART6LPEN_B_0X1			(0x1u<<5)
#define	RCC_APB2LPENR_USART1LPEN_B_0X0			(0x0u<<4)
#define	RCC_APB2LPENR_USART1LPEN_B_0X1			(0x1u<<4)
#define	RCC_APB2LPENR_TIM8LPEN_B_0X0			(0x0u<<1)
#define	RCC_APB2LPENR_TIM8LPEN_B_0X1			(0x1u<<1)
#define	RCC_APB2LPENR_TIM1LPEN_B_0X0			(0x0u<<0)
#define	RCC_APB2LPENR_TIM1LPEN_B_0X1			(0x1u<<0)

// APB3LPENR Configuration

#define	RCC_APB3LPENR_DFTLPEN					(0x1u<<2)

#define	RCC_APB3LPENR_DFTLPEN_B_0X0				(0x0u<<2)
#define	RCC_APB3LPENR_DFTLPEN_B_0X1				(0x1u<<2)

// APB4LLPENR Configuration

#define	RCC_APB4LLPENR_SERFLPEN					(0x1u<<31)
#define	RCC_APB4LLPENR_R2GNPULPEN				(0x1u<<23)
#define	RCC_APB4LLPENR_R2GRETLPEN				(0x1u<<22)
#define	RCC_APB4LLPENR_RTCAPBLPEN				(0x1u<<17)
#define	RCC_APB4LLPENR_RTCLPEN					(0x1u<<16)
#define	RCC_APB4LLPENR_VREFBUFLPEN				(0x1u<<15)
#define	RCC_APB4LLPENR_LPTIM5LPEN				(0x1u<<12)
#define	RCC_APB4LLPENR_LPTIM4LPEN				(0x1u<<11)
#define	RCC_APB4LLPENR_LPTIM3LPEN				(0x1u<<10)
#define	RCC_APB4LLPENR_LPTIM2LPEN				(0x1u<<9)
#define	RCC_APB4LLPENR_I2C4LPEN					(0x1u<<7)
#define	RCC_APB4LLPENR_SPI6LPEN					(0x1u<<5)
#define	RCC_APB4LLPENR_LPUART1LPEN				(0x1u<<3)
#define	RCC_APB4LLPENR_HDPLPEN					(0x1u<<2)

