hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
#define	RCC_APB4LLPENR_SERFLPEN_B_0X0			(0x0u<<31)
#define	RCC_APB4LLPENR_SERFLPEN_B_0X1			(0x1u<<31)
#define	RCC_APB4LLPENR_R2GNPULPEN_B_0X0			(0x0u<<23)
#define	RCC_APB4LLPENR_R2GNPULPEN_B_0X1			(0x1u<<23)
#define	RCC_APB4LLPENR_R2GRETLPEN_B_0X0			(0x0u<<22)
#define	RCC_APB4LLPENR_R2GRETLPEN_B_0X1			(0x1u<<22)
#define	RCC_APB4LLPENR_RTCAPBLPEN_B_0X0			(0x0u<<17)
#define	RCC_APB4LLPENR_RTCAPBLPEN_B_0X1			(0x1u<<17)
#define	RCC_APB4LLPENR_RTCLPEN_B_0X0			(0x0u<<16)
#define	RCC_APB4LLPENR_RTCLPEN_B_0X1			(0x1u<<16)
#define	RCC_APB4LLPENR_VREFBUFLPEN_B_0X0		(0x0u<<15)
#define	RCC_APB4LLPENR_VREFBUFLPEN_B_0X1		(0x1u<<15)
#define	RCC_APB4LLPENR_LPTIM5LPEN_B_0X0			(0x0u<<12)
#define	RCC_APB4LLPENR_LPTIM5LPEN_B_0X1			(0x1u<<12)
#define	RCC_APB4LLPENR_LPTIM4LPEN_B_0X0			(0x0u<<11)
#define	RCC_APB4LLPENR_LPTIM4LPEN_B_0X1			(0x1u<<11)
#define	RCC_APB4LLPENR_LPTIM3LPEN_B_0X0			(0x0u<<10)
#define	RCC_APB4LLPENR_LPTIM3LPEN_B_0X1			(0x1u<<10)
#define	RCC_APB4LLPENR_LPTIM2LPEN_B_0X0			(0x0u<<9)
#define	RCC_APB4LLPENR_LPTIM2LPEN_B_0X1			(0x1u<<9)
#define	RCC_APB4LLPENR_I2C4LPEN_B_0X0			(0x0u<<7)
#define	RCC_APB4LLPENR_I2C4LPEN_B_0X1			(0x1u<<7)
#define	RCC_APB4LLPENR_SPI6LPEN_B_0X0			(0x0u<<5)
#define	RCC_APB4LLPENR_SPI6LPEN_B_0X1			(0x1u<<5)
#define	RCC_APB4LLPENR_LPUART1LPEN_B_0X0		(0x0u<<3)
#define	RCC_APB4LLPENR_LPUART1LPEN_B_0X1		(0x1u<<3)
#define	RCC_APB4LLPENR_HDPLPEN_B_0X0			(0x0u<<2)
#define	RCC_APB4LLPENR_HDPLPEN_B_0X1			(0x1u<<2)

// APB4HLPENR Configuration

#define	RCC_APB4HLPENR_BUSPERFMLPEN				(0x1u<<4)
#define	RCC_APB4HLPENR_DTSLPEN					(0x1u<<2)
#define	RCC_APB4HLPENR_BSECLPEN					(0x1u<<1)
#define	RCC_APB4HLPENR_SYSCFGLPEN				(0x1u<<0)

#define	RCC_APB4HLPENR_BUSPERFMLPEN_B_0X0		(0x0u<<4)
#define	RCC_APB4HLPENR_BUSPERFMLPEN_B_0X1		(0x1u<<4)
#define	RCC_APB4HLPENR_DTSLPEN_B_0X0			(0x0u<<2)
#define	RCC_APB4HLPENR_DTSLPEN_B_0X1			(0x1u<<2)
#define	RCC_APB4HLPENR_BSECLPEN_B_0X0			(0x0u<<1)
#define	RCC_APB4HLPENR_BSECLPEN_B_0X1			(0x1u<<1)
#define	RCC_APB4HLPENR_SYSCFGLPEN_B_0X0			(0x0u<<0)
#define	RCC_APB4HLPENR_SYSCFGLPEN_B_0X1			(0x1u<<0)

// APB5LPENR Configuration

#define	RCC_APB5LPENR_CSILPEN					(0x1u<<6)
#define	RCC_APB5LPENR_VENCLPEN					(0x1u<<5)
#define	RCC_APB5LPENR_GFXTIMLPEN				(0x1u<<4)
#define	RCC_APB5LPENR_DCMIPPLPEN				(0x1u<<2)
#define	RCC_APB5LPENR_LTDCLPEN					(0x1u<<1)

#define	RCC_APB5LPENR_CSILPEN_B_0X0				(0x0u<<6)
#define	RCC_APB5LPENR_CSILPEN_B_0X1				(0x1u<<6)
#define	RCC_APB5LPENR_VENCLPEN_B_0X0			(0x0u<<5)
#define	RCC_APB5LPENR_VENCLPEN_B_0X1			(0x1u<<5)
#define	RCC_APB5LPENR_GFXTIMLPEN_B_0X0			(0x0u<<4)
#define	RCC_APB5LPENR_GFXTIMLPEN_B_0X1			(0x1u<<4)
#define	RCC_APB5LPENR_DCMIPPLPEN_B_0X0			(0x0u<<2)
#define	RCC_APB5LPENR_DCMIPPLPEN_B_0X1			(0x1u<<2)
#define	RCC_APB5LPENR_LTDCLPEN_B_0X0			(0x0u<<1)
#define	RCC_APB5LPENR_LTDCLPEN_B_0X1			(0x1u<<1)

// RDCR Configuration

#define	RCC_RDCR_EADLY							(0xFu<<24)
#define	RCC_RDCR_EADLY_0						(0x1u<<24)
#define	RCC_RDCR_MRD							(0x1Fu<<16)
#define	RCC_RDCR_MRD_0							(0x1u<<16)

#define	RCC_RDCR_EADLY_B_0X0					(0x0u<<24)
#define	RCC_RDCR_EADLY_B_0X1					(0x1u<<24)
#define	RCC_RDCR_EADLY_B_0X2					(0x2u<<24)
#define	RCC_RDCR_MRD_B_0X0						(0x0u<<16)
#define	RCC_RDCR_MRD_B_0X1						(0x1u<<16)
#define	RCC_RDCR_MRD_B_0X2						(0x2u<<16)
#define	RCC_RDCR_MRD_B_0X3						(0x3u<<16)
#define	RCC_RDCR_MRD_B_0X4						(0x4u<<16)
#define	RCC_RDCR_MRD_B_0X5						(0x5u<<16)
#define	RCC_RDCR_MRD_B_0X6						(0x6u<<16)
#define	RCC_RDCR_MRD_B_0X7						(0x7u<<16)
#define	RCC_RDCR_MRD_B_0X8						(0x8u<<16)
#define	RCC_RDCR_MRD_B_0X9						(0x9u<<16)
#define	RCC_RDCR_MRD_B_0XA						(0xAu<<16)
#define	RCC_RDCR_MRD_B_0XB						(0xBu<<16)
#define	RCC_RDCR_MRD_B_0XC						(0xCu<<16)
#define	RCC_RDCR_MRD_B_0XD						(0xDu<<16)
#define	RCC_RDCR_MRD_B_0XE						(0xEu<<16)
#define	RCC_RDCR_MRD_B_0XF						(0xFu<<16)

// SECCFGR0 Configuration

#define	RCC_SECCFGR0_HSESEC						(0x1u<<4)
#define	RCC_SECCFGR0_HSISEC						(0x1u<<3)
#define	RCC_SECCFGR0_MSISEC						(0x1u<<2)
#define	RCC_SECCFGR0_LSESEC						(0x1u<<1)
#define	RCC_SECCFGR0_LSISEC						(0x1u<<0)

#define	RCC_SECCFGR0_HSESEC_B_0X0				(0x0u<<4)
#define	RCC_SECCFGR0_HSESEC_B_0X1				(0x1u<<4)
#define	RCC_SECCFGR0_HSISEC_B_0X0				(0x0u<<3)
#define	RCC_SECCFGR0_HSISEC_B_0X1				(0x1u<<3)
#define	RCC_SECCFGR0_MSISEC_B_0X0				(0x0u<<2)
#define	RCC_SECCFGR0_MSISEC_B_0X1				(0x1u<<2)
#define	RCC_SECCFGR0_LSESEC_B_0X0				(0x0u<<1)
#define	RCC_SECCFGR0_LSESEC_B_0X1				(0x1u<<1)
#define	RCC_SECCFGR0_LSISEC_B_0X0				(0x0u<<0)
#define	RCC_SECCFGR0_LSISEC_B_0X1				(0x1u<<0)

// PRIVCFGR0 Configuration

#define	RCC_PRIVCFGR0_HSEPV						(0x1u<<4)
#define	RCC_PRIVCFGR0_HSIPV						(0x1u<<3)
#define	RCC_PRIVCFGR0_MSIPV						(0x1u<<2)
#define	RCC_PRIVCFGR0_LSEPV						(0x1u<<1)
#define	RCC_PRIVCFGR0_LSIPV						(0x1u<<0)

#define	RCC_PRIVCFGR0_HSEPV_B_0X0				(0x0u<<4)
#define	RCC_PRIVCFGR0_HSEPV_B_0X1				(0x1u<<4)
#define	RCC_PRIVCFGR0_HSIPV_B_0X0				(0x0u<<3)
#define	RCC_PRIVCFGR0_HSIPV_B_0X1				(0x1u<<3)
#define	RCC_PRIVCFGR0_MSIPV_B_0X0				(0x0u<<2)
#define	RCC_PRIVCFGR0_MSIPV_B_0X1				(0x1u<<2)
#define	RCC_PRIVCFGR0_LSEPV_B_0X0				(0x0u<<1)
#define	RCC_PRIVCFGR0_LSEPV_B_0X1				(0x1u<<1)
#define	RCC_PRIVCFGR0_LSIPV_B_0X0				(0x0u<<0)
#define	RCC_PRIVCFGR0_LSIPV_B_0X1				(0x1u<<0)

// LOCKCFGR0 Configuration

#define	RCC_LOCKCFGR0_HSELOCK					(0x1u<<4)
#define	RCC_LOCKCFGR0_HSILOCK					(0x1u<<3)
#define	RCC_LOCKCFGR0_MSILOCK					(0x1u<<2)
#define	RCC_LOCKCFGR0_LSELOCK					(0x1u<<1)
#define	RCC_LOCKCFGR0_LSILOCK					(0x1u<<0)

#define	RCC_LOCKCFGR0_HSELOCK_B_0X0				(0x0u<<4)
#define	RCC_LOCKCFGR0_HSELOCK_B_0X1				(0x1u<<4)
#define	RCC_LOCKCFGR0_HSILOCK_B_0X0				(0x0u<<3)
#define	RCC_LOCKCFGR0_HSILOCK_B_0X1				(0x1u<<3)
#define	RCC_LOCKCFGR0_MSILOCK_B_0X0				(0x0u<<2)
#define	RCC_LOCKCFGR0_MSILOCK_B_0X1				(0x1u<<2)
#define	RCC_LOCKCFGR0_LSELOCK_B_0X0				(0x0u<<1)
#define	RCC_LOCKCFGR0_LSELOCK_B_0X1				(0x1u<<1)
#define	RCC_LOCKCFGR0_LSILOCK_B_0X0				(0x0u<<0)
#define	RCC_LOCKCFGR0_LSILOCK_B_0X1				(0x1u<<0)

// PUBCFGR0 Configuration

