hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
#define	RCC_PUBCFGR0_HSEPUB						(0x1u<<4)
#define	RCC_PUBCFGR0_HSIPUB						(0x1u<<3)
#define	RCC_PUBCFGR0_MSIPUB						(0x1u<<2)
#define	RCC_PUBCFGR0_LSEPUB						(0x1u<<1)
#define	RCC_PUBCFGR0_LSIPUB						(0x1u<<0)

#define	RCC_PUBCFGR0_HSEPUB_B_0X0				(0x0u<<4)
#define	RCC_PUBCFGR0_HSEPUB_B_0X1				(0x1u<<4)
#define	RCC_PUBCFGR0_HSIPUB_B_0X0				(0x0u<<3)
#define	RCC_PUBCFGR0_HSIPUB_B_0X1				(0x1u<<3)
#define	RCC_PUBCFGR0_MSIPUB_B_0X0				(0x0u<<2)
#define	RCC_PUBCFGR0_MSIPUB_B_0X1				(0x1u<<2)
#define	RCC_PUBCFGR0_LSEPUB_B_0X0				(0x0u<<1)
#define	RCC_PUBCFGR0_LSEPUB_B_0X1				(0x1u<<1)
#define	RCC_PUBCFGR0_LSIPUB_B_0X0				(0x0u<<0)
#define	RCC_PUBCFGR0_LSIPUB_B_0X1				(0x1u<<0)

// SECCFGR1 Configuration

#define	RCC_SECCFGR1_PLL4SEC					(0x1u<<3)
#define	RCC_SECCFGR1_PLL3SEC					(0x1u<<2)
#define	RCC_SECCFGR1_PLL2SEC					(0x1u<<1)
#define	RCC_SECCFGR1_PLL1SEC					(0x1u<<0)

#define	RCC_SECCFGR1_PLL4SEC_B_0X0				(0x0u<<3)
#define	RCC_SECCFGR1_PLL4SEC_B_0X1				(0x1u<<3)
#define	RCC_SECCFGR1_PLL3SEC_B_0X0				(0x0u<<2)
#define	RCC_SECCFGR1_PLL3SEC_B_0X1				(0x1u<<2)
#define	RCC_SECCFGR1_PLL2SEC_B_0X0				(0x0u<<1)
#define	RCC_SECCFGR1_PLL2SEC_B_0X1				(0x1u<<1)
#define	RCC_SECCFGR1_PLL1SEC_B_0X0				(0x0u<<0)
#define	RCC_SECCFGR1_PLL1SEC_B_0X1				(0x1u<<0)

// PRIVCFGR1 Configuration

#define	RCC_PRIVCFGR1_PLL4PV					(0x1u<<3)
#define	RCC_PRIVCFGR1_PLL3PV					(0x1u<<2)
#define	RCC_PRIVCFGR1_PLL2PV					(0x1u<<1)
#define	RCC_PRIVCFGR1_PLL1PV					(0x1u<<0)

#define	RCC_PRIVCFGR1_PLL4PV_B_0X0				(0x0u<<3)
#define	RCC_PRIVCFGR1_PLL4PV_B_0X1				(0x1u<<3)
#define	RCC_PRIVCFGR1_PLL3PV_B_0X0				(0x0u<<2)
#define	RCC_PRIVCFGR1_PLL3PV_B_0X1				(0x1u<<2)
#define	RCC_PRIVCFGR1_PLL2PV_B_0X0				(0x0u<<1)
#define	RCC_PRIVCFGR1_PLL2PV_B_0X1				(0x1u<<1)
#define	RCC_PRIVCFGR1_PLL1PV_B_0X0				(0x0u<<0)
#define	RCC_PRIVCFGR1_PLL1PV_B_0X1				(0x1u<<0)

// LOCKCFGR1 Configuration

#define	RCC_LOCKCFGR1_PLL4LOCK					(0x1u<<3)
#define	RCC_LOCKCFGR1_PLL3LOCK					(0x1u<<2)
#define	RCC_LOCKCFGR1_PLL2LOCK					(0x1u<<1)
#define	RCC_LOCKCFGR1_PLL1LOCK					(0x1u<<0)

#define	RCC_LOCKCFGR1_PLL4LOCK_B_0X0			(0x0u<<3)
#define	RCC_LOCKCFGR1_PLL4LOCK_B_0X1			(0x1u<<3)
#define	RCC_LOCKCFGR1_PLL3LOCK_B_0X0			(0x0u<<2)
#define	RCC_LOCKCFGR1_PLL3LOCK_B_0X1			(0x1u<<2)
#define	RCC_LOCKCFGR1_PLL2LOCK_B_0X0			(0x0u<<1)
#define	RCC_LOCKCFGR1_PLL2LOCK_B_0X1			(0x1u<<1)
#define	RCC_LOCKCFGR1_PLL1LOCK_B_0X0			(0x0u<<0)
#define	RCC_LOCKCFGR1_PLL1LOCK_B_0X1			(0x1u<<0)

// PUBCFGR1 Configuration

#define	RCC_PUBCFGR1_PLL4PUB					(0x1u<<3)
#define	RCC_PUBCFGR1_PLL3PUB					(0x1u<<2)
#define	RCC_PUBCFGR1_PLL2PUB					(0x1u<<1)
#define	RCC_PUBCFGR1_PLL1PUB					(0x1u<<0)

#define	RCC_PUBCFGR1_PLL4PUB_B_0X0				(0x0u<<3)
#define	RCC_PUBCFGR1_PLL4PUB_B_0X1				(0x1u<<3)
#define	RCC_PUBCFGR1_PLL3PUB_B_0X0				(0x0u<<2)
#define	RCC_PUBCFGR1_PLL3PUB_B_0X1				(0x1u<<2)
#define	RCC_PUBCFGR1_PLL2PUB_B_0X0				(0x0u<<1)
#define	RCC_PUBCFGR1_PLL2PUB_B_0X1				(0x1u<<1)
#define	RCC_PUBCFGR1_PLL1PUB_B_0X0				(0x0u<<0)
#define	RCC_PUBCFGR1_PLL1PUB_B_0X1				(0x1u<<0)

// SECCFGR2 Configuration

#define	RCC_SECCFGR2_IC20SEC					(0x1u<<19)
#define	RCC_SECCFGR2_IC19SEC					(0x1u<<18)
#define	RCC_SECCFGR2_IC18SEC					(0x1u<<17)
#define	RCC_SECCFGR2_IC17SEC					(0x1u<<16)
#define	RCC_SECCFGR2_IC16SEC					(0x1u<<15)
#define	RCC_SECCFGR2_IC15SEC					(0x1u<<14)
#define	RCC_SECCFGR2_IC14SEC					(0x1u<<13)
#define	RCC_SECCFGR2_IC13SEC					(0x1u<<12)
#define	RCC_SECCFGR2_IC12SEC					(0x1u<<11)
#define	RCC_SECCFGR2_IC11SEC					(0x1u<<10)
#define	RCC_SECCFGR2_IC10SEC					(0x1u<<9)
#define	RCC_SECCFGR2_IC9SEC						(0x1u<<8)
#define	RCC_SECCFGR2_IC8SEC						(0x1u<<7)
#define	RCC_SECCFGR2_IC7SEC						(0x1u<<6)
#define	RCC_SECCFGR2_IC6SEC						(0x1u<<5)
#define	RCC_SECCFGR2_IC5SEC						(0x1u<<4)
#define	RCC_SECCFGR2_IC4SEC						(0x1u<<3)
#define	RCC_SECCFGR2_IC3SEC						(0x1u<<2)
#define	RCC_SECCFGR2_IC2SEC						(0x1u<<1)
#define	RCC_SECCFGR2_IC1SEC						(0x1u<<0)

#define	RCC_SECCFGR2_IC20SEC_B_0X0				(0x0u<<19)
#define	RCC_SECCFGR2_IC20SEC_B_0X1				(0x1u<<19)
#define	RCC_SECCFGR2_IC19SEC_B_0X0				(0x0u<<18)
#define	RCC_SECCFGR2_IC19SEC_B_0X1				(0x1u<<18)
#define	RCC_SECCFGR2_IC18SEC_B_0X0				(0x0u<<17)
#define	RCC_SECCFGR2_IC18SEC_B_0X1				(0x1u<<17)
#define	RCC_SECCFGR2_IC17SEC_B_0X0				(0x0u<<16)
#define	RCC_SECCFGR2_IC17SEC_B_0X1				(0x1u<<16)
#define	RCC_SECCFGR2_IC16SEC_B_0X0				(0x0u<<15)
#define	RCC_SECCFGR2_IC16SEC_B_0X1				(0x1u<<15)
#define	RCC_SECCFGR2_IC15SEC_B_0X0				(0x0u<<14)
#define	RCC_SECCFGR2_IC15SEC_B_0X1				(0x1u<<14)
#define	RCC_SECCFGR2_IC14SEC_B_0X0				(0x0u<<13)
#define	RCC_SECCFGR2_IC14SEC_B_0X1				(0x1u<<13)
#define	RCC_SECCFGR2_IC13SEC_B_0X0				(0x0u<<12)
#define	RCC_SECCFGR2_IC13SEC_B_0X1				(0x1u<<12)
#define	RCC_SECCFGR2_IC12SEC_B_0X0				(0x0u<<11)
#define	RCC_SECCFGR2_IC12SEC_B_0X1				(0x1u<<11)
#define	RCC_SECCFGR2_IC11SEC_B_0X0				(0x0u<<10)
#define	RCC_SECCFGR2_IC11SEC_B_0X1				(0x1u<<10)
#define	RCC_SECCFGR2_IC10SEC_B_0X0				(0x0u<<9)
#define	RCC_SECCFGR2_IC10SEC_B_0X1				(0x1u<<9)
#define	RCC_SECCFGR2_IC9SEC_B_0X0				(0x0u<<8)
#define	RCC_SECCFGR2_IC9SEC_B_0X1				(0x1u<<8)
#define	RCC_SECCFGR2_IC8SEC_B_0X0				(0x0u<<7)
#define	RCC_SECCFGR2_IC8SEC_B_0X1				(0x1u<<7)
#define	RCC_SECCFGR2_IC7SEC_B_0X0				(0x0u<<6)
#define	RCC_SECCFGR2_IC7SEC_B_0X1				(0x1u<<6)
#define	RCC_SECCFGR2_IC6SEC_B_0X0				(0x0u<<5)
#define	RCC_SECCFGR2_IC6SEC_B_0X1				(0x1u<<5)
#define	RCC_SECCFGR2_IC5SEC_B_0X0				(0x0u<<4)
#define	RCC_SECCFGR2_IC5SEC_B_0X1				(0x1u<<4)
#define	RCC_SECCFGR2_IC4SEC_B_0X0				(0x0u<<3)
#define	RCC_SECCFGR2_IC4SEC_B_0X1				(0x1u<<3)
#define	RCC_SECCFGR2_IC3SEC_B_0X0				(0x0u<<2)
#define	RCC_SECCFGR2_IC3SEC_B_0X1				(0x1u<<2)
#define	RCC_SECCFGR2_IC2SEC_B_0X0				(0x0u<<1)
#define	RCC_SECCFGR2_IC2SEC_B_0X1				(0x1u<<1)
#define	RCC_SECCFGR2_IC1SEC_B_0X0				(0x0u<<0)
#define	RCC_SECCFGR2_IC1SEC_B_0X1				(0x1u<<0)

// PRIVCFGR2 Configuration

#define	RCC_PRIVCFGR2_IC20PV					(0x1u<<19)
#define	RCC_PRIVCFGR2_IC19PV					(0x1u<<18)
#define	RCC_PRIVCFGR2_IC18PV					(0x1u<<17)
#define	RCC_PRIVCFGR2_IC17PV					(0x1u<<16)
#define	RCC_PRIVCFGR2_IC16PV					(0x1u<<15)
#define	RCC_PRIVCFGR2_IC15PV					(0x1u<<14)
#define	RCC_PRIVCFGR2_IC14PV					(0x1u<<13)
#define	RCC_PRIVCFGR2_IC13PV					(0x1u<<12)
#define	RCC_PRIVCFGR2_IC12PV					(0x1u<<11)
#define	RCC_PRIVCFGR2_IC11PV					(0x1u<<10)
#define	RCC_PRIVCFGR2_IC10PV					(0x1u<<9)
#define	RCC_PRIVCFGR2_IC9PV						(0x1u<<8)
#define	RCC_PRIVCFGR2_IC8PV						(0x1u<<7)
#define	RCC_PRIVCFGR2_IC7PV						(0x1u<<6)
#define	RCC_PRIVCFGR2_IC6PV						(0x1u<<5)
#define	RCC_PRIVCFGR2_IC5PV						(0x1u<<4)
#define	RCC_PRIVCFGR2_IC4PV						(0x1u<<3)
#define	RCC_PRIVCFGR2_IC3PV						(0x1u<<2)
#define	RCC_PRIVCFGR2_IC2PV						(0x1u<<1)
#define	RCC_PRIVCFGR2_IC1PV						(0x1u<<0)

#define	RCC_PRIVCFGR2_IC20PV_B_0X0				(0x0u<<19)
#define	RCC_PRIVCFGR2_IC20PV_B_0X1				(0x1u<<19)
#define	RCC_PRIVCFGR2_IC19PV_B_0X0				(0x0u<<18)
#define	RCC_PRIVCFGR2_IC19PV_B_0X1				(0x1u<<18)
#define	RCC_PRIVCFGR2_IC18PV_B_0X0				(0x0u<<17)
#define	RCC_PRIVCFGR2_IC18PV_B_0X1				(0x1u<<17)
#define	RCC_PRIVCFGR2_IC17PV_B_0X0				(0x0u<<16)
#define	RCC_PRIVCFGR2_IC17PV_B_0X1				(0x1u<<16)
#define	RCC_PRIVCFGR2_IC16PV_B_0X0				(0x0u<<15)
#define	RCC_PRIVCFGR2_IC16PV_B_0X1				(0x1u<<15)
#define	RCC_PRIVCFGR2_IC15PV_B_0X0				(0x0u<<14)
#define	RCC_PRIVCFGR2_IC15PV_B_0X1				(0x1u<<14)
#define	RCC_PRIVCFGR2_IC14PV_B_0X0				(0x0u<<13)
#define	RCC_PRIVCFGR2_IC14PV_B_0X1				(0x1u<<13)
#define	RCC_PRIVCFGR2_IC13PV_B_0X0				(0x0u<<12)
#define	RCC_PRIVCFGR2_IC13PV_B_0X1				(0x1u<<12)
#define	RCC_PRIVCFGR2_IC12PV_B_0X0				(0x0u<<11)
#define	RCC_PRIVCFGR2_IC12PV_B_0X1				(0x1u<<11)
#define	RCC_PRIVCFGR2_IC11PV_B_0X0				(0x0u<<10)
#define	RCC_PRIVCFGR2_IC11PV_B_0X1				(0x1u<<10)
#define	RCC_PRIVCFGR2_IC10PV_B_0X0				(0x0u<<9)
#define	RCC_PRIVCFGR2_IC10PV_B_0X1				(0x1u<<9)
#define	RCC_PRIVCFGR2_IC9PV_B_0X0				(0x0u<<8)
#define	RCC_PRIVCFGR2_IC9PV_B_0X1				(0x1u<<8)
#define	RCC_PRIVCFGR2_IC8PV_B_0X0				(0x0u<<7)
#define	RCC_PRIVCFGR2_IC8PV_B_0X1				(0x1u<<7)
#define	RCC_PRIVCFGR2_IC7PV_B_0X0				(0x0u<<6)
#define	RCC_PRIVCFGR2_IC7PV_B_0X1				(0x1u<<6)
#define	RCC_PRIVCFGR2_IC6PV_B_0X0				(0x0u<<5)
#define	RCC_PRIVCFGR2_IC6PV_B_0X1				(0x1u<<5)
#define	RCC_PRIVCFGR2_IC5PV_B_0X0				(0x0u<<4)
#define	RCC_PRIVCFGR2_IC5PV_B_0X1				(0x1u<<4)
#define	RCC_PRIVCFGR2_IC4PV_B_0X0				(0x0u<<3)
#define	RCC_PRIVCFGR2_IC4PV_B_0X1				(0x1u<<3)
#define	RCC_PRIVCFGR2_IC3PV_B_0X0				(0x0u<<2)
#define	RCC_PRIVCFGR2_IC3PV_B_0X1				(0x1u<<2)
#define	RCC_PRIVCFGR2_IC2PV_B_0X0				(0x0u<<1)
#define	RCC_PRIVCFGR2_IC2PV_B_0X1				(0x1u<<1)
#define	RCC_PRIVCFGR2_IC1PV_B_0X0				(0x0u<<0)
#define	RCC_PRIVCFGR2_IC1PV_B_0X1				(0x1u<<0)

// LOCKCFGR2 Configuration

#define	RCC_LOCKCFGR2_IC20LOCK					(0x1u<<19)
#define	RCC_LOCKCFGR2_IC19LOCK					(0x1u<<18)
#define	RCC_LOCKCFGR2_IC18LOCK					(0x1u<<17)
#define	RCC_LOCKCFGR2_IC17LOCK					(0x1u<<16)
#define	RCC_LOCKCFGR2_IC16LOCK					(0x1u<<15)
#define	RCC_LOCKCFGR2_IC15LOCK					(0x1u<<14)
#define	RCC_LOCKCFGR2_IC14LOCK					(0x1u<<13)
#define	RCC_LOCKCFGR2_IC13LOCK					(0x1u<<12)
#define	RCC_LOCKCFGR2_IC12LOCK					(0x1u<<11)
#define	RCC_LOCKCFGR2_IC11LOCK					(0x1u<<10)
#define	RCC_LOCKCFGR2_IC10LOCK					(0x1u<<9)
#define	RCC_LOCKCFGR2_IC9LOCK					(0x1u<<8)
#define	RCC_LOCKCFGR2_IC8LOCK					(0x1u<<7)
#define	RCC_LOCKCFGR2_IC7LOCK					(0x1u<<6)
#define	RCC_LOCKCFGR2_IC6LOCK					(0x1u<<5)
#define	RCC_LOCKCFGR2_IC5LOCK					(0x1u<<4)
#define	RCC_LOCKCFGR2_IC4LOCK					(0x1u<<3)
#define	RCC_LOCKCFGR2_IC3LOCK					(0x1u<<2)
#define	RCC_LOCKCFGR2_IC2LOCK					(0x1u<<1)
#define	RCC_LOCKCFGR2_IC1LOCK					(0x1u<<0)

#define	RCC_LOCKCFGR2_IC20LOCK_B_0X0			(0x0u<<19)
#define	RCC_LOCKCFGR2_IC20LOCK_B_0X1			(0x1u<<19)
#define	RCC_LOCKCFGR2_IC19LOCK_B_0X0			(0x0u<<18)
#define	RCC_LOCKCFGR2_IC19LOCK_B_0X1			(0x1u<<18)
#define	RCC_LOCKCFGR2_IC18LOCK_B_0X0			(0x0u<<17)
#define	RCC_LOCKCFGR2_IC18LOCK_B_0X1			(0x1u<<17)
#define	RCC_LOCKCFGR2_IC17LOCK_B_0X0			(0x0u<<16)
#define	RCC_LOCKCFGR2_IC17LOCK_B_0X1			(0x1u<<16)
#define	RCC_LOCKCFGR2_IC16LOCK_B_0X0			(0x0u<<15)
#define	RCC_LOCKCFGR2_IC16LOCK_B_0X1			(0x1u<<15)
#define	RCC_LOCKCFGR2_IC15LOCK_B_0X0			(0x0u<<14)
#define	RCC_LOCKCFGR2_IC15LOCK_B_0X1			(0x1u<<14)
#define	RCC_LOCKCFGR2_IC14LOCK_B_0X0			(0x0u<<13)
#define	RCC_LOCKCFGR2_IC14LOCK_B_0X1			(0x1u<<13)
#define	RCC_LOCKCFGR2_IC13LOCK_B_0X0			(0x0u<<12)
#define	RCC_LOCKCFGR2_IC13LOCK_B_0X1			(0x1u<<12)
#define	RCC_LOCKCFGR2_IC12LOCK_B_0X0			(0x0u<<11)
#define	RCC_LOCKCFGR2_IC12LOCK_B_0X1			(0x1u<<11)
#define	RCC_LOCKCFGR2_IC11LOCK_B_0X0			(0x0u<<10)
#define	RCC_LOCKCFGR2_IC11LOCK_B_0X1			(0x1u<<10)
#define	RCC_LOCKCFGR2_IC10LOCK_B_0X0			(0x0u<<9)
#define	RCC_LOCKCFGR2_IC10LOCK_B_0X1			(0x1u<<9)
#define	RCC_LOCKCFGR2_IC9LOCK_B_0X0				(0x0u<<8)
#define	RCC_LOCKCFGR2_IC9LOCK_B_0X1				(0x1u<<8)
#define	RCC_LOCKCFGR2_IC8LOCK_B_0X0				(0x0u<<7)
#define	RCC_LOCKCFGR2_IC8LOCK_B_0X1				(0x1u<<7)
#define	RCC_LOCKCFGR2_IC7LOCK_B_0X0				(0x0u<<6)
#define	RCC_LOCKCFGR2_IC7LOCK_B_0X1				(0x1u<<6)
#define	RCC_LOCKCFGR2_IC6LOCK_B_0X0				(0x0u<<5)
#define	RCC_LOCKCFGR2_IC6LOCK_B_0X1				(0x1u<<5)
#define	RCC_LOCKCFGR2_IC5LOCK_B_0X0				(0x0u<<4)
#define	RCC_LOCKCFGR2_IC5LOCK_B_0X1				(0x1u<<4)
#define	RCC_LOCKCFGR2_IC4LOCK_B_0X0				(0x0u<<3)
#define	RCC_LOCKCFGR2_IC4LOCK_B_0X1				(0x1u<<3)
#define	RCC_LOCKCFGR2_IC3LOCK_B_0X0				(0x0u<<2)
#define	RCC_LOCKCFGR2_IC3LOCK_B_0X1				(0x1u<<2)
#define	RCC_LOCKCFGR2_IC2LOCK_B_0X0				(0x0u<<1)
#define	RCC_LOCKCFGR2_IC2LOCK_B_0X1				(0x1u<<1)
#define	RCC_LOCKCFGR2_IC1LOCK_B_0X0				(0x0u<<0)
#define	RCC_LOCKCFGR2_IC1LOCK_B_0X1				(0x1u<<0)

// PUBCFGR2 Configuration

#define	RCC_PUBCFGR2_IC20PUB					(0x1u<<19)
#define	RCC_PUBCFGR2_IC19PUB					(0x1u<<18)
#define	RCC_PUBCFGR2_IC18PUB					(0x1u<<17)
#define	RCC_PUBCFGR2_IC17PUB					(0x1u<<16)
#define	RCC_PUBCFGR2_IC16PUB					(0x1u<<15)
#define	RCC_PUBCFGR2_IC15PUB					(0x1u<<14)
#define	RCC_PUBCFGR2_IC14PUB					(0x1u<<13)
#define	RCC_PUBCFGR2_IC13PUB					(0x1u<<12)
#define	RCC_PUBCFGR2_IC12PUB					(0x1u<<11)
#define	RCC_PUBCFGR2_IC11PUB					(0x1u<<10)
#define	RCC_PUBCFGR2_IC10PUB					(0x1u<<9)
#define	RCC_PUBCFGR2_IC9PUB						(0x1u<<8)
#define	RCC_PUBCFGR2_IC8PUB						(0x1u<<7)
#define	RCC_PUBCFGR2_IC7PUB						(0x1u<<6)
#define	RCC_PUBCFGR2_IC6PUB						(0x1u<<5)
#define	RCC_PUBCFGR2_IC5PUB						(0x1u<<4)
#define	RCC_PUBCFGR2_IC4PUB						(0x1u<<3)
#define	RCC_PUBCFGR2_IC3PUB						(0x1u<<2)
#define	RCC_PUBCFGR2_IC2PUB						(0x1u<<1)
#define	RCC_PUBCFGR2_IC1PUB						(0x1u<<0)

#define	RCC_PUBCFGR2_IC20PUB_B_0X0				(0x0u<<19)
#define	RCC_PUBCFGR2_IC20PUB_B_0X1				(0x1u<<19)
#define	RCC_PUBCFGR2_IC19PUB_B_0X0				(0x0u<<18)
#define	RCC_PUBCFGR2_IC19PUB_B_0X1				(0x1u<<18)
#define	RCC_PUBCFGR2_IC18PUB_B_0X0				(0x0u<<17)
#define	RCC_PUBCFGR2_IC18PUB_B_0X1				(0x1u<<17)
#define	RCC_PUBCFGR2_IC17PUB_B_0X0				(0x0u<<16)
#define	RCC_PUBCFGR2_IC17PUB_B_0X1				(0x1u<<16)
#define	RCC_PUBCFGR2_IC16PUB_B_0X0				(0x0u<<15)
#define	RCC_PUBCFGR2_IC16PUB_B_0X1				(0x1u<<15)
#define	RCC_PUBCFGR2_IC15PUB_B_0X0				(0x0u<<14)
#define	RCC_PUBCFGR2_IC15PUB_B_0X1				(0x1u<<14)
#define	RCC_PUBCFGR2_IC14PUB_B_0X0				(0x0u<<13)
#define	RCC_PUBCFGR2_IC14PUB_B_0X1				(0x1u<<13)
#define	RCC_PUBCFGR2_IC13PUB_B_0X0				(0x0u<<12)
#define	RCC_PUBCFGR2_IC13PUB_B_0X1				(0x1u<<12)
#define	RCC_PUBCFGR2_IC12PUB_B_0X0				(0x0u<<11)
#define	RCC_PUBCFGR2_IC12PUB_B_0X1				(0x1u<<11)
#define	RCC_PUBCFGR2_IC11PUB_B_0X0				(0x0u<<10)
#define	RCC_PUBCFGR2_IC11PUB_B_0X1				(0x1u<<10)
#define	RCC_PUBCFGR2_IC10PUB_B_0X0				(0x0u<<9)
#define	RCC_PUBCFGR2_IC10PUB_B_0X1				(0x1u<<9)
#define	RCC_PUBCFGR2_IC9PUB_B_0X0				(0x0u<<8)
#define	RCC_PUBCFGR2_IC9PUB_B_0X1				(0x1u<<8)
#define	RCC_PUBCFGR2_IC8PUB_B_0X0				(0x0u<<7)
#define	RCC_PUBCFGR2_IC8PUB_B_0X1				(0x1u<<7)
#define	RCC_PUBCFGR2_IC7PUB_B_0X0				(0x0u<<6)
#define	RCC_PUBCFGR2_IC7PUB_B_0X1				(0x1u<<6)
#define	RCC_PUBCFGR2_IC6PUB_B_0X0				(0x0u<<5)
#define	RCC_PUBCFGR2_IC6PUB_B_0X1				(0x1u<<5)
#define	RCC_PUBCFGR2_IC5PUB_B_0X0				(0x0u<<4)
#define	RCC_PUBCFGR2_IC5PUB_B_0X1				(0x1u<<4)
#define	RCC_PUBCFGR2_IC4PUB_B_0X0				(0x0u<<3)
#define	RCC_PUBCFGR2_IC4PUB_B_0X1				(0x1u<<3)
#define	RCC_PUBCFGR2_IC3PUB_B_0X0				(0x0u<<2)
#define	RCC_PUBCFGR2_IC3PUB_B_0X1				(0x1u<<2)
#define	RCC_PUBCFGR2_IC2PUB_B_0X0				(0x0u<<1)
#define	RCC_PUBCFGR2_IC2PUB_B_0X1				(0x1u<<1)
#define	RCC_PUBCFGR2_IC1PUB_B_0X0				(0x0u<<0)
#define	RCC_PUBCFGR2_IC1PUB_B_0X1				(0x1u<<0)

// SECCFGR3 Configuration

