hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
#define	RCC_SECCFGR3_DFTSEC						(0x1u<<6)
#define	RCC_SECCFGR3_RSTSEC						(0x1u<<5)
#define	RCC_SECCFGR3_INTSEC						(0x1u<<4)
#define	RCC_SECCFGR3_PERSEC						(0x1u<<3)
#define	RCC_SECCFGR3_BUSSEC						(0x1u<<2)
#define	RCC_SECCFGR3_SYSSEC						(0x1u<<1)
#define	RCC_SECCFGR3_MODSEC						(0x1u<<0)

#define	RCC_SECCFGR3_DFTSEC_B_0X0				(0x0u<<6)
#define	RCC_SECCFGR3_DFTSEC_B_0X1				(0x1u<<6)
#define	RCC_SECCFGR3_RSTSEC_B_0X0				(0x0u<<5)
#define	RCC_SECCFGR3_RSTSEC_B_0X1				(0x1u<<5)
#define	RCC_SECCFGR3_INTSEC_B_0X0				(0x0u<<4)
#define	RCC_SECCFGR3_INTSEC_B_0X1				(0x1u<<4)
#define	RCC_SECCFGR3_PERSEC_B_0X0				(0x0u<<3)
#define	RCC_SECCFGR3_PERSEC_B_0X1				(0x1u<<3)
#define	RCC_SECCFGR3_BUSSEC_B_0X0				(0x0u<<2)
#define	RCC_SECCFGR3_BUSSEC_B_0X1				(0x1u<<2)
#define	RCC_SECCFGR3_SYSSEC_B_0X0				(0x0u<<1)
#define	RCC_SECCFGR3_SYSSEC_B_0X1				(0x1u<<1)
#define	RCC_SECCFGR3_MODSEC_B_0X0				(0x0u<<0)
#define	RCC_SECCFGR3_MODSEC_B_0X1				(0x1u<<0)

// PRIVCFGR3 Configuration

#define	RCC_PRIVCFGR3_DFTPV						(0x1u<<6)
#define	RCC_PRIVCFGR3_RSTPV						(0x1u<<5)
#define	RCC_PRIVCFGR3_INTPV						(0x1u<<4)
#define	RCC_PRIVCFGR3_PERPV						(0x1u<<3)
#define	RCC_PRIVCFGR3_BUSPV						(0x1u<<2)
#define	RCC_PRIVCFGR3_SYSPV						(0x1u<<1)
#define	RCC_PRIVCFGR3_MODPV						(0x1u<<0)

#define	RCC_PRIVCFGR3_DFTPV_B_0X0				(0x0u<<6)
#define	RCC_PRIVCFGR3_DFTPV_B_0X1				(0x1u<<6)
#define	RCC_PRIVCFGR3_RSTPV_B_0X0				(0x0u<<5)
#define	RCC_PRIVCFGR3_RSTPV_B_0X1				(0x1u<<5)
#define	RCC_PRIVCFGR3_INTPV_B_0X0				(0x0u<<4)
#define	RCC_PRIVCFGR3_INTPV_B_0X1				(0x1u<<4)
#define	RCC_PRIVCFGR3_PERPV_B_0X0				(0x0u<<3)
#define	RCC_PRIVCFGR3_PERPV_B_0X1				(0x1u<<3)
#define	RCC_PRIVCFGR3_BUSPV_B_0X0				(0x0u<<2)
#define	RCC_PRIVCFGR3_BUSPV_B_0X1				(0x1u<<2)
#define	RCC_PRIVCFGR3_SYSPV_B_0X0				(0x0u<<1)
#define	RCC_PRIVCFGR3_SYSPV_B_0X1				(0x1u<<1)
#define	RCC_PRIVCFGR3_MODPV_B_0X0				(0x0u<<0)
#define	RCC_PRIVCFGR3_MODPV_B_0X1				(0x1u<<0)

// LOCKCFGR3 Configuration

#define	RCC_LOCKCFGR3_DFTLOCK					(0x1u<<6)
#define	RCC_LOCKCFGR3_RSTLOCK					(0x1u<<5)
#define	RCC_LOCKCFGR3_INTLOCK					(0x1u<<4)
#define	RCC_LOCKCFGR3_PERLOCK					(0x1u<<3)
#define	RCC_LOCKCFGR3_BUSLOCK					(0x1u<<2)
#define	RCC_LOCKCFGR3_SYSLOCK					(0x1u<<1)
#define	RCC_LOCKCFGR3_MODLOCK					(0x1u<<0)

#define	RCC_LOCKCFGR3_DFTLOCK_B_0X0				(0x0u<<6)
#define	RCC_LOCKCFGR3_DFTLOCK_B_0X1				(0x1u<<6)
#define	RCC_LOCKCFGR3_RSTLOCK_B_0X0				(0x0u<<5)
#define	RCC_LOCKCFGR3_RSTLOCK_B_0X1				(0x1u<<5)
#define	RCC_LOCKCFGR3_INTLOCK_B_0X0				(0x0u<<4)
#define	RCC_LOCKCFGR3_INTLOCK_B_0X1				(0x1u<<4)
#define	RCC_LOCKCFGR3_PERLOCK_B_0X0				(0x0u<<3)
#define	RCC_LOCKCFGR3_PERLOCK_B_0X1				(0x1u<<3)
#define	RCC_LOCKCFGR3_BUSLOCK_B_0X0				(0x0u<<2)
#define	RCC_LOCKCFGR3_BUSLOCK_B_0X1				(0x1u<<2)
#define	RCC_LOCKCFGR3_SYSLOCK_B_0X0				(0x0u<<1)
#define	RCC_LOCKCFGR3_SYSLOCK_B_0X1				(0x1u<<1)
#define	RCC_LOCKCFGR3_MODLOCK_B_0X0				(0x0u<<0)
#define	RCC_LOCKCFGR3_MODLOCK_B_0X1				(0x1u<<0)

// PUBCFGR3 Configuration

#define	RCC_PUBCFGR3_DFTPUB						(0x1u<<6)
#define	RCC_PUBCFGR3_RSTPUB						(0x1u<<5)
#define	RCC_PUBCFGR3_INTPUB						(0x1u<<4)
#define	RCC_PUBCFGR3_PERPUB						(0x1u<<3)
#define	RCC_PUBCFGR3_BUSPUB						(0x1u<<2)
#define	RCC_PUBCFGR3_SYSPUB						(0x1u<<1)
#define	RCC_PUBCFGR3_MODPUB						(0x1u<<0)

#define	RCC_PUBCFGR3_DFTPUB_B_0X0				(0x0u<<6)
#define	RCC_PUBCFGR3_DFTPUB_B_0X1				(0x1u<<6)
#define	RCC_PUBCFGR3_RSTPUB_B_0X0				(0x0u<<5)
#define	RCC_PUBCFGR3_RSTPUB_B_0X1				(0x1u<<5)
#define	RCC_PUBCFGR3_INTPUB_B_0X0				(0x0u<<4)
#define	RCC_PUBCFGR3_INTPUB_B_0X1				(0x1u<<4)
#define	RCC_PUBCFGR3_PERPUB_B_0X0				(0x0u<<3)
#define	RCC_PUBCFGR3_PERPUB_B_0X1				(0x1u<<3)
#define	RCC_PUBCFGR3_BUSPUB_B_0X0				(0x0u<<2)
#define	RCC_PUBCFGR3_BUSPUB_B_0X1				(0x1u<<2)
#define	RCC_PUBCFGR3_SYSPUB_B_0X0				(0x0u<<1)
#define	RCC_PUBCFGR3_SYSPUB_B_0X1				(0x1u<<1)
#define	RCC_PUBCFGR3_MODPUB_B_0X0				(0x0u<<0)
#define	RCC_PUBCFGR3_MODPUB_B_0X1				(0x1u<<0)

// SECCFGR4 Configuration

#define	RCC_SECCFGR4_NOCSEC						(0x1u<<13)
#define	RCC_SECCFGR4_APB5SEC					(0x1u<<12)
#define	RCC_SECCFGR4_APB4SEC					(0x1u<<11)
#define	RCC_SECCFGR4_APB3SEC					(0x1u<<10)
#define	RCC_SECCFGR4_APB2SEC					(0x1u<<9)
#define	RCC_SECCFGR4_APB1SEC					(0x1u<<8)
#define	RCC_SECCFGR4_AHB5SEC					(0x1u<<7)
#define	RCC_SECCFGR4_AHB4SEC					(0x1u<<6)
#define	RCC_SECCFGR4_AHB3SEC					(0x1u<<5)
#define	RCC_SECCFGR4_AHB2SEC					(0x1u<<4)
#define	RCC_SECCFGR4_AHB1SEC					(0x1u<<3)
#define	RCC_SECCFGR4_AHBMSEC					(0x1u<<2)
#define	RCC_SECCFGR4_ACLKNCSEC					(0x1u<<1)
#define	RCC_SECCFGR4_ACLKNSEC					(0x1u<<0)

#define	RCC_SECCFGR4_NOCSEC_B_0X0				(0x0u<<13)
#define	RCC_SECCFGR4_NOCSEC_B_0X1				(0x1u<<13)
#define	RCC_SECCFGR4_APB5SEC_B_0X0				(0x0u<<12)
#define	RCC_SECCFGR4_APB5SEC_B_0X1				(0x1u<<12)
#define	RCC_SECCFGR4_APB4SEC_B_0X0				(0x0u<<11)
#define	RCC_SECCFGR4_APB4SEC_B_0X1				(0x1u<<11)
#define	RCC_SECCFGR4_APB3SEC_B_0X0				(0x0u<<10)
#define	RCC_SECCFGR4_APB3SEC_B_0X1				(0x1u<<10)
#define	RCC_SECCFGR4_APB2SEC_B_0X0				(0x0u<<9)
#define	RCC_SECCFGR4_APB2SEC_B_0X1				(0x1u<<9)
#define	RCC_SECCFGR4_APB1SEC_B_0X0				(0x0u<<8)
#define	RCC_SECCFGR4_APB1SEC_B_0X1				(0x1u<<8)
#define	RCC_SECCFGR4_AHB5SEC_B_0X0				(0x0u<<7)
#define	RCC_SECCFGR4_AHB5SEC_B_0X1				(0x1u<<7)
#define	RCC_SECCFGR4_AHB4SEC_B_0X0				(0x0u<<6)
#define	RCC_SECCFGR4_AHB4SEC_B_0X1				(0x1u<<6)
#define	RCC_SECCFGR4_AHB3SEC_B_0X0				(0x0u<<5)
#define	RCC_SECCFGR4_AHB3SEC_B_0X1				(0x1u<<5)
#define	RCC_SECCFGR4_AHB2SEC_B_0X0				(0x0u<<4)
#define	RCC_SECCFGR4_AHB2SEC_B_0X1				(0x1u<<4)
#define	RCC_SECCFGR4_AHB1SEC_B_0X0				(0x0u<<3)
#define	RCC_SECCFGR4_AHB1SEC_B_0X1				(0x1u<<3)
#define	RCC_SECCFGR4_AHBMSEC_B_0X0				(0x0u<<2)
#define	RCC_SECCFGR4_AHBMSEC_B_0X1				(0x1u<<2)
#define	RCC_SECCFGR4_ACLKNCSEC_B_0X0			(0x0u<<1)
#define	RCC_SECCFGR4_ACLKNCSEC_B_0X1			(0x1u<<1)
#define	RCC_SECCFGR4_ACLKNSEC_B_0X0				(0x0u<<0)
#define	RCC_SECCFGR4_ACLKNSEC_B_0X1				(0x1u<<0)

// PRIVCFGR4 Configuration

#define	RCC_PRIVCFGR4_NOCPV						(0x1u<<13)
#define	RCC_PRIVCFGR4_APB5PV					(0x1u<<12)
#define	RCC_PRIVCFGR4_APB4PV					(0x1u<<11)
#define	RCC_PRIVCFGR4_APB3PV					(0x1u<<10)
#define	RCC_PRIVCFGR4_APB2PV					(0x1u<<9)
#define	RCC_PRIVCFGR4_APB1PV					(0x1u<<8)
#define	RCC_PRIVCFGR4_AHB5PV					(0x1u<<7)
#define	RCC_PRIVCFGR4_AHB4PV					(0x1u<<6)
#define	RCC_PRIVCFGR4_AHB3PV					(0x1u<<5)
#define	RCC_PRIVCFGR4_AHB2PV					(0x1u<<4)
#define	RCC_PRIVCFGR4_AHB1PV					(0x1u<<3)
#define	RCC_PRIVCFGR4_AHBMPV					(0x1u<<2)
#define	RCC_PRIVCFGR4_ACLKNCPV					(0x1u<<1)
#define	RCC_PRIVCFGR4_ACLKNPV					(0x1u<<0)

