hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
#define	RCC_PRIVCFGR4_NOCPV_B_0X0				(0x0u<<13)
#define	RCC_PRIVCFGR4_NOCPV_B_0X1				(0x1u<<13)
#define	RCC_PRIVCFGR4_APB5PV_B_0X0				(0x0u<<12)
#define	RCC_PRIVCFGR4_APB5PV_B_0X1				(0x1u<<12)
#define	RCC_PRIVCFGR4_APB4PV_B_0X0				(0x0u<<11)
#define	RCC_PRIVCFGR4_APB4PV_B_0X1				(0x1u<<11)
#define	RCC_PRIVCFGR4_APB3PV_B_0X0				(0x0u<<10)
#define	RCC_PRIVCFGR4_APB3PV_B_0X1				(0x1u<<10)
#define	RCC_PRIVCFGR4_APB2PV_B_0X0				(0x0u<<9)
#define	RCC_PRIVCFGR4_APB2PV_B_0X1				(0x1u<<9)
#define	RCC_PRIVCFGR4_APB1PV_B_0X0				(0x0u<<8)
#define	RCC_PRIVCFGR4_APB1PV_B_0X1				(0x1u<<8)
#define	RCC_PRIVCFGR4_AHB5PV_B_0X0				(0x0u<<7)
#define	RCC_PRIVCFGR4_AHB5PV_B_0X1				(0x1u<<7)
#define	RCC_PRIVCFGR4_AHB4PV_B_0X0				(0x0u<<6)
#define	RCC_PRIVCFGR4_AHB4PV_B_0X1				(0x1u<<6)
#define	RCC_PRIVCFGR4_AHB3PV_B_0X0				(0x0u<<5)
#define	RCC_PRIVCFGR4_AHB3PV_B_0X1				(0x1u<<5)
#define	RCC_PRIVCFGR4_AHB2PV_B_0X0				(0x0u<<4)
#define	RCC_PRIVCFGR4_AHB2PV_B_0X1				(0x1u<<4)
#define	RCC_PRIVCFGR4_AHB1PV_B_0X0				(0x0u<<3)
#define	RCC_PRIVCFGR4_AHB1PV_B_0X1				(0x1u<<3)
#define	RCC_PRIVCFGR4_AHBMPV_B_0X0				(0x0u<<2)
#define	RCC_PRIVCFGR4_AHBMPV_B_0X1				(0x1u<<2)
#define	RCC_PRIVCFGR4_ACLKNCPV_B_0X0			(0x0u<<1)
#define	RCC_PRIVCFGR4_ACLKNCPV_B_0X1			(0x1u<<1)
#define	RCC_PRIVCFGR4_ACLKNPV_B_0X0				(0x0u<<0)
#define	RCC_PRIVCFGR4_ACLKNPV_B_0X1				(0x1u<<0)

// LOCKCFGR4 Configuration

#define	RCC_LOCKCFGR4_NOCLOCK					(0x1u<<13)
#define	RCC_LOCKCFGR4_APB5LOCK					(0x1u<<12)
#define	RCC_LOCKCFGR4_APB4LOCK					(0x1u<<11)
#define	RCC_LOCKCFGR4_APB3LOCK					(0x1u<<10)
#define	RCC_LOCKCFGR4_APB2LOCK					(0x1u<<9)
#define	RCC_LOCKCFGR4_APB1LOCK					(0x1u<<8)
#define	RCC_LOCKCFGR4_AHB5LOCK					(0x1u<<7)
#define	RCC_LOCKCFGR4_AHB4LOCK					(0x1u<<6)
#define	RCC_LOCKCFGR4_AHB3LOCK					(0x1u<<5)
#define	RCC_LOCKCFGR4_AHB2LOCK					(0x1u<<4)
#define	RCC_LOCKCFGR4_AHB1LOCK					(0x1u<<3)
#define	RCC_LOCKCFGR4_AHBMLOCK					(0x1u<<2)
#define	RCC_LOCKCFGR4_ACLKNCLOCK				(0x1u<<1)
#define	RCC_LOCKCFGR4_ACLKNLOCK					(0x1u<<0)

#define	RCC_LOCKCFGR4_NOCLOCK_B_0X0				(0x0u<<13)
#define	RCC_LOCKCFGR4_NOCLOCK_B_0X1				(0x1u<<13)
#define	RCC_LOCKCFGR4_APB5LOCK_B_0X0			(0x0u<<12)
#define	RCC_LOCKCFGR4_APB5LOCK_B_0X1			(0x1u<<12)
#define	RCC_LOCKCFGR4_APB4LOCK_B_0X0			(0x0u<<11)
#define	RCC_LOCKCFGR4_APB4LOCK_B_0X1			(0x1u<<11)
#define	RCC_LOCKCFGR4_APB3LOCK_B_0X0			(0x0u<<10)
#define	RCC_LOCKCFGR4_APB3LOCK_B_0X1			(0x1u<<10)
#define	RCC_LOCKCFGR4_APB2LOCK_B_0X0			(0x0u<<9)
#define	RCC_LOCKCFGR4_APB2LOCK_B_0X1			(0x1u<<9)
#define	RCC_LOCKCFGR4_APB1LOCK_B_0X0			(0x0u<<8)
#define	RCC_LOCKCFGR4_APB1LOCK_B_0X1			(0x1u<<8)
#define	RCC_LOCKCFGR4_AHB5LOCK_B_0X0			(0x0u<<7)
#define	RCC_LOCKCFGR4_AHB5LOCK_B_0X1			(0x1u<<7)
#define	RCC_LOCKCFGR4_AHB4LOCK_B_0X0			(0x0u<<6)
#define	RCC_LOCKCFGR4_AHB4LOCK_B_0X1			(0x1u<<6)
#define	RCC_LOCKCFGR4_AHB3LOCK_B_0X0			(0x0u<<5)
#define	RCC_LOCKCFGR4_AHB3LOCK_B_0X1			(0x1u<<5)
#define	RCC_LOCKCFGR4_AHB2LOCK_B_0X0			(0x0u<<4)
#define	RCC_LOCKCFGR4_AHB2LOCK_B_0X1			(0x1u<<4)
#define	RCC_LOCKCFGR4_AHB1LOCK_B_0X0			(0x0u<<3)
#define	RCC_LOCKCFGR4_AHB1LOCK_B_0X1			(0x1u<<3)
#define	RCC_LOCKCFGR4_AHBMLOCK_B_0X0			(0x0u<<2)
#define	RCC_LOCKCFGR4_AHBMLOCK_B_0X1			(0x1u<<2)
#define	RCC_LOCKCFGR4_ACLKNCLOCK_B_0X0			(0x0u<<1)
#define	RCC_LOCKCFGR4_ACLKNCLOCK_B_0X1			(0x1u<<1)
#define	RCC_LOCKCFGR4_ACLKNLOCK_B_0X0			(0x0u<<0)
#define	RCC_LOCKCFGR4_ACLKNLOCK_B_0X1			(0x1u<<0)

// PUBCFGR4 Configuration

#define	RCC_PUBCFGR4_NOCPUB						(0x1u<<13)
#define	RCC_PUBCFGR4_APB5PUB					(0x1u<<12)
#define	RCC_PUBCFGR4_APB4PUB					(0x1u<<11)
#define	RCC_PUBCFGR4_APB3PUB					(0x1u<<10)
#define	RCC_PUBCFGR4_APB2PUB					(0x1u<<9)
#define	RCC_PUBCFGR4_APB1PUB					(0x1u<<8)
#define	RCC_PUBCFGR4_AHB5PUB					(0x1u<<7)
#define	RCC_PUBCFGR4_AHB4PUB					(0x1u<<6)
#define	RCC_PUBCFGR4_AHB3PUB					(0x1u<<5)
#define	RCC_PUBCFGR4_AHB2PUB					(0x1u<<4)
#define	RCC_PUBCFGR4_AHB1PUB					(0x1u<<3)
#define	RCC_PUBCFGR4_AHBMPUB					(0x1u<<2)
#define	RCC_PUBCFGR4_ACLKNCPUB					(0x1u<<1)
#define	RCC_PUBCFGR4_ACLKNPUB					(0x1u<<0)

#define	RCC_PUBCFGR4_NOCPUB_B_0X0				(0x0u<<13)
#define	RCC_PUBCFGR4_NOCPUB_B_0X1				(0x1u<<13)
#define	RCC_PUBCFGR4_APB5PUB_B_0X0				(0x0u<<12)
#define	RCC_PUBCFGR4_APB5PUB_B_0X1				(0x1u<<12)
#define	RCC_PUBCFGR4_APB4PUB_B_0X0				(0x0u<<11)
#define	RCC_PUBCFGR4_APB4PUB_B_0X1				(0x1u<<11)
#define	RCC_PUBCFGR4_APB3PUB_B_0X0				(0x0u<<10)
#define	RCC_PUBCFGR4_APB3PUB_B_0X1				(0x1u<<10)
#define	RCC_PUBCFGR4_APB2PUB_B_0X0				(0x0u<<9)
#define	RCC_PUBCFGR4_APB2PUB_B_0X1				(0x1u<<9)
#define	RCC_PUBCFGR4_APB1PUB_B_0X0				(0x0u<<8)
#define	RCC_PUBCFGR4_APB1PUB_B_0X1				(0x1u<<8)
#define	RCC_PUBCFGR4_AHB5PUB_B_0X0				(0x0u<<7)
#define	RCC_PUBCFGR4_AHB5PUB_B_0X1				(0x1u<<7)
#define	RCC_PUBCFGR4_AHB4PUB_B_0X0				(0x0u<<6)
#define	RCC_PUBCFGR4_AHB4PUB_B_0X1				(0x1u<<6)
#define	RCC_PUBCFGR4_AHB3PUB_B_0X0				(0x0u<<5)
#define	RCC_PUBCFGR4_AHB3PUB_B_0X1				(0x1u<<5)
#define	RCC_PUBCFGR4_AHB2PUB_B_0X0				(0x0u<<4)
#define	RCC_PUBCFGR4_AHB2PUB_B_0X1				(0x1u<<4)
#define	RCC_PUBCFGR4_AHB1PUB_B_0X0				(0x0u<<3)
#define	RCC_PUBCFGR4_AHB1PUB_B_0X1				(0x1u<<3)
#define	RCC_PUBCFGR4_AHBMPUB_B_0X0				(0x0u<<2)
#define	RCC_PUBCFGR4_AHBMPUB_B_0X1				(0x1u<<2)
#define	RCC_PUBCFGR4_ACLKNCPUB_B_0X0			(0x0u<<1)
#define	RCC_PUBCFGR4_ACLKNCPUB_B_0X1			(0x1u<<1)
#define	RCC_PUBCFGR4_ACLKNPUB_B_0X0				(0x0u<<0)
#define	RCC_PUBCFGR4_ACLKNPUB_B_0X1				(0x1u<<0)

// PUBCFGR5 Configuration

#define	RCC_PUBCFGR5_VENCRAMPUB					(0x1u<<11)
#define	RCC_PUBCFGR5_NPUCACHERAMPUB				(0x1u<<10)
#define	RCC_PUBCFGR5_FLEXRAMPUB					(0x1u<<9)
#define	RCC_PUBCFGR5_AXISRAM2PUB				(0x1u<<8)
#define	RCC_PUBCFGR5_AXISRAM1PUB				(0x1u<<7)
#define	RCC_PUBCFGR5_BKPSRAMPUB					(0x1u<<6)
#define	RCC_PUBCFGR5_AHBSRAM2PUB				(0x1u<<5)
#define	RCC_PUBCFGR5_AHBSRAM1PUB				(0x1u<<4)
#define	RCC_PUBCFGR5_AXISRAM6PUB				(0x1u<<3)
#define	RCC_PUBCFGR5_AXISRAM5PUB				(0x1u<<2)
#define	RCC_PUBCFGR5_AXISRAM4PUB				(0x1u<<1)
#define	RCC_PUBCFGR5_AXISRAM3PUB				(0x1u<<0)

#define	RCC_PUBCFGR5_VENCRAMPUB_B_0X0			(0x0u<<11)
#define	RCC_PUBCFGR5_VENCRAMPUB_B_0X1			(0x1u<<11)
#define	RCC_PUBCFGR5_NPUCACHERAMPUB_B_0X0		(0x0u<<10)
#define	RCC_PUBCFGR5_NPUCACHERAMPUB_B_0X1		(0x1u<<10)
#define	RCC_PUBCFGR5_FLEXRAMPUB_B_0X0			(0x0u<<9)
#define	RCC_PUBCFGR5_FLEXRAMPUB_B_0X1			(0x1u<<9)
#define	RCC_PUBCFGR5_AXISRAM2PUB_B_0X0			(0x0u<<8)
#define	RCC_PUBCFGR5_AXISRAM2PUB_B_0X1			(0x1u<<8)
#define	RCC_PUBCFGR5_AXISRAM1PUB_B_0X0			(0x0u<<7)
#define	RCC_PUBCFGR5_AXISRAM1PUB_B_0X1			(0x1u<<7)
#define	RCC_PUBCFGR5_BKPSRAMPUB_B_0X0			(0x0u<<6)
#define	RCC_PUBCFGR5_BKPSRAMPUB_B_0X1			(0x1u<<6)
#define	RCC_PUBCFGR5_AHBSRAM2PUB_B_0X0			(0x0u<<5)
#define	RCC_PUBCFGR5_AHBSRAM2PUB_B_0X1			(0x1u<<5)
#define	RCC_PUBCFGR5_AHBSRAM1PUB_B_0X0			(0x0u<<4)
#define	RCC_PUBCFGR5_AHBSRAM1PUB_B_0X1			(0x1u<<4)
#define	RCC_PUBCFGR5_AXISRAM6PUB_B_0X0			(0x0u<<3)
#define	RCC_PUBCFGR5_AXISRAM6PUB_B_0X1			(0x1u<<3)
#define	RCC_PUBCFGR5_AXISRAM5PUB_B_0X0			(0x0u<<2)
#define	RCC_PUBCFGR5_AXISRAM5PUB_B_0X1			(0x1u<<2)
#define	RCC_PUBCFGR5_AXISRAM4PUB_B_0X0			(0x0u<<1)
#define	RCC_PUBCFGR5_AXISRAM4PUB_B_0X1			(0x1u<<1)
#define	RCC_PUBCFGR5_AXISRAM3PUB_B_0X0			(0x0u<<0)
#define	RCC_PUBCFGR5_AXISRAM3PUB_B_0X1			(0x1u<<0)

