hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
// CSR Configuration

#define	RCC_CSR_PLL4ONS							(0x1u<<11)
#define	RCC_CSR_PLL3ONS							(0x1u<<10)
#define	RCC_CSR_PLL2ONS							(0x1u<<9)
#define	RCC_CSR_PLL1ONS							(0x1u<<8)
#define	RCC_CSR_HSEONS							(0x1u<<4)
#define	RCC_CSR_HSIONS							(0x1u<<3)
#define	RCC_CSR_MSIONS							(0x1u<<2)
#define	RCC_CSR_LSEONS							(0x1u<<1)
#define	RCC_CSR_LSIONS							(0x1u<<0)

// STOPCSR Configuration

#define	RCC_STOPCSR_HSISTOPENS					(0x1u<<1)
#define	RCC_STOPCSR_MSISTOPENS					(0x1u<<0)

// BUSRSTSR Configuration

#define	RCC_BUSRSTSR_NOCRSTS					(0x1u<<13)
#define	RCC_BUSRSTSR_APB5RSTS					(0x1u<<12)
#define	RCC_BUSRSTSR_APB4RSTS					(0x1u<<11)
#define	RCC_BUSRSTSR_APB3RSTS					(0x1u<<10)
#define	RCC_BUSRSTSR_APB2RSTS					(0x1u<<9)
#define	RCC_BUSRSTSR_APB1RSTS					(0x1u<<8)
#define	RCC_BUSRSTSR_AHB5RSTS					(0x1u<<7)
#define	RCC_BUSRSTSR_AHB4RSTS					(0x1u<<6)
#define	RCC_BUSRSTSR_AHB3RSTS					(0x1u<<5)
#define	RCC_BUSRSTSR_AHB2RSTS					(0x1u<<4)
#define	RCC_BUSRSTSR_AHB1RSTS					(0x1u<<3)
#define	RCC_BUSRSTSR_AHBMRSTS					(0x1u<<2)
#define	RCC_BUSRSTSR_ACLKNRSTS					(0x1u<<0)

// MISCRSTSR Configuration

#define	RCC_MISCRSTSR_SDMMC2DLLRSTS				(0x1u<<8)
#define	RCC_MISCRSTSR_SDMMC1DLLRSTS				(0x1u<<7)
#define	RCC_MISCRSTSR_XSPIPHY2RSTS				(0x1u<<5)
#define	RCC_MISCRSTSR_XSPIPHY1RSTS				(0x1u<<4)
#define	RCC_MISCRSTSR_DBGRSTS					(0x1u<<0)

// MEMRSTSR Configuration

#define	RCC_MEMRSTSR_BOOTROMRSTS				(0x1u<<12)
#define	RCC_MEMRSTSR_VENCRAMRSTS				(0x1u<<11)
#define	RCC_MEMRSTSR_NPUCACHERAMRSTS			(0x1u<<10)
#define	RCC_MEMRSTSR_FLEXRAMRSTS				(0x1u<<9)
#define	RCC_MEMRSTSR_AXISRAM2RSTS				(0x1u<<8)
#define	RCC_MEMRSTSR_AXISRAM1RSTS				(0x1u<<7)
#define	RCC_MEMRSTSR_AHBSRAM2RSTS				(0x1u<<5)
#define	RCC_MEMRSTSR_AHBSRAM1RSTS				(0x1u<<4)
#define	RCC_MEMRSTSR_AXISRAM6RSTS				(0x1u<<3)
#define	RCC_MEMRSTSR_AXISRAM5RSTS				(0x1u<<2)
#define	RCC_MEMRSTSR_AXISRAM4RSTS				(0x1u<<1)
#define	RCC_MEMRSTSR_AXISRAM3RSTS				(0x1u<<0)

// AHB1RSTSR Configuration

#define	RCC_AHB1RSTSR_ADC12RSTS					(0x1u<<5)
#define	RCC_AHB1RSTSR_GPDMA1RSTS				(0x1u<<4)

// AHB2RSTSR Configuration

#define	RCC_AHB2RSTSR_ADF1RSTS					(0x1u<<17)
#define	RCC_AHB2RSTSR_MDF1RSTS					(0x1u<<16)
#define	RCC_AHB2RSTSR_RAMCFGRSTS				(0x1u<<12)

// AHB3RSTSR Configuration

#define	RCC_AHB3RSTSR_IACRSTS					(0x1u<<10)
#define	RCC_AHB3RSTSR_PKARSTS					(0x1u<<8)
#define	RCC_AHB3RSTSR_SAESRSTS					(0x1u<<4)
#define	RCC_AHB3RSTSR_CRYPRSTS					(0x1u<<2)
#define	RCC_AHB3RSTSR_HASHRSTS					(0x1u<<1)
#define	RCC_AHB3RSTSR_RNGRSTS					(0x1u<<0)

// AHB4RSTSR Configuration

#define	RCC_AHB4RSTSR_CRCRSTS					(0x1u<<19)
#define	RCC_AHB4RSTSR_PWRRSTS					(0x1u<<18)
#define	RCC_AHB4RSTSR_GPIOQRSTS					(0x1u<<16)
#define	RCC_AHB4RSTSR_GPIOPRSTS					(0x1u<<15)
#define	RCC_AHB4RSTSR_GPIOORSTS					(0x1u<<14)
#define	RCC_AHB4RSTSR_GPIONRSTS					(0x1u<<13)
#define	RCC_AHB4RSTSR_GPIOHRSTS					(0x1u<<7)
#define	RCC_AHB4RSTSR_GPIOGRSTS					(0x1u<<6)
#define	RCC_AHB4RSTSR_GPIOFRSTS					(0x1u<<5)
#define	RCC_AHB4RSTSR_GPIOERSTS					(0x1u<<4)
#define	RCC_AHB4RSTSR_GPIODRSTS					(0x1u<<3)
#define	RCC_AHB4RSTSR_GPIOCRSTS					(0x1u<<2)
#define	RCC_AHB4RSTSR_GPIOBRSTS					(0x1u<<1)
#define	RCC_AHB4RSTSR_GPIOARSTS					(0x1u<<0)

// AHB5RSTSR Configuration

#define	RCC_AHB5RSTSR_NPURSTS					(0x1u<<31)
#define	RCC_AHB5RSTSR_NPUCACHERSTS				(0x1u<<30)
#define	RCC_AHB5RSTSR_OTG2RSTS					(0x1u<<29)
#define	RCC_AHB5RSTSR_OTGPHY2RSTS				(0x1u<<28)
#define	RCC_AHB5RSTSR_OTGPHY1RSTS				(0x1u<<27)
#define	RCC_AHB5RSTSR_OTG1RSTS					(0x1u<<26)
#define	RCC_AHB5RSTSR_ETH1RSTS					(0x1u<<25)
#define	RCC_AHB5RSTSR_SYSCFGOTGHSPHY2RSTS		(0x1u<<24)
#define	RCC_AHB5RSTSR_SYSCFGOTGHSPHY1RSTS		(0x1u<<23)
#define	RCC_AHB5RSTSR_GPURSTS					(0x1u<<20)
#define	RCC_AHB5RSTSR_GFXMMURSTS				(0x1u<<19)
#define	RCC_AHB5RSTSR_MCE4RSTS					(0x1u<<18)
#define	RCC_AHB5RSTSR_XSPI3RSTS					(0x1u<<17)
#define	RCC_AHB5RSTSR_XSPIMRSTS					(0x1u<<13)
#define	RCC_AHB5RSTSR_XSPI2RSTS					(0x1u<<12)
#define	RCC_AHB5RSTSR_SDMMC1RSTS				(0x1u<<8)
#define	RCC_AHB5RSTSR_SDMMC2RSTS				(0x1u<<7)
#define	RCC_AHB5RSTSR_PSSIRSTS					(0x1u<<6)
#define	RCC_AHB5RSTSR_XSPI1RSTS					(0x1u<<5)
#define	RCC_AHB5RSTSR_FMCRSTS					(0x1u<<4)
#define	RCC_AHB5RSTSR_JPEGRSTS					(0x1u<<3)
#define	RCC_AHB5RSTSR_DMA2DRSTS					(0x1u<<1)
#define	RCC_AHB5RSTSR_HPDMA1RSTS				(0x1u<<0)

// APB1LRSTSR Configuration

#define	RCC_APB1LRSTSR_UART8RSTS				(0x1u<<31)
#define	RCC_APB1LRSTSR_UART7RSTS				(0x1u<<30)
#define	RCC_APB1LRSTSR_I3C2RSTS					(0x1u<<25)
#define	RCC_APB1LRSTSR_I3C1RSTS					(0x1u<<24)
#define	RCC_APB1LRSTSR_I2C3RSTS					(0x1u<<23)
#define	RCC_APB1LRSTSR_I2C2RSTS					(0x1u<<22)
#define	RCC_APB1LRSTSR_I2C1RSTS					(0x1u<<21)
#define	RCC_APB1LRSTSR_UART5RSTS				(0x1u<<20)
#define	RCC_APB1LRSTSR_UART4RSTS				(0x1u<<19)
#define	RCC_APB1LRSTSR_USART3RSTS				(0x1u<<18)
#define	RCC_APB1LRSTSR_USART2RSTS				(0x1u<<17)
#define	RCC_APB1LRSTSR_SPDIFRX1RSTS				(0x1u<<16)
#define	RCC_APB1LRSTSR_SPI3RSTS					(0x1u<<15)
#define	RCC_APB1LRSTSR_SPI2RSTS					(0x1u<<14)
#define	RCC_APB1LRSTSR_TIM11RSTS				(0x1u<<13)
#define	RCC_APB1LRSTSR_TIM10RSTS				(0x1u<<12)
#define	RCC_APB1LRSTSR_WWDGRSTS					(0x1u<<11)
#define	RCC_APB1LRSTSR_LPTIM1RSTS				(0x1u<<9)
#define	RCC_APB1LRSTSR_TIM14RSTS				(0x1u<<8)
#define	RCC_APB1LRSTSR_TIM13RSTS				(0x1u<<7)
#define	RCC_APB1LRSTSR_TIM12RSTS				(0x1u<<6)
#define	RCC_APB1LRSTSR_TIM7RSTS					(0x1u<<5)
#define	RCC_APB1LRSTSR_TIM6RSTS					(0x1u<<4)
#define	RCC_APB1LRSTSR_TIM5RSTS					(0x1u<<3)
#define	RCC_APB1LRSTSR_TIM4RSTS					(0x1u<<2)
#define	RCC_APB1LRSTSR_TIM3RSTS					(0x1u<<1)
#define	RCC_APB1LRSTSR_TIM2RSTS					(0x1u<<0)

// APB1HRSTSR Configuration

#define	RCC_APB1HRSTSR_UCPD1RSTS				(0x1u<<18)
#define	RCC_APB1HRSTSR_FDCANRSTS				(0x1u<<8)
#define	RCC_APB1HRSTSR_MDIOSRSTS				(0x1u<<5)

// APB2RSTSR Configuration

#define	RCC_APB2RSTSR_SAI2RSTS					(0x1u<<22)
#define	RCC_APB2RSTSR_SAI1RSTS					(0x1u<<21)
#define	RCC_APB2RSTSR_SPI5RSTS					(0x1u<<20)
#define	RCC_APB2RSTSR_TIM9RSTS					(0x1u<<19)
#define	RCC_APB2RSTSR_TIM17RSTS					(0x1u<<18)
#define	RCC_APB2RSTSR_TIM16RSTS					(0x1u<<17)
#define	RCC_APB2RSTSR_TIM15RSTS					(0x1u<<16)
#define	RCC_APB2RSTSR_TIM18RSTS					(0x1u<<15)
#define	RCC_APB2RSTSR_SPI4RSTS					(0x1u<<13)
#define	RCC_APB2RSTSR_SPI1RSTS					(0x1u<<12)
#define	RCC_APB2RSTSR_USART10RSTS				(0x1u<<7)
#define	RCC_APB2RSTSR_UART9RSTS					(0x1u<<6)
#define	RCC_APB2RSTSR_USART6RSTS				(0x1u<<5)
#define	RCC_APB2RSTSR_USART1RSTS				(0x1u<<4)
#define	RCC_APB2RSTSR_TIM8RSTS					(0x1u<<1)
#define	RCC_APB2RSTSR_TIM1RSTS					(0x1u<<0)

// APB4LRSTSR Configuration

#define	RCC_APB4LRSTSR_SERFRSTS					(0x1u<<31)
#define	RCC_APB4LRSTSR_R2GNPURSTS				(0x1u<<23)
#define	RCC_APB4LRSTSR_R2GRETRSTS				(0x1u<<22)
#define	RCC_APB4LRSTSR_RTCRSTS					(0x1u<<16)
#define	RCC_APB4LRSTSR_VREFBUFRSTS				(0x1u<<15)
#define	RCC_APB4LRSTSR_LPTIM5RSTS				(0x1u<<12)
#define	RCC_APB4LRSTSR_LPTIM4RSTS				(0x1u<<11)
#define	RCC_APB4LRSTSR_LPTIM3RSTS				(0x1u<<10)
#define	RCC_APB4LRSTSR_LPTIM2RSTS				(0x1u<<9)
#define	RCC_APB4LRSTSR_I2C4RSTS					(0x1u<<7)
#define	RCC_APB4LRSTSR_SPI6RSTS					(0x1u<<5)
#define	RCC_APB4LRSTSR_LPUART1RSTS				(0x1u<<3)
#define	RCC_APB4LRSTSR_HDPRSTS					(0x1u<<2)

// APB4HRSTSR Configuration

#define	RCC_APB4HRSTSR_BUSPERFMRSTS				(0x1u<<4)
#define	RCC_APB4HRSTSR_DTSRSTS					(0x1u<<2)
#define	RCC_APB4HRSTSR_SYSCFGRSTS				(0x1u<<0)

// APB5RSTSR Configuration

