hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
#define	RCC_APB5RSTSR_CSIRSTS					(0x1u<<6)
#define	RCC_APB5RSTSR_VENCRSTS					(0x1u<<5)
#define	RCC_APB5RSTSR_GFXTIMRSTS				(0x1u<<4)
#define	RCC_APB5RSTSR_DCMIPPRSTS				(0x1u<<2)
#define	RCC_APB5RSTSR_LTDCRSTS					(0x1u<<1)

// DIVENSR Configuration

#define	RCC_DIVENSR_IC20ENS						(0x1u<<19)
#define	RCC_DIVENSR_IC19ENS						(0x1u<<18)
#define	RCC_DIVENSR_IC18ENS						(0x1u<<17)
#define	RCC_DIVENSR_IC17ENS						(0x1u<<16)
#define	RCC_DIVENSR_IC16ENS						(0x1u<<15)
#define	RCC_DIVENSR_IC15ENS						(0x1u<<14)
#define	RCC_DIVENSR_IC14ENS						(0x1u<<13)
#define	RCC_DIVENSR_IC13ENS						(0x1u<<12)
#define	RCC_DIVENSR_IC12ENS						(0x1u<<11)
#define	RCC_DIVENSR_IC11ENS						(0x1u<<10)
#define	RCC_DIVENSR_IC10ENS						(0x1u<<9)
#define	RCC_DIVENSR_IC9ENS						(0x1u<<8)
#define	RCC_DIVENSR_IC8ENS						(0x1u<<7)
#define	RCC_DIVENSR_IC7ENS						(0x1u<<6)
#define	RCC_DIVENSR_IC6ENS						(0x1u<<5)
#define	RCC_DIVENSR_IC5ENS						(0x1u<<4)
#define	RCC_DIVENSR_IC4ENS						(0x1u<<3)
#define	RCC_DIVENSR_IC3ENS						(0x1u<<2)
#define	RCC_DIVENSR_IC2ENS						(0x1u<<1)
#define	RCC_DIVENSR_IC1ENS						(0x1u<<0)

// BUSENSR Configuration

#define	RCC_BUSENSR_APB5ENS						(0x1u<<12)
#define	RCC_BUSENSR_APB4ENS						(0x1u<<11)
#define	RCC_BUSENSR_APB3ENS						(0x1u<<10)
#define	RCC_BUSENSR_APB2ENS						(0x1u<<9)
#define	RCC_BUSENSR_APB1ENS						(0x1u<<8)
#define	RCC_BUSENSR_AHB5ENS						(0x1u<<7)
#define	RCC_BUSENSR_AHB4ENS						(0x1u<<6)
#define	RCC_BUSENSR_AHB3ENS						(0x1u<<5)
#define	RCC_BUSENSR_AHB2ENS						(0x1u<<4)
#define	RCC_BUSENSR_AHB1ENS						(0x1u<<3)
#define	RCC_BUSENSR_AHBMENS						(0x1u<<2)
#define	RCC_BUSENSR_ACLKNCENS					(0x1u<<1)
#define	RCC_BUSENSR_ACLKNENS					(0x1u<<0)

// MISCENSR Configuration

#define	RCC_MISCENSR_PERENS						(0x1u<<6)
#define	RCC_MISCENSR_XSPIPHYCOMPENS				(0x1u<<3)
#define	RCC_MISCENSR_MCO2ENS					(0x1u<<2)
#define	RCC_MISCENSR_MCO1ENS					(0x1u<<1)
#define	RCC_MISCENSR_DBGENS						(0x1u<<0)

// MEMENSR Configuration

#define	RCC_MEMENSR_BOOTROMENS					(0x1u<<12)
#define	RCC_MEMENSR_VENCRAMENS					(0x1u<<11)
#define	RCC_MEMENSR_NPUCACHERAMENS				(0x1u<<10)
#define	RCC_MEMENSR_FLEXRAMENS					(0x1u<<9)
#define	RCC_MEMENSR_AXISRAM2ENS					(0x1u<<8)
#define	RCC_MEMENSR_AXISRAM1ENS					(0x1u<<7)
#define	RCC_MEMENSR_BKPSRAMENS					(0x1u<<6)
#define	RCC_MEMENSR_AHBSRAM2ENS					(0x1u<<5)
#define	RCC_MEMENSR_AHBSRAM1ENS					(0x1u<<4)
#define	RCC_MEMENSR_AXISRAM6ENS					(0x1u<<3)
#define	RCC_MEMENSR_AXISRAM5ENS					(0x1u<<2)
#define	RCC_MEMENSR_AXISRAM4ENS					(0x1u<<1)
#define	RCC_MEMENSR_AXISRAM3ENS					(0x1u<<0)

// AHB1ENSR Configuration

#define	RCC_AHB1ENSR_ADC12ENS					(0x1u<<5)
#define	RCC_AHB1ENSR_GPDMA1ENS					(0x1u<<4)

// AHB2ENSR Configuration

#define	RCC_AHB2ENSR_ADF1ENS					(0x1u<<17)
#define	RCC_AHB2ENSR_MDF1ENS					(0x1u<<16)
#define	RCC_AHB2ENSR_RAMCFGENS					(0x1u<<12)

// AHB3ENSR Configuration

#define	RCC_AHB3ENSR_RISAFENS					(0x1u<<14)
#define	RCC_AHB3ENSR_IACENS						(0x1u<<10)
#define	RCC_AHB3ENSR_RIFSCENS					(0x1u<<9)
#define	RCC_AHB3ENSR_PKAENS						(0x1u<<8)
#define	RCC_AHB3ENSR_SAESENS					(0x1u<<4)
#define	RCC_AHB3ENSR_CRYPENS					(0x1u<<2)
#define	RCC_AHB3ENSR_HASHENS					(0x1u<<1)
#define	RCC_AHB3ENSR_RNGENS						(0x1u<<0)

// AHB4ENSR Configuration

#define	RCC_AHB4ENSR_CRCENS						(0x1u<<19)
#define	RCC_AHB4ENSR_PWRENS						(0x1u<<18)
#define	RCC_AHB4ENSR_GPIOQENS					(0x1u<<16)
#define	RCC_AHB4ENSR_GPIOPENS					(0x1u<<15)
#define	RCC_AHB4ENSR_GPIOOENS					(0x1u<<14)
#define	RCC_AHB4ENSR_GPIONENS					(0x1u<<13)
#define	RCC_AHB4ENSR_GPIOHENS					(0x1u<<7)
#define	RCC_AHB4ENSR_GPIOGENS					(0x1u<<6)
#define	RCC_AHB4ENSR_GPIOFENS					(0x1u<<5)
#define	RCC_AHB4ENSR_GPIOEENS					(0x1u<<4)
#define	RCC_AHB4ENSR_GPIODENS					(0x1u<<3)
#define	RCC_AHB4ENSR_GPIOCENS					(0x1u<<2)
#define	RCC_AHB4ENSR_GPIOBENS					(0x1u<<1)
#define	RCC_AHB4ENSR_GPIOAENS					(0x1u<<0)

// AHB5ENSR Configuration

#define	RCC_AHB5ENSR_NPUENS						(0x1u<<31)
#define	RCC_AHB5ENSR_NPUCACHEENS				(0x1u<<30)
#define	RCC_AHB5ENSR_OTG2ENS					(0x1u<<29)
#define	RCC_AHB5ENSR_OTGPHY2ENS					(0x1u<<28)
#define	RCC_AHB5ENSR_OTGPHY1ENS					(0x1u<<27)
#define	RCC_AHB5ENSR_OTG1ENS					(0x1u<<26)
#define	RCC_AHB5ENSR_ETH1ENS					(0x1u<<25)
#define	RCC_AHB5ENSR_ETH1RXENS					(0x1u<<24)
#define	RCC_AHB5ENSR_ETH1TXENS					(0x1u<<23)
#define	RCC_AHB5ENSR_ETH1MACENS					(0x1u<<22)
#define	RCC_AHB5ENSR_GPUENS						(0x1u<<20)
#define	RCC_AHB5ENSR_GFXMMUENS					(0x1u<<19)
#define	RCC_AHB5ENSR_MCE4ENS					(0x1u<<18)
#define	RCC_AHB5ENSR_XSPI3ENS					(0x1u<<17)
#define	RCC_AHB5ENSR_MCE3ENS					(0x1u<<16)
#define	RCC_AHB5ENSR_MCE2ENS					(0x1u<<15)
#define	RCC_AHB5ENSR_MCE1ENS					(0x1u<<14)
#define	RCC_AHB5ENSR_XSPIMENS					(0x1u<<13)
#define	RCC_AHB5ENSR_XSPI2ENS					(0x1u<<12)
#define	RCC_AHB5ENSR_SDMMC1ENS					(0x1u<<8)
#define	RCC_AHB5ENSR_SDMMC2ENS					(0x1u<<7)
#define	RCC_AHB5ENSR_PSSIENS					(0x1u<<6)
#define	RCC_AHB5ENSR_XSPI1ENS					(0x1u<<5)
#define	RCC_AHB5ENSR_FMCENS						(0x1u<<4)
#define	RCC_AHB5ENSR_JPEGENS					(0x1u<<3)
#define	RCC_AHB5ENSR_DMA2DENS					(0x1u<<1)
#define	RCC_AHB5ENSR_HPDMA1ENS					(0x1u<<0)

// APB1LENSR Configuration

#define	RCC_APB1LENSR_UART8ENS					(0x1u<<31)
#define	RCC_APB1LENSR_UART7ENS					(0x1u<<30)
#define	RCC_APB1LENSR_I3C2ENS					(0x1u<<25)
#define	RCC_APB1LENSR_I3C1ENS					(0x1u<<24)
#define	RCC_APB1LENSR_I2C3ENS					(0x1u<<23)
#define	RCC_APB1LENSR_I2C2ENS					(0x1u<<22)
#define	RCC_APB1LENSR_I2C1ENS					(0x1u<<21)
#define	RCC_APB1LENSR_UART5ENS					(0x1u<<20)
#define	RCC_APB1LENSR_UART4ENS					(0x1u<<19)
#define	RCC_APB1LENSR_USART3ENS					(0x1u<<18)
#define	RCC_APB1LENSR_USART2ENS					(0x1u<<17)
#define	RCC_APB1LENSR_SPDIFRX1ENS				(0x1u<<16)
#define	RCC_APB1LENSR_SPI3ENS					(0x1u<<15)
#define	RCC_APB1LENSR_SPI2ENS					(0x1u<<14)
#define	RCC_APB1LENSR_TIM11ENS					(0x1u<<13)
#define	RCC_APB1LENSR_TIM10ENS					(0x1u<<12)
#define	RCC_APB1LENSR_WWDGENS					(0x1u<<11)
#define	RCC_APB1LENSR_LPTIM1ENS					(0x1u<<9)
#define	RCC_APB1LENSR_TIM14ENS					(0x1u<<8)
#define	RCC_APB1LENSR_TIM13ENS					(0x1u<<7)
#define	RCC_APB1LENSR_TIM12ENS					(0x1u<<6)
#define	RCC_APB1LENSR_TIM7ENS					(0x1u<<5)
#define	RCC_APB1LENSR_TIM6ENS					(0x1u<<4)
#define	RCC_APB1LENSR_TIM5ENS					(0x1u<<3)
#define	RCC_APB1LENSR_TIM4ENS					(0x1u<<2)
#define	RCC_APB1LENSR_TIM3ENS					(0x1u<<1)
#define	RCC_APB1LENSR_TIM2ENS					(0x1u<<0)

// APB1HENSR Configuration

#define	RCC_APB1HENSR_UCPD1ENS					(0x1u<<18)
#define	RCC_APB1HENSR_FDCANENS					(0x1u<<8)
#define	RCC_APB1HENSR_MDIOSENS					(0x1u<<5)

