hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
// APB2ENSR Configuration

#define	RCC_APB2ENSR_SAI2ENS					(0x1u<<22)
#define	RCC_APB2ENSR_SAI1ENS					(0x1u<<21)
#define	RCC_APB2ENSR_SPI5ENS					(0x1u<<20)
#define	RCC_APB2ENSR_TIM9ENS					(0x1u<<19)
#define	RCC_APB2ENSR_TIM17ENS					(0x1u<<18)
#define	RCC_APB2ENSR_TIM16ENS					(0x1u<<17)
#define	RCC_APB2ENSR_TIM15ENS					(0x1u<<16)
#define	RCC_APB2ENSR_TIM18ENS					(0x1u<<15)
#define	RCC_APB2ENSR_SPI4ENS					(0x1u<<13)
#define	RCC_APB2ENSR_SPI1ENS					(0x1u<<12)
#define	RCC_APB2ENSR_USART10ENS					(0x1u<<7)
#define	RCC_APB2ENSR_UART9ENS					(0x1u<<6)
#define	RCC_APB2ENSR_USART6ENS					(0x1u<<5)
#define	RCC_APB2ENSR_USART1ENS					(0x1u<<4)
#define	RCC_APB2ENSR_TIM8ENS					(0x1u<<1)
#define	RCC_APB2ENSR_TIM1ENS					(0x1u<<0)

// APB3ENSR Configuration

#define	RCC_APB3ENSR_DFTENS						(0x1u<<2)

// APB4LENSR Configuration

#define	RCC_APB4LENSR_SERFENS					(0x1u<<31)
#define	RCC_APB4LENSR_R2GNPUENS					(0x1u<<23)
#define	RCC_APB4LENSR_R2GRETENS					(0x1u<<22)
#define	RCC_APB4LENSR_RTCAPBENS					(0x1u<<17)
#define	RCC_APB4LENSR_RTCENS					(0x1u<<16)
#define	RCC_APB4LENSR_VREFBUFENS				(0x1u<<15)
#define	RCC_APB4LENSR_LPTIM5ENS					(0x1u<<12)
#define	RCC_APB4LENSR_LPTIM4ENS					(0x1u<<11)
#define	RCC_APB4LENSR_LPTIM3ENS					(0x1u<<10)
#define	RCC_APB4LENSR_LPTIM2ENS					(0x1u<<9)
#define	RCC_APB4LENSR_I2C4ENS					(0x1u<<7)
#define	RCC_APB4LENSR_SPI6ENS					(0x1u<<5)
#define	RCC_APB4LENSR_LPUART1ENS				(0x1u<<3)
#define	RCC_APB4LENSR_HDPENS					(0x1u<<2)

// APB4HENSR Configuration

#define	RCC_APB4HENSR_BUSPERFMENS				(0x1u<<4)
#define	RCC_APB4HENSR_DTSENS					(0x1u<<2)
#define	RCC_APB4HENSR_BSECENS					(0x1u<<1)
#define	RCC_APB4HENSR_SYSCFGENS					(0x1u<<0)

// APB5ENSR Configuration

#define	RCC_APB5ENSR_CSIENS						(0x1u<<6)
#define	RCC_APB5ENSR_VENCENS					(0x1u<<5)
#define	RCC_APB5ENSR_GFXTIMENS					(0x1u<<4)
#define	RCC_APB5ENSR_DCMIPPENS					(0x1u<<2)
#define	RCC_APB5ENSR_LTDCENS					(0x1u<<1)

// DIVLPENSR Configuration

#define	RCC_DIVLPENSR_IC20LPENS					(0x1u<<19)
#define	RCC_DIVLPENSR_IC19LPENS					(0x1u<<18)
#define	RCC_DIVLPENSR_IC18LPENS					(0x1u<<17)
#define	RCC_DIVLPENSR_IC17LPENS					(0x1u<<16)
#define	RCC_DIVLPENSR_IC16LPENS					(0x1u<<15)
#define	RCC_DIVLPENSR_IC15LPENS					(0x1u<<14)
#define	RCC_DIVLPENSR_IC14LPENS					(0x1u<<13)
#define	RCC_DIVLPENSR_IC13LPENS					(0x1u<<12)
#define	RCC_DIVLPENSR_IC12LPENS					(0x1u<<11)
#define	RCC_DIVLPENSR_IC11LPENS					(0x1u<<10)
#define	RCC_DIVLPENSR_IC10LPENS					(0x1u<<9)
#define	RCC_DIVLPENSR_IC9LPENS					(0x1u<<8)
#define	RCC_DIVLPENSR_IC8LPENS					(0x1u<<7)
#define	RCC_DIVLPENSR_IC7LPENS					(0x1u<<6)
#define	RCC_DIVLPENSR_IC6LPENS					(0x1u<<5)
#define	RCC_DIVLPENSR_IC5LPENS					(0x1u<<4)
#define	RCC_DIVLPENSR_IC4LPENS					(0x1u<<3)
#define	RCC_DIVLPENSR_IC3LPENS					(0x1u<<2)
#define	RCC_DIVLPENSR_IC2LPENS					(0x1u<<1)
#define	RCC_DIVLPENSR_IC1LPENS					(0x1u<<0)

// BUSLPENSR Configuration

#define	RCC_BUSLPENSR_APB5LPENS					(0x1u<<12)
#define	RCC_BUSLPENSR_APB4LPENS					(0x1u<<11)
#define	RCC_BUSLPENSR_APB3LPENS					(0x1u<<10)
#define	RCC_BUSLPENSR_APB2LPENS					(0x1u<<9)
#define	RCC_BUSLPENSR_APB1LPENS					(0x1u<<8)
#define	RCC_BUSLPENSR_AHB5LPENS					(0x1u<<7)
#define	RCC_BUSLPENSR_AHB4LPENS					(0x1u<<6)
#define	RCC_BUSLPENSR_AHB3LPENS					(0x1u<<5)
#define	RCC_BUSLPENSR_AHB2LPENS					(0x1u<<4)
#define	RCC_BUSLPENSR_AHB1LPENS					(0x1u<<3)
#define	RCC_BUSLPENSR_AHBMLPENS					(0x1u<<2)
#define	RCC_BUSLPENSR_ACLKNCLPENS				(0x1u<<1)
#define	RCC_BUSLPENSR_ACLKNLPENS				(0x1u<<0)

// MISCLPENSR Configuration

#define	RCC_MISCLPENSR_PERLPENS					(0x1u<<6)
#define	RCC_MISCLPENSR_XSPIPHYCOMPLPENS			(0x1u<<3)
#define	RCC_MISCLPENSR_DBGLPENS					(0x1u<<0)

// MEMLPENSR Configuration

#define	RCC_MEMLPENSR_BOOTROMLPENS				(0x1u<<12)
#define	RCC_MEMLPENSR_VENCRAMLPENS				(0x1u<<11)
#define	RCC_MEMLPENSR_NPUCACHERAMLPENS			(0x1u<<10)
#define	RCC_MEMLPENSR_FLEXRAMLPENS				(0x1u<<9)
#define	RCC_MEMLPENSR_AXISRAM2LPENS				(0x1u<<8)
#define	RCC_MEMLPENSR_AXISRAM1LPENS				(0x1u<<7)
#define	RCC_MEMLPENSR_BKPSRAMLPENS				(0x1u<<6)
#define	RCC_MEMLPENSR_AHBSRAM2LPENS				(0x1u<<5)
#define	RCC_MEMLPENSR_AHBSRAM1LPENS				(0x1u<<4)
#define	RCC_MEMLPENSR_AXISRAM6LPENS				(0x1u<<3)
#define	RCC_MEMLPENSR_AXISRAM5LPENS				(0x1u<<2)
#define	RCC_MEMLPENSR_AXISRAM4LPENS				(0x1u<<1)
#define	RCC_MEMLPENSR_AXISRAM3LPENS				(0x1u<<0)

// AHB1LPENSR Configuration

#define	RCC_AHB1LPENSR_ADC12LPENS				(0x1u<<5)
#define	RCC_AHB1LPENSR_GPDMA1LPENS				(0x1u<<4)

// AHB2LPENSR Configuration

#define	RCC_AHB2LPENSR_ADF1LPENS				(0x1u<<17)
#define	RCC_AHB2LPENSR_MDF1LPENS				(0x1u<<16)
#define	RCC_AHB2LPENSR_RAMCFGLPENS				(0x1u<<12)

// AHB3LPENSR Configuration

#define	RCC_AHB3LPENSR_RISAFLPENS				(0x1u<<14)
#define	RCC_AHB3LPENSR_IACLPENS					(0x1u<<10)
#define	RCC_AHB3LPENSR_RIFSCLPENS				(0x1u<<9)
#define	RCC_AHB3LPENSR_PKALPENS					(0x1u<<8)
#define	RCC_AHB3LPENSR_SAESLPENS				(0x1u<<4)
#define	RCC_AHB3LPENSR_CRYPLPENS				(0x1u<<2)
#define	RCC_AHB3LPENSR_HASHLPENS				(0x1u<<1)
#define	RCC_AHB3LPENSR_RNGLPENS					(0x1u<<0)

// AHB4LPENSR Configuration

#define	RCC_AHB4LPENSR_CRCLPENS					(0x1u<<19)
#define	RCC_AHB4LPENSR_PWRLPENS					(0x1u<<18)
#define	RCC_AHB4LPENSR_GPIOQLPENS				(0x1u<<16)
#define	RCC_AHB4LPENSR_GPIOPLPENS				(0x1u<<15)
#define	RCC_AHB4LPENSR_GPIOOLPENS				(0x1u<<14)
#define	RCC_AHB4LPENSR_GPIONLPENS				(0x1u<<13)
#define	RCC_AHB4LPENSR_GPIOHLPENS				(0x1u<<7)
#define	RCC_AHB4LPENSR_GPIOGLPENS				(0x1u<<6)
#define	RCC_AHB4LPENSR_GPIOFLPENS				(0x1u<<5)
#define	RCC_AHB4LPENSR_GPIOELPENS				(0x1u<<4)
#define	RCC_AHB4LPENSR_GPIODLPENS				(0x1u<<3)
#define	RCC_AHB4LPENSR_GPIOCLPENS				(0x1u<<2)
#define	RCC_AHB4LPENSR_GPIOBLPENS				(0x1u<<1)
#define	RCC_AHB4LPENSR_GPIOALPENS				(0x1u<<0)

// AHB5LPENSR Configuration

#define	RCC_AHB5LPENSR_NPULPENS					(0x1u<<31)
#define	RCC_AHB5LPENSR_NPUCACHELPENS			(0x1u<<30)
#define	RCC_AHB5LPENSR_OTG2LPENS				(0x1u<<29)
#define	RCC_AHB5LPENSR_OTGPHY2LPENS				(0x1u<<28)
#define	RCC_AHB5LPENSR_OTGPHY1LPENS				(0x1u<<27)
#define	RCC_AHB5LPENSR_OTG1LPENS				(0x1u<<26)
#define	RCC_AHB5LPENSR_ETH1LPENS				(0x1u<<25)
#define	RCC_AHB5LPENSR_ETH1RXLPENS				(0x1u<<24)
#define	RCC_AHB5LPENSR_ETH1TXLPENS				(0x1u<<23)
#define	RCC_AHB5LPENSR_ETH1MACLPENS				(0x1u<<22)
#define	RCC_AHB5LPENSR_GPULPENS					(0x1u<<20)
#define	RCC_AHB5LPENSR_GFXMMULPENS				(0x1u<<19)
#define	RCC_AHB5LPENSR_MCE4LPENS				(0x1u<<18)
#define	RCC_AHB5LPENSR_XSPI3LPENS				(0x1u<<17)
#define	RCC_AHB5LPENSR_MCE3LPENS				(0x1u<<16)
#define	RCC_AHB5LPENSR_MCE2LPENS				(0x1u<<15)
#define	RCC_AHB5LPENSR_MCE1LPENS				(0x1u<<14)
#define	RCC_AHB5LPENSR_XSPIMLPENS				(0x1u<<13)
#define	RCC_AHB5LPENSR_XSPI2LPENS				(0x1u<<12)
#define	RCC_AHB5LPENSR_SDMMC1LPENS				(0x1u<<8)
#define	RCC_AHB5LPENSR_SDMMC2LPENS				(0x1u<<7)
#define	RCC_AHB5LPENSR_PSSILPENS				(0x1u<<6)
#define	RCC_AHB5LPENSR_XSPI1LPENS				(0x1u<<5)
#define	RCC_AHB5LPENSR_FMCLPENS					(0x1u<<4)
#define	RCC_AHB5LPENSR_JPEGLPENS				(0x1u<<3)
#define	RCC_AHB5LPENSR_DMA2DLPENS				(0x1u<<1)
#define	RCC_AHB5LPENSR_HPDMA1LPENS				(0x1u<<0)

// APB1LLPENSR Configuration

#define	RCC_APB1LLPENSR_UART8LPENS				(0x1u<<31)
#define	RCC_APB1LLPENSR_UART7LPENS				(0x1u<<30)
#define	RCC_APB1LLPENSR_I3C2LPENS				(0x1u<<25)
#define	RCC_APB1LLPENSR_I3C1LPENS				(0x1u<<24)
#define	RCC_APB1LLPENSR_I2C3LPENS				(0x1u<<23)
#define	RCC_APB1LLPENSR_I2C2LPENS				(0x1u<<22)
#define	RCC_APB1LLPENSR_I2C1LPENS				(0x1u<<21)
#define	RCC_APB1LLPENSR_UART5LPENS				(0x1u<<20)
#define	RCC_APB1LLPENSR_UART4LPENS				(0x1u<<19)
#define	RCC_APB1LLPENSR_USART3LPENS				(0x1u<<18)
#define	RCC_APB1LLPENSR_USART2LPENS				(0x1u<<17)
#define	RCC_APB1LLPENSR_SPDIFRX1LPENS			(0x1u<<16)
#define	RCC_APB1LLPENSR_SPI3LPENS				(0x1u<<15)
#define	RCC_APB1LLPENSR_SPI2LPENS				(0x1u<<14)
#define	RCC_APB1LLPENSR_TIM11LPENS				(0x1u<<13)
#define	RCC_APB1LLPENSR_TIM10LPENS				(0x1u<<12)
#define	RCC_APB1LLPENSR_WWDGLPENS				(0x1u<<11)
#define	RCC_APB1LLPENSR_LPTIM1LPENS				(0x1u<<9)
#define	RCC_APB1LLPENSR_TIM14LPENS				(0x1u<<8)
#define	RCC_APB1LLPENSR_TIM13LPENS				(0x1u<<7)
#define	RCC_APB1LLPENSR_TIM12LPENS				(0x1u<<6)
#define	RCC_APB1LLPENSR_TIM7LPENS				(0x1u<<5)
#define	RCC_APB1LLPENSR_TIM6LPENS				(0x1u<<4)
#define	RCC_APB1LLPENSR_TIM5LPENS				(0x1u<<3)
#define	RCC_APB1LLPENSR_TIM4LPENS				(0x1u<<2)
#define	RCC_APB1LLPENSR_TIM3LPENS				(0x1u<<1)
#define	RCC_APB1LLPENSR_TIM2LPENS				(0x1u<<0)

// APB1HLPENSR Configuration

#define	RCC_APB1HLPENSR_UCPD1LPENS				(0x1u<<18)
#define	RCC_APB1HLPENSR_FDCANLPENS				(0x1u<<8)
#define	RCC_APB1HLPENSR_MDIOSLPENS				(0x1u<<5)

// APB2LPENSR Configuration

#define	RCC_APB2LPENSR_SAI2LPENS				(0x1u<<22)
#define	RCC_APB2LPENSR_SAI1LPENS				(0x1u<<21)
#define	RCC_APB2LPENSR_SPI5LPENS				(0x1u<<20)
#define	RCC_APB2LPENSR_TIM9LPENS				(0x1u<<19)
#define	RCC_APB2LPENSR_TIM17LPENS				(0x1u<<18)
#define	RCC_APB2LPENSR_TIM16LPENS				(0x1u<<17)
#define	RCC_APB2LPENSR_TIM15LPENS				(0x1u<<16)
#define	RCC_APB2LPENSR_TIM18LPENS				(0x1u<<15)
#define	RCC_APB2LPENSR_SPI4LPENS				(0x1u<<13)
#define	RCC_APB2LPENSR_SPI1LPENS				(0x1u<<12)
#define	RCC_APB2LPENSR_USART10LPENS				(0x1u<<7)
#define	RCC_APB2LPENSR_UART9LPENS				(0x1u<<6)
#define	RCC_APB2LPENSR_USART6LPENS				(0x1u<<5)
#define	RCC_APB2LPENSR_USART1LPENS				(0x1u<<4)
#define	RCC_APB2LPENSR_TIM8LPENS				(0x1u<<1)
#define	RCC_APB2LPENSR_TIM1LPENS				(0x1u<<0)

// APB3LPENSR Configuration

#define	RCC_APB3LPENSR_DFTLPENS					(0x1u<<2)

// APB4LLPENSR Configuration

