hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
#define	RCC_APB4LLPENSR_SERFLPENS				(0x1u<<31)
#define	RCC_APB4LLPENSR_R2GNPULPENS				(0x1u<<23)
#define	RCC_APB4LLPENSR_R2GRETLPENS				(0x1u<<22)
#define	RCC_APB4LLPENSR_RTCAPBLPENS				(0x1u<<17)
#define	RCC_APB4LLPENSR_RTCLPENS				(0x1u<<16)
#define	RCC_APB4LLPENSR_VREFBUFLPENS			(0x1u<<15)
#define	RCC_APB4LLPENSR_LPTIM5LPENS				(0x1u<<12)
#define	RCC_APB4LLPENSR_LPTIM4LPENS				(0x1u<<11)
#define	RCC_APB4LLPENSR_LPTIM3LPENS				(0x1u<<10)
#define	RCC_APB4LLPENSR_LPTIM2LPENS				(0x1u<<9)
#define	RCC_APB4LLPENSR_I2C4LPENS				(0x1u<<7)
#define	RCC_APB4LLPENSR_SPI6LPENS				(0x1u<<5)
#define	RCC_APB4LLPENSR_LPUART1LPENS			(0x1u<<3)
#define	RCC_APB4LLPENSR_HDPLPENS				(0x1u<<2)

// APB4HLPENSR Configuration

#define	RCC_APB4HLPENSR_BUSPERFMLPENS			(0x1u<<4)
#define	RCC_APB4HLPENSR_DTSLPENS				(0x1u<<2)
#define	RCC_APB4HLPENSR_BSECLPENS				(0x1u<<1)
#define	RCC_APB4HLPENSR_SYSCFGLPENS				(0x1u<<0)

// APB5LPENSR Configuration

#define	RCC_APB5LPENSR_CSILPENS					(0x1u<<6)
#define	RCC_APB5LPENSR_VENCLPENS				(0x1u<<5)
#define	RCC_APB5LPENSR_GFXTIMLPENS				(0x1u<<4)
#define	RCC_APB5LPENSR_DCMIPPLPENS				(0x1u<<2)
#define	RCC_APB5LPENSR_LTDCLPENS				(0x1u<<1)

// PRIVCFGSR0 Configuration

#define	RCC_PRIVCFGSR0_HSEPVS					(0x1u<<4)
#define	RCC_PRIVCFGSR0_HSIPVS					(0x1u<<3)
#define	RCC_PRIVCFGSR0_MSIPVS					(0x1u<<2)
#define	RCC_PRIVCFGSR0_LSEPVS					(0x1u<<1)
#define	RCC_PRIVCFGSR0_LSIPVS					(0x1u<<0)

// PUBCFGSR0 Configuration

#define	RCC_PUBCFGSR0_HSEPUBS					(0x1u<<4)
#define	RCC_PUBCFGSR0_HSIPUBS					(0x1u<<3)
#define	RCC_PUBCFGSR0_MSIPUBS					(0x1u<<2)
#define	RCC_PUBCFGSR0_LSEPUBS					(0x1u<<1)
#define	RCC_PUBCFGSR0_LSIPUBS					(0x1u<<0)

// PRIVCFGSR1 Configuration

#define	RCC_PRIVCFGSR1_PLL4PVS					(0x1u<<3)
#define	RCC_PRIVCFGSR1_PLL3PVS					(0x1u<<2)
#define	RCC_PRIVCFGSR1_PLL2PVS					(0x1u<<1)
#define	RCC_PRIVCFGSR1_PLL1PVS					(0x1u<<0)

// PUBCFGSR1 Configuration

#define	RCC_PUBCFGSR1_PLL4PUBS					(0x1u<<3)
#define	RCC_PUBCFGSR1_PLL3PUBS					(0x1u<<2)
#define	RCC_PUBCFGSR1_PLL2PUBS					(0x1u<<1)
#define	RCC_PUBCFGSR1_PLL1PUBS					(0x1u<<0)

// PRIVCFGSR2 Configuration

#define	RCC_PRIVCFGSR2_IC20PVS					(0x1u<<19)
#define	RCC_PRIVCFGSR2_IC19PVS					(0x1u<<18)
#define	RCC_PRIVCFGSR2_IC18PVS					(0x1u<<17)
#define	RCC_PRIVCFGSR2_IC17PVS					(0x1u<<16)
#define	RCC_PRIVCFGSR2_IC16PVS					(0x1u<<15)
#define	RCC_PRIVCFGSR2_IC15PVS					(0x1u<<14)
#define	RCC_PRIVCFGSR2_IC14PVS					(0x1u<<13)
#define	RCC_PRIVCFGSR2_IC13PVS					(0x1u<<12)
#define	RCC_PRIVCFGSR2_IC12PVS					(0x1u<<11)
#define	RCC_PRIVCFGSR2_IC11PVS					(0x1u<<10)
#define	RCC_PRIVCFGSR2_IC10PVS					(0x1u<<9)
#define	RCC_PRIVCFGSR2_IC9PVS					(0x1u<<8)
#define	RCC_PRIVCFGSR2_IC8PVS					(0x1u<<7)
#define	RCC_PRIVCFGSR2_IC7PVS					(0x1u<<6)
#define	RCC_PRIVCFGSR2_IC6PVS					(0x1u<<5)
#define	RCC_PRIVCFGSR2_IC5PVS					(0x1u<<4)
#define	RCC_PRIVCFGSR2_IC4PVS					(0x1u<<3)
#define	RCC_PRIVCFGSR2_IC3PVS					(0x1u<<2)
#define	RCC_PRIVCFGSR2_IC2PVS					(0x1u<<1)
#define	RCC_PRIVCFGSR2_IC1PVS					(0x1u<<0)

// PUBCFGSR2 Configuration

#define	RCC_PUBCFGSR2_IC20PUBS					(0x1u<<19)
#define	RCC_PUBCFGSR2_IC19PUBS					(0x1u<<18)
#define	RCC_PUBCFGSR2_IC18PUBS					(0x1u<<17)
#define	RCC_PUBCFGSR2_IC17PUBS					(0x1u<<16)
#define	RCC_PUBCFGSR2_IC16PUBS					(0x1u<<15)
#define	RCC_PUBCFGSR2_IC15PUBS					(0x1u<<14)
#define	RCC_PUBCFGSR2_IC14PUBS					(0x1u<<13)
#define	RCC_PUBCFGSR2_IC13PUBS					(0x1u<<12)
#define	RCC_PUBCFGSR2_IC12PUBS					(0x1u<<11)
#define	RCC_PUBCFGSR2_IC11PUBS					(0x1u<<10)
#define	RCC_PUBCFGSR2_IC10PUBS					(0x1u<<9)
#define	RCC_PUBCFGSR2_IC9PUBS					(0x1u<<8)
#define	RCC_PUBCFGSR2_IC8PUBS					(0x1u<<7)
#define	RCC_PUBCFGSR2_IC7PUBS					(0x1u<<6)
#define	RCC_PUBCFGSR2_IC6PUBS					(0x1u<<5)
#define	RCC_PUBCFGSR2_IC5PUBS					(0x1u<<4)
#define	RCC_PUBCFGSR2_IC4PUBS					(0x1u<<3)
#define	RCC_PUBCFGSR2_IC3PUBS					(0x1u<<2)
#define	RCC_PUBCFGSR2_IC2PUBS					(0x1u<<1)
#define	RCC_PUBCFGSR2_IC1PUBS					(0x1u<<0)

// SECCFGSR3 Configuration

#define	RCC_SECCFGSR3_DFTSECS					(0x1u<<6)
#define	RCC_SECCFGSR3_RSTSECS					(0x1u<<5)
#define	RCC_SECCFGSR3_INTSECS					(0x1u<<4)
#define	RCC_SECCFGSR3_PERSECS					(0x1u<<3)
#define	RCC_SECCFGSR3_BUSSECS					(0x1u<<2)
#define	RCC_SECCFGSR3_SYSSECS					(0x1u<<1)
#define	RCC_SECCFGSR3_MODSECS					(0x1u<<0)

// PRIVCFGSR3 Configuration

#define	RCC_PRIVCFGSR3_DFTPVS					(0x1u<<6)
#define	RCC_PRIVCFGSR3_RSTPVS					(0x1u<<5)
#define	RCC_PRIVCFGSR3_INTPVS					(0x1u<<4)
#define	RCC_PRIVCFGSR3_PERPVS					(0x1u<<3)
#define	RCC_PRIVCFGSR3_BUSPVS					(0x1u<<2)
#define	RCC_PRIVCFGSR3_SYSPVS					(0x1u<<1)
#define	RCC_PRIVCFGSR3_MODPVS					(0x1u<<0)

// LOCKCFGSR3 Configuration

#define	RCC_LOCKCFGSR3_DFTLOCKS					(0x1u<<6)
#define	RCC_LOCKCFGSR3_RSTLOCKS					(0x1u<<5)
#define	RCC_LOCKCFGSR3_INTLOCKS					(0x1u<<4)
#define	RCC_LOCKCFGSR3_PERLOCKS					(0x1u<<3)
#define	RCC_LOCKCFGSR3_BUSLOCKS					(0x1u<<2)
#define	RCC_LOCKCFGSR3_SYSLOCKS					(0x1u<<1)
#define	RCC_LOCKCFGSR3_MODLOCKS					(0x1u<<0)

// PUBCFGSR3 Configuration

#define	RCC_PUBCFGSR3_DFTPUBS					(0x1u<<6)
#define	RCC_PUBCFGSR3_RSTPUBS					(0x1u<<5)
#define	RCC_PUBCFGSR3_INTPUBS					(0x1u<<4)
#define	RCC_PUBCFGSR3_PERPUBS					(0x1u<<3)
#define	RCC_PUBCFGSR3_BUSPUBS					(0x1u<<2)
#define	RCC_PUBCFGSR3_SYSPUBS					(0x1u<<1)
#define	RCC_PUBCFGSR3_MODPUBS					(0x1u<<0)

// PRIVCFGSR4 Configuration

#define	RCC_PRIVCFGSR4_NOCPVS					(0x1u<<13)
#define	RCC_PRIVCFGSR4_APB5PVS					(0x1u<<12)
#define	RCC_PRIVCFGSR4_APB4PVS					(0x1u<<11)
#define	RCC_PRIVCFGSR4_APB3PVS					(0x1u<<10)
#define	RCC_PRIVCFGSR4_APB2PVS					(0x1u<<9)
#define	RCC_PRIVCFGSR4_APB1PVS					(0x1u<<8)
#define	RCC_PRIVCFGSR4_AHB5PVS					(0x1u<<7)
#define	RCC_PRIVCFGSR4_AHB4PVS					(0x1u<<6)
#define	RCC_PRIVCFGSR4_AHB3PVS					(0x1u<<5)
#define	RCC_PRIVCFGSR4_AHB2PVS					(0x1u<<4)
#define	RCC_PRIVCFGSR4_AHB1PVS					(0x1u<<3)
#define	RCC_PRIVCFGSR4_AHBMPVS					(0x1u<<2)
#define	RCC_PRIVCFGSR4_ACLKNCPVS				(0x1u<<1)
#define	RCC_PRIVCFGSR4_ACLKNPVS					(0x1u<<0)

// PUBCFGSR4 Configuration

#define	RCC_PUBCFGSR4_NOCPUBS					(0x1u<<13)
#define	RCC_PUBCFGSR4_APB5PUBS					(0x1u<<12)
#define	RCC_PUBCFGSR4_APB4PUBS					(0x1u<<11)
#define	RCC_PUBCFGSR4_APB3PUBS					(0x1u<<10)
#define	RCC_PUBCFGSR4_APB2PUBS					(0x1u<<9)
#define	RCC_PUBCFGSR4_APB1PUBS					(0x1u<<8)
#define	RCC_PUBCFGSR4_AHB5PUBS					(0x1u<<7)
#define	RCC_PUBCFGSR4_AHB4PUBS					(0x1u<<6)
#define	RCC_PUBCFGSR4_AHB3PUBS					(0x1u<<5)
#define	RCC_PUBCFGSR4_AHB2PUBS					(0x1u<<4)
#define	RCC_PUBCFGSR4_AHB1PUBS					(0x1u<<3)
#define	RCC_PUBCFGSR4_AHBMPUBS					(0x1u<<2)
#define	RCC_PUBCFGSR4_ACLKNCPUBS				(0x1u<<1)
#define	RCC_PUBCFGSR4_ACLKNPUBS					(0x1u<<0)

// PUBCFGSR5 Configuration

