hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
#define	RCC_PUBCFGSR5_VENCRAMPUBS				(0x1u<<11)
#define	RCC_PUBCFGSR5_NPUCACHERAMPUBS			(0x1u<<10)
#define	RCC_PUBCFGSR5_FLEXRAMPUBS				(0x1u<<9)
#define	RCC_PUBCFGSR5_AXISRAM2PUBS				(0x1u<<8)
#define	RCC_PUBCFGSR5_AXISRAM1PUBS				(0x1u<<7)
#define	RCC_PUBCFGSR5_BKPSRAMPUBS				(0x1u<<6)
#define	RCC_PUBCFGSR5_AHBSRAM2PUBS				(0x1u<<5)
#define	RCC_PUBCFGSR5_AHBSRAM1PUBS				(0x1u<<4)
#define	RCC_PUBCFGSR5_AXISRAM6PUBS				(0x1u<<3)
#define	RCC_PUBCFGSR5_AXISRAM5PUBS				(0x1u<<2)
#define	RCC_PUBCFGSR5_AXISRAM4PUBS				(0x1u<<1)
#define	RCC_PUBCFGSR5_AXISRAM3PUBS				(0x1u<<0)

// CCR Configuration

#define	RCC_CCR_PLL4ONC							(0x1u<<11)
#define	RCC_CCR_PLL3ONC							(0x1u<<10)
#define	RCC_CCR_PLL2ONC							(0x1u<<9)
#define	RCC_CCR_PLL1ONC							(0x1u<<8)
#define	RCC_CCR_HSEONC							(0x1u<<4)
#define	RCC_CCR_HSIONC							(0x1u<<3)
#define	RCC_CCR_MSIONC							(0x1u<<2)
#define	RCC_CCR_LSEONC							(0x1u<<1)
#define	RCC_CCR_LSIONC							(0x1u<<0)

// STOPCCR Configuration

#define	RCC_STOPCCR_HSISTOPENC					(0x1u<<3)
#define	RCC_STOPCCR_MSISTOPENC					(0x1u<<2)
#define	RCC_STOPCCR_LSESTOPENC					(0x1u<<1)
#define	RCC_STOPCCR_LSISTOPENC					(0x1u<<0)

// BUSRSTCR Configuration

#define	RCC_BUSRSTCR_NOCRSTC					(0x1u<<13)
#define	RCC_BUSRSTCR_APB5RSTC					(0x1u<<12)
#define	RCC_BUSRSTCR_APB4RSTC					(0x1u<<11)
#define	RCC_BUSRSTCR_APB3RSTC					(0x1u<<10)
#define	RCC_BUSRSTCR_APB2RSTC					(0x1u<<9)
#define	RCC_BUSRSTCR_APB1RSTC					(0x1u<<8)
#define	RCC_BUSRSTCR_AHB5RSTC					(0x1u<<7)
#define	RCC_BUSRSTCR_AHB4RSTC					(0x1u<<6)
#define	RCC_BUSRSTCR_AHB3RSTC					(0x1u<<5)
#define	RCC_BUSRSTCR_AHB2RSTC					(0x1u<<4)
#define	RCC_BUSRSTCR_AHB1RSTC					(0x1u<<3)
#define	RCC_BUSRSTCR_AHBMRSTC					(0x1u<<2)
#define	RCC_BUSRSTCR_ACLKNRSTC					(0x1u<<0)

// MISCRSTCR Configuration

#define	RCC_MISCRSTCR_SDMMC2DLLRSTC				(0x1u<<8)
#define	RCC_MISCRSTCR_SDMMC1DLLRSTC				(0x1u<<7)
#define	RCC_MISCRSTCR_XSPIPHY2RSTC				(0x1u<<5)
#define	RCC_MISCRSTCR_XSPIPHY1RSTC				(0x1u<<4)
#define	RCC_MISCRSTCR_DBGRSTC					(0x1u<<0)

// MEMRSTCR Configuration

#define	RCC_MEMRSTCR_BOOTROMRSTC				(0x1u<<12)
#define	RCC_MEMRSTCR_VENCRAMRSTC				(0x1u<<11)
#define	RCC_MEMRSTCR_NPUCACHERAMRSTC			(0x1u<<10)
#define	RCC_MEMRSTCR_FLEXRAMRSTC				(0x1u<<9)
#define	RCC_MEMRSTCR_AXISRAM2RSTC				(0x1u<<8)
#define	RCC_MEMRSTCR_AXISRAM1RSTC				(0x1u<<7)
#define	RCC_MEMRSTCR_AHBSRAM2RSTC				(0x1u<<5)
#define	RCC_MEMRSTCR_AHBSRAM1RSTC				(0x1u<<4)
#define	RCC_MEMRSTCR_AXISRAM6RSTC				(0x1u<<3)
#define	RCC_MEMRSTCR_AXISRAM5RSTC				(0x1u<<2)
#define	RCC_MEMRSTCR_AXISRAM4RSTC				(0x1u<<1)
#define	RCC_MEMRSTCR_AXISRAM3RSTC				(0x1u<<0)

// AHB1RSTCR Configuration

#define	RCC_AHB1RSTCR_ADC12RSTC					(0x1u<<5)
#define	RCC_AHB1RSTCR_GPDMA1RSTC				(0x1u<<4)

// AHB2RSTCR Configuration

#define	RCC_AHB2RSTCR_ADF1RSTC					(0x1u<<17)
#define	RCC_AHB2RSTCR_MDF1RSTC					(0x1u<<16)
#define	RCC_AHB2RSTCR_RAMCFGRSTC				(0x1u<<12)

// AHB3RSTCR Configuration

#define	RCC_AHB3RSTCR_IACRSTC					(0x1u<<10)
#define	RCC_AHB3RSTCR_PKARSTC					(0x1u<<8)
#define	RCC_AHB3RSTCR_SAESRSTC					(0x1u<<4)
#define	RCC_AHB3RSTCR_CRYPRSTC					(0x1u<<2)
#define	RCC_AHB3RSTCR_HASHRSTC					(0x1u<<1)
#define	RCC_AHB3RSTCR_RNGRSTC					(0x1u<<0)

// AHB4RSTCR Configuration

#define	RCC_AHB4RSTCR_CRCRSTC					(0x1u<<19)
#define	RCC_AHB4RSTCR_PWRRSTC					(0x1u<<18)
#define	RCC_AHB4RSTCR_GPIOQRSTC					(0x1u<<16)
#define	RCC_AHB4RSTCR_GPIOPRSTC					(0x1u<<15)
#define	RCC_AHB4RSTCR_GPIOORSTC					(0x1u<<14)
#define	RCC_AHB4RSTCR_GPIONRSTC					(0x1u<<13)
#define	RCC_AHB4RSTCR_GPIOHRSTC					(0x1u<<7)
#define	RCC_AHB4RSTCR_GPIOGRSTC					(0x1u<<6)
#define	RCC_AHB4RSTCR_GPIOFRSTC					(0x1u<<5)
#define	RCC_AHB4RSTCR_GPIOERSTC					(0x1u<<4)
#define	RCC_AHB4RSTCR_GPIODRSTC					(0x1u<<3)
#define	RCC_AHB4RSTCR_GPIOCRSTC					(0x1u<<2)
#define	RCC_AHB4RSTCR_GPIOBRSTC					(0x1u<<1)
#define	RCC_AHB4RSTCR_GPIOARSTC					(0x1u<<0)

// AHB5RSTCR Configuration

#define	RCC_AHB5RSTCR_NPURSTC					(0x1u<<31)
#define	RCC_AHB5RSTCR_NPUCACHERSTC				(0x1u<<30)
#define	RCC_AHB5RSTCR_OTG2RSTC					(0x1u<<29)
#define	RCC_AHB5RSTCR_OTGPHY2RSTC				(0x1u<<28)
#define	RCC_AHB5RSTCR_OTGPHY1RSTC				(0x1u<<27)
#define	RCC_AHB5RSTCR_OTG1RSTC					(0x1u<<26)
#define	RCC_AHB5RSTCR_ETH1RSTC					(0x1u<<25)
#define	RCC_AHB5RSTCR_SYSCFGOTGHSPHY2RSTC		(0x1u<<24)
#define	RCC_AHB5RSTCR_SYSCFGOTGHSPHY1RSTC		(0x1u<<23)
#define	RCC_AHB5RSTCR_GPURSTC					(0x1u<<20)
#define	RCC_AHB5RSTCR_GFXMMURSTC				(0x1u<<19)
#define	RCC_AHB5RSTCR_MCE4RSTC					(0x1u<<18)
#define	RCC_AHB5RSTCR_XSPI3RSTC					(0x1u<<17)
#define	RCC_AHB5RSTCR_XSPIMRSTC					(0x1u<<13)
#define	RCC_AHB5RSTCR_XSPI2RSTC					(0x1u<<12)
#define	RCC_AHB5RSTCR_SDMMC1RSTC				(0x1u<<8)
#define	RCC_AHB5RSTCR_SDMMC2RSTC				(0x1u<<7)
#define	RCC_AHB5RSTCR_PSSIRSTC					(0x1u<<6)
#define	RCC_AHB5RSTCR_XSPI1RSTC					(0x1u<<5)
#define	RCC_AHB5RSTCR_FMCRSTC					(0x1u<<4)
#define	RCC_AHB5RSTCR_JPEGRSTC					(0x1u<<3)
#define	RCC_AHB5RSTCR_DMA2DRSTC					(0x1u<<1)
#define	RCC_AHB5RSTCR_HPDMA1RSTC				(0x1u<<0)

// APB1LRSTCR Configuration

#define	RCC_APB1LRSTCR_UART8RSTC				(0x1u<<31)
#define	RCC_APB1LRSTCR_UART7RSTC				(0x1u<<30)
#define	RCC_APB1LRSTCR_I3C2RSTC					(0x1u<<25)
#define	RCC_APB1LRSTCR_I3C1RSTC					(0x1u<<24)
#define	RCC_APB1LRSTCR_I2C3RSTC					(0x1u<<23)
#define	RCC_APB1LRSTCR_I2C2RSTC					(0x1u<<22)
#define	RCC_APB1LRSTCR_I2C1RSTC					(0x1u<<21)
#define	RCC_APB1LRSTCR_UART5RSTC				(0x1u<<20)
#define	RCC_APB1LRSTCR_UART4RSTC				(0x1u<<19)
#define	RCC_APB1LRSTCR_USART3RSTC				(0x1u<<18)
#define	RCC_APB1LRSTCR_USART2RSTC				(0x1u<<17)
#define	RCC_APB1LRSTCR_SPDIFRX1RSTC				(0x1u<<16)
#define	RCC_APB1LRSTCR_SPI3RSTC					(0x1u<<15)
#define	RCC_APB1LRSTCR_SPI2RSTC					(0x1u<<14)
#define	RCC_APB1LRSTCR_TIM11RSTC				(0x1u<<13)
#define	RCC_APB1LRSTCR_TIM10RSTC				(0x1u<<12)
#define	RCC_APB1LRSTCR_WWDGRSTC					(0x1u<<11)
#define	RCC_APB1LRSTCR_LPTIM1RSTC				(0x1u<<9)
#define	RCC_APB1LRSTCR_TIM14RSTC				(0x1u<<8)
#define	RCC_APB1LRSTCR_TIM13RSTC				(0x1u<<7)
#define	RCC_APB1LRSTCR_TIM12RSTC				(0x1u<<6)
#define	RCC_APB1LRSTCR_TIM7RSTC					(0x1u<<5)
#define	RCC_APB1LRSTCR_TIM6RSTC					(0x1u<<4)
#define	RCC_APB1LRSTCR_TIM5RSTC					(0x1u<<3)
#define	RCC_APB1LRSTCR_TIM4RSTC					(0x1u<<2)
#define	RCC_APB1LRSTCR_TIM3RSTC					(0x1u<<1)
#define	RCC_APB1LRSTCR_TIM2RSTC					(0x1u<<0)

// APB1HRSTCR Configuration

#define	RCC_APB1HRSTCR_UCPD1RSTC				(0x1u<<18)
#define	RCC_APB1HRSTCR_FDCANRSTC				(0x1u<<8)
#define	RCC_APB1HRSTCR_MDIOSRSTC				(0x1u<<5)

