hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
// APB2RSTCR Configuration

#define	RCC_APB2RSTCR_SAI2RSTC					(0x1u<<22)
#define	RCC_APB2RSTCR_SAI1RSTC					(0x1u<<21)
#define	RCC_APB2RSTCR_SPI5RSTC					(0x1u<<20)
#define	RCC_APB2RSTCR_TIM9RSTC					(0x1u<<19)
#define	RCC_APB2RSTCR_TIM17RSTC					(0x1u<<18)
#define	RCC_APB2RSTCR_TIM16RSTC					(0x1u<<17)
#define	RCC_APB2RSTCR_TIM15RSTC					(0x1u<<16)
#define	RCC_APB2RSTCR_TIM18RSTC					(0x1u<<15)
#define	RCC_APB2RSTCR_SPI4RSTC					(0x1u<<13)
#define	RCC_APB2RSTCR_SPI1RSTC					(0x1u<<12)
#define	RCC_APB2RSTCR_USART10RSTC				(0x1u<<7)
#define	RCC_APB2RSTCR_UART9RSTC					(0x1u<<6)
#define	RCC_APB2RSTCR_USART6RSTC				(0x1u<<5)
#define	RCC_APB2RSTCR_USART1RSTC				(0x1u<<4)
#define	RCC_APB2RSTCR_TIM8RSTC					(0x1u<<1)
#define	RCC_APB2RSTCR_TIM1RSTC					(0x1u<<0)

// APB4LRSTCR Configuration

#define	RCC_APB4LRSTCR_SERFRSTC					(0x1u<<31)
#define	RCC_APB4LRSTCR_R2GNPURSTC				(0x1u<<23)
#define	RCC_APB4LRSTCR_R2GRETRSTC				(0x1u<<22)
#define	RCC_APB4LRSTCR_RTCRSTC					(0x1u<<16)
#define	RCC_APB4LRSTCR_VREFBUFRSTC				(0x1u<<15)
#define	RCC_APB4LRSTCR_LPTIM5RSTC				(0x1u<<12)
#define	RCC_APB4LRSTCR_LPTIM4RSTC				(0x1u<<11)
#define	RCC_APB4LRSTCR_LPTIM3RSTC				(0x1u<<10)
#define	RCC_APB4LRSTCR_LPTIM2RSTC				(0x1u<<9)
#define	RCC_APB4LRSTCR_I2C4RSTC					(0x1u<<7)
#define	RCC_APB4LRSTCR_SPI6RSTC					(0x1u<<5)
#define	RCC_APB4LRSTCR_LPUART1RSTC				(0x1u<<3)
#define	RCC_APB4LRSTCR_HDPRSTC					(0x1u<<2)

// APB4HRSTCR Configuration

#define	RCC_APB4HRSTCR_BUSPERFMRSTC				(0x1u<<4)
#define	RCC_APB4HRSTCR_DTSRSTC					(0x1u<<2)
#define	RCC_APB4HRSTCR_SYSCFGRSTC				(0x1u<<0)

// APB5RSTCR Configuration

#define	RCC_APB5RSTCR_CSIRSTC					(0x1u<<6)
#define	RCC_APB5RSTCR_VENCRSTC					(0x1u<<5)
#define	RCC_APB5RSTCR_GFXTIMRSTC				(0x1u<<4)
#define	RCC_APB5RSTCR_DCMIPPRSTC				(0x1u<<2)
#define	RCC_APB5RSTCR_LTDCRSTC					(0x1u<<1)

// DIVENCR Configuration

#define	RCC_DIVENCR_IC20ENC						(0x1u<<19)
#define	RCC_DIVENCR_IC19ENC						(0x1u<<18)
#define	RCC_DIVENCR_IC18ENC						(0x1u<<17)
#define	RCC_DIVENCR_IC17ENC						(0x1u<<16)
#define	RCC_DIVENCR_IC16ENC						(0x1u<<15)
#define	RCC_DIVENCR_IC15ENC						(0x1u<<14)
#define	RCC_DIVENCR_IC14ENC						(0x1u<<13)
#define	RCC_DIVENCR_IC13ENC						(0x1u<<12)
#define	RCC_DIVENCR_IC12ENC						(0x1u<<11)
#define	RCC_DIVENCR_IC11ENC						(0x1u<<10)
#define	RCC_DIVENCR_IC10ENC						(0x1u<<9)
#define	RCC_DIVENCR_IC9ENC						(0x1u<<8)
#define	RCC_DIVENCR_IC8ENC						(0x1u<<7)
#define	RCC_DIVENCR_IC7ENC						(0x1u<<6)
#define	RCC_DIVENCR_IC6ENC						(0x1u<<5)
#define	RCC_DIVENCR_IC5ENC						(0x1u<<4)
#define	RCC_DIVENCR_IC4ENC						(0x1u<<3)
#define	RCC_DIVENCR_IC3ENC						(0x1u<<2)
#define	RCC_DIVENCR_IC2ENC						(0x1u<<1)
#define	RCC_DIVENCR_IC1ENC						(0x1u<<0)

// BUSENCR Configuration

#define	RCC_BUSENCR_APB5ENC						(0x1u<<12)
#define	RCC_BUSENCR_APB4ENC						(0x1u<<11)
#define	RCC_BUSENCR_APB3ENC						(0x1u<<10)
#define	RCC_BUSENCR_APB2ENC						(0x1u<<9)
#define	RCC_BUSENCR_APB1ENC						(0x1u<<8)
#define	RCC_BUSENCR_AHB5ENC						(0x1u<<7)
#define	RCC_BUSENCR_AHB4ENC						(0x1u<<6)
#define	RCC_BUSENCR_AHB3ENC						(0x1u<<5)
#define	RCC_BUSENCR_AHB2ENC						(0x1u<<4)
#define	RCC_BUSENCR_AHB1ENC						(0x1u<<3)
#define	RCC_BUSENCR_AHBMENC						(0x1u<<2)
#define	RCC_BUSENCR_ACLKNCENC					(0x1u<<1)
#define	RCC_BUSENCR_ACLKNENC					(0x1u<<0)

// MISCENCR Configuration

#define	RCC_MISCENCR_PERENC						(0x1u<<6)
#define	RCC_MISCENCR_XSPIPHYCOMPENC				(0x1u<<3)
#define	RCC_MISCENCR_MCO2ENC					(0x1u<<2)
#define	RCC_MISCENCR_MCO1ENC					(0x1u<<1)
#define	RCC_MISCENCR_DBGENC						(0x1u<<0)

// MEMENCR Configuration

#define	RCC_MEMENCR_BOOTROMENC					(0x1u<<12)
#define	RCC_MEMENCR_VENCRAMENC					(0x1u<<11)
#define	RCC_MEMENCR_NPUCACHERAMENC				(0x1u<<10)
#define	RCC_MEMENCR_FLEXRAMENC					(0x1u<<9)
#define	RCC_MEMENCR_AXISRAM2ENC					(0x1u<<8)
#define	RCC_MEMENCR_AXISRAM1ENC					(0x1u<<7)
#define	RCC_MEMENCR_BKPSRAMENC					(0x1u<<6)
#define	RCC_MEMENCR_AHBSRAM2ENC					(0x1u<<5)
#define	RCC_MEMENCR_AHBSRAM1ENC					(0x1u<<4)
#define	RCC_MEMENCR_AXISRAM6ENC					(0x1u<<3)
#define	RCC_MEMENCR_AXISRAM5ENC					(0x1u<<2)
#define	RCC_MEMENCR_AXISRAM4ENC					(0x1u<<1)
#define	RCC_MEMENCR_AXISRAM3ENC					(0x1u<<0)

// AHB1ENCR Configuration

#define	RCC_AHB1ENCR_ADC12ENC					(0x1u<<5)
#define	RCC_AHB1ENCR_GPDMA1ENC					(0x1u<<4)

// AHB2ENCR Configuration

#define	RCC_AHB2ENCR_ADF1ENC					(0x1u<<17)
#define	RCC_AHB2ENCR_MDF1ENC					(0x1u<<16)
#define	RCC_AHB2ENCR_RAMCFGENC					(0x1u<<12)

// AHB3ENCR Configuration

#define	RCC_AHB3ENCR_RISAFENC					(0x1u<<14)
#define	RCC_AHB3ENCR_IACENC						(0x1u<<10)
#define	RCC_AHB3ENCR_RIFSCENC					(0x1u<<9)
#define	RCC_AHB3ENCR_PKAENC						(0x1u<<8)
#define	RCC_AHB3ENCR_SAESENC					(0x1u<<4)
#define	RCC_AHB3ENCR_CRYPENC					(0x1u<<2)
#define	RCC_AHB3ENCR_HASHENC					(0x1u<<1)
#define	RCC_AHB3ENCR_RNGENC						(0x1u<<0)

// AHB4ENCR Configuration

#define	RCC_AHB4ENCR_CRCENC						(0x1u<<19)
#define	RCC_AHB4ENCR_PWRENC						(0x1u<<18)
#define	RCC_AHB4ENCR_GPIOQENC					(0x1u<<16)
#define	RCC_AHB4ENCR_GPIOPENC					(0x1u<<15)
#define	RCC_AHB4ENCR_GPIOOENC					(0x1u<<14)
#define	RCC_AHB4ENCR_GPIONENC					(0x1u<<13)
#define	RCC_AHB4ENCR_GPIOHENC					(0x1u<<7)
#define	RCC_AHB4ENCR_GPIOGENC					(0x1u<<6)
#define	RCC_AHB4ENCR_GPIOFENC					(0x1u<<5)
#define	RCC_AHB4ENCR_GPIOEENC					(0x1u<<4)
#define	RCC_AHB4ENCR_GPIODENC					(0x1u<<3)
#define	RCC_AHB4ENCR_GPIOCENC					(0x1u<<2)
#define	RCC_AHB4ENCR_GPIOBENC					(0x1u<<1)
#define	RCC_AHB4ENCR_GPIOAENC					(0x1u<<0)

// AHB5ENCR Configuration

#define	RCC_AHB5ENCR_NPUENC						(0x1u<<31)
#define	RCC_AHB5ENCR_NPUCACHEENC				(0x1u<<30)
#define	RCC_AHB5ENCR_OTG2ENC					(0x1u<<29)
#define	RCC_AHB5ENCR_OTGPHY2ENC					(0x1u<<28)
#define	RCC_AHB5ENCR_OTGPHY1ENC					(0x1u<<27)
#define	RCC_AHB5ENCR_OTG1ENC					(0x1u<<26)
#define	RCC_AHB5ENCR_ETH1ENC					(0x1u<<25)
#define	RCC_AHB5ENCR_ETH1RXENC					(0x1u<<24)
#define	RCC_AHB5ENCR_ETH1TXENC					(0x1u<<23)
#define	RCC_AHB5ENCR_ETH1MACENC					(0x1u<<22)
#define	RCC_AHB5ENCR_GPUENC						(0x1u<<20)
#define	RCC_AHB5ENCR_GFXMMUENC					(0x1u<<19)
#define	RCC_AHB5ENCR_MCE4ENC					(0x1u<<18)
#define	RCC_AHB5ENCR_XSPI3ENC					(0x1u<<17)
#define	RCC_AHB5ENCR_MCE3ENC					(0x1u<<16)
#define	RCC_AHB5ENCR_MCE2ENC					(0x1u<<15)
#define	RCC_AHB5ENCR_MCE1ENC					(0x1u<<14)
#define	RCC_AHB5ENCR_XSPIMENC					(0x1u<<13)
#define	RCC_AHB5ENCR_XSPI2ENC					(0x1u<<12)
#define	RCC_AHB5ENCR_SDMMC1ENC					(0x1u<<8)
#define	RCC_AHB5ENCR_SDMMC2ENC					(0x1u<<7)
#define	RCC_AHB5ENCR_PSSIENC					(0x1u<<6)
#define	RCC_AHB5ENCR_XSPI1ENC					(0x1u<<5)
#define	RCC_AHB5ENCR_FMCENC						(0x1u<<4)
#define	RCC_AHB5ENCR_JPEGENC					(0x1u<<3)
#define	RCC_AHB5ENCR_DMA2DENC					(0x1u<<1)
#define	RCC_AHB5ENCR_HPDMA1ENC					(0x1u<<0)

// APB1LENCR Configuration

#define	RCC_APB1LENCR_UART8ENC					(0x1u<<31)
#define	RCC_APB1LENCR_UART7ENC					(0x1u<<30)
#define	RCC_APB1LENCR_I3C2ENC					(0x1u<<25)
#define	RCC_APB1LENCR_I3C1ENC					(0x1u<<24)
#define	RCC_APB1LENCR_I2C3ENC					(0x1u<<23)
#define	RCC_APB1LENCR_I2C2ENC					(0x1u<<22)
#define	RCC_APB1LENCR_I2C1ENC					(0x1u<<21)
#define	RCC_APB1LENCR_UART5ENC					(0x1u<<20)
#define	RCC_APB1LENCR_UART4ENC					(0x1u<<19)
#define	RCC_APB1LENCR_USART3ENC					(0x1u<<18)
#define	RCC_APB1LENCR_USART2ENC					(0x1u<<17)
#define	RCC_APB1LENCR_SPDIFRX1ENC				(0x1u<<16)
#define	RCC_APB1LENCR_SPI3ENC					(0x1u<<15)
#define	RCC_APB1LENCR_SPI2ENC					(0x1u<<14)
#define	RCC_APB1LENCR_TIM11ENC					(0x1u<<13)
#define	RCC_APB1LENCR_TIM10ENC					(0x1u<<12)
#define	RCC_APB1LENCR_LPTIM1ENC					(0x1u<<9)
#define	RCC_APB1LENCR_TIM14ENC					(0x1u<<8)
#define	RCC_APB1LENCR_TIM13ENC					(0x1u<<7)
#define	RCC_APB1LENCR_TIM12ENC					(0x1u<<6)
#define	RCC_APB1LENCR_TIM7ENC					(0x1u<<5)
#define	RCC_APB1LENCR_TIM6ENC					(0x1u<<4)
#define	RCC_APB1LENCR_TIM5ENC					(0x1u<<3)
#define	RCC_APB1LENCR_TIM4ENC					(0x1u<<2)
#define	RCC_APB1LENCR_TIM3ENC					(0x1u<<1)
#define	RCC_APB1LENCR_TIM2ENC					(0x1u<<0)

// APB1HENCR Configuration

