hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
#define	RCC_APB1HENCR_UCPD1ENC					(0x1u<<18)
#define	RCC_APB1HENCR_FDCANENC					(0x1u<<8)
#define	RCC_APB1HENCR_MDIOSENC					(0x1u<<5)

// APB2ENCR Configuration

#define	RCC_APB2ENCR_SAI2ENC					(0x1u<<22)
#define	RCC_APB2ENCR_SAI1ENC					(0x1u<<21)
#define	RCC_APB2ENCR_SPI5ENC					(0x1u<<20)
#define	RCC_APB2ENCR_TIM9ENC					(0x1u<<19)
#define	RCC_APB2ENCR_TIM17ENC					(0x1u<<18)
#define	RCC_APB2ENCR_TIM16ENC					(0x1u<<17)
#define	RCC_APB2ENCR_TIM15ENC					(0x1u<<16)
#define	RCC_APB2ENCR_TIM18ENC					(0x1u<<15)
#define	RCC_APB2ENCR_SPI4ENC					(0x1u<<13)
#define	RCC_APB2ENCR_SPI1ENC					(0x1u<<12)
#define	RCC_APB2ENCR_USART10ENC					(0x1u<<7)
#define	RCC_APB2ENCR_UART9ENC					(0x1u<<6)
#define	RCC_APB2ENCR_USART6ENC					(0x1u<<5)
#define	RCC_APB2ENCR_USART1ENC					(0x1u<<4)
#define	RCC_APB2ENCR_TIM8ENC					(0x1u<<1)
#define	RCC_APB2ENCR_TIM1ENC					(0x1u<<0)

// APB3ENCR Configuration

#define	RCC_APB3ENCR_DFTENC						(0x1u<<2)

// APB4LENCR Configuration

#define	RCC_APB4LENCR_SERFENC					(0x1u<<31)
#define	RCC_APB4LENCR_R2GNPUENC					(0x1u<<23)
#define	RCC_APB4LENCR_R2GRETENC					(0x1u<<22)
#define	RCC_APB4LENCR_RTCAPBENC					(0x1u<<17)
#define	RCC_APB4LENCR_RTCENC					(0x1u<<16)
#define	RCC_APB4LENCR_VREFBUFENC				(0x1u<<15)
#define	RCC_APB4LENCR_LPTIM5ENC					(0x1u<<12)
#define	RCC_APB4LENCR_LPTIM4ENC					(0x1u<<11)
#define	RCC_APB4LENCR_LPTIM3ENC					(0x1u<<10)
#define	RCC_APB4LENCR_LPTIM2ENC					(0x1u<<9)
#define	RCC_APB4LENCR_I2C4ENC					(0x1u<<7)
#define	RCC_APB4LENCR_SPI6ENC					(0x1u<<5)
#define	RCC_APB4LENCR_LPUART1ENC				(0x1u<<3)
#define	RCC_APB4LENCR_HDPENC					(0x1u<<2)

// APB4HENCR Configuration

#define	RCC_APB4HENCR_BUSPERFMENC				(0x1u<<4)
#define	RCC_APB4HENCR_DTSENC					(0x1u<<2)
#define	RCC_APB4HENCR_BSECENC					(0x1u<<1)
#define	RCC_APB4HENCR_SYSCFGENC					(0x1u<<0)

// APB5ENCR Configuration

#define	RCC_APB5ENCR_CSIENC						(0x1u<<6)
#define	RCC_APB5ENCR_VENCENC					(0x1u<<5)
#define	RCC_APB5ENCR_GFXTIMENC					(0x1u<<4)
#define	RCC_APB5ENCR_DCMIPPENC					(0x1u<<2)
#define	RCC_APB5ENCR_LTDCENC					(0x1u<<1)

// DIVLPENCR Configuration

#define	RCC_DIVLPENCR_IC20LPENC					(0x1u<<19)
#define	RCC_DIVLPENCR_IC19LPENC					(0x1u<<18)
#define	RCC_DIVLPENCR_IC18LPENC					(0x1u<<17)
#define	RCC_DIVLPENCR_IC17LPENC					(0x1u<<16)
#define	RCC_DIVLPENCR_IC16LPENC					(0x1u<<15)
#define	RCC_DIVLPENCR_IC15LPENC					(0x1u<<14)
#define	RCC_DIVLPENCR_IC14LPENC					(0x1u<<13)
#define	RCC_DIVLPENCR_IC13LPENC					(0x1u<<12)
#define	RCC_DIVLPENCR_IC12LPENC					(0x1u<<11)
#define	RCC_DIVLPENCR_IC11LPENC					(0x1u<<10)
#define	RCC_DIVLPENCR_IC10LPENC					(0x1u<<9)
#define	RCC_DIVLPENCR_IC9LPENC					(0x1u<<8)
#define	RCC_DIVLPENCR_IC8LPENC					(0x1u<<7)
#define	RCC_DIVLPENCR_IC7LPENC					(0x1u<<6)
#define	RCC_DIVLPENCR_IC6LPENC					(0x1u<<5)
#define	RCC_DIVLPENCR_IC5LPENC					(0x1u<<4)
#define	RCC_DIVLPENCR_IC4LPENC					(0x1u<<3)
#define	RCC_DIVLPENCR_IC3LPENC					(0x1u<<2)
#define	RCC_DIVLPENCR_IC2LPENC					(0x1u<<1)
#define	RCC_DIVLPENCR_IC1LPENC					(0x1u<<0)

// BUSLPENCR Configuration

#define	RCC_BUSLPENCR_APB5LPENC					(0x1u<<12)
#define	RCC_BUSLPENCR_APB4LPENC					(0x1u<<11)
#define	RCC_BUSLPENCR_APB3LPENC					(0x1u<<10)
#define	RCC_BUSLPENCR_APB2LPENC					(0x1u<<9)
#define	RCC_BUSLPENCR_APB1LPENC					(0x1u<<8)
#define	RCC_BUSLPENCR_AHB5LPENC					(0x1u<<7)
#define	RCC_BUSLPENCR_AHB4LPENC					(0x1u<<6)
#define	RCC_BUSLPENCR_AHB3LPENC					(0x1u<<5)
#define	RCC_BUSLPENCR_AHB2LPENC					(0x1u<<4)
#define	RCC_BUSLPENCR_AHB1LPENC					(0x1u<<3)
#define	RCC_BUSLPENCR_AHBMLPENC					(0x1u<<2)
#define	RCC_BUSLPENCR_ACLKNCLPENC				(0x1u<<1)
#define	RCC_BUSLPENCR_ACLKNLPENC				(0x1u<<0)

// MISCLPENCR Configuration

#define	RCC_MISCLPENCR_PERLPENC					(0x1u<<6)
#define	RCC_MISCLPENCR_XSPIPHYCOMPLPENC			(0x1u<<3)
#define	RCC_MISCLPENCR_DBGLPENC					(0x1u<<0)

// MEMLPENCR Configuration

#define	RCC_MEMLPENCR_BOOTROMLPENC				(0x1u<<12)
#define	RCC_MEMLPENCR_VENCRAMLPENC				(0x1u<<11)
#define	RCC_MEMLPENCR_NPUCACHERAMLPENC			(0x1u<<10)
#define	RCC_MEMLPENCR_FLEXRAMLPENC				(0x1u<<9)
#define	RCC_MEMLPENCR_AXISRAM2LPENC				(0x1u<<8)
#define	RCC_MEMLPENCR_AXISRAM1LPENC				(0x1u<<7)
#define	RCC_MEMLPENCR_BKPSRAMLPENC				(0x1u<<6)
#define	RCC_MEMLPENCR_AHBSRAM2LPENC				(0x1u<<5)
#define	RCC_MEMLPENCR_AHBSRAM1LPENC				(0x1u<<4)
#define	RCC_MEMLPENCR_AXISRAM6LPENC				(0x1u<<3)
#define	RCC_MEMLPENCR_AXISRAM5LPENC				(0x1u<<2)
#define	RCC_MEMLPENCR_AXISRAM4LPENC				(0x1u<<1)
#define	RCC_MEMLPENCR_AXISRAM3LPENC				(0x1u<<0)

// AHB1LPENCR Configuration

#define	RCC_AHB1LPENCR_ADC12LPENC				(0x1u<<5)
#define	RCC_AHB1LPENCR_GPDMA1LPENC				(0x1u<<4)

// AHB2LPENCR Configuration

#define	RCC_AHB2LPENCR_ADF1LPENC				(0x1u<<17)
#define	RCC_AHB2LPENCR_MDF1LPENC				(0x1u<<16)
#define	RCC_AHB2LPENCR_RAMCFGLPENC				(0x1u<<12)

// AHB3LPENCR Configuration

#define	RCC_AHB3LPENCR_RISAFLPENC				(0x1u<<14)
#define	RCC_AHB3LPENCR_IACLPENC					(0x1u<<10)
#define	RCC_AHB3LPENCR_RIFSCLPENC				(0x1u<<9)
#define	RCC_AHB3LPENCR_PKALPENC					(0x1u<<8)
#define	RCC_AHB3LPENCR_SAESLPENC				(0x1u<<4)
#define	RCC_AHB3LPENCR_CRYPLPENC				(0x1u<<2)
#define	RCC_AHB3LPENCR_HASHLPENC				(0x1u<<1)
#define	RCC_AHB3LPENCR_RNGLPENC					(0x1u<<0)

// AHB4LPENCR Configuration

#define	RCC_AHB4LPENCR_CRCLPENC					(0x1u<<19)
#define	RCC_AHB4LPENCR_PWRLPENC					(0x1u<<18)
#define	RCC_AHB4LPENCR_GPIOQLPENC				(0x1u<<16)
#define	RCC_AHB4LPENCR_GPIOPLPENC				(0x1u<<15)
#define	RCC_AHB4LPENCR_GPIOOLPENC				(0x1u<<14)
#define	RCC_AHB4LPENCR_GPIONLPENC				(0x1u<<13)
#define	RCC_AHB4LPENCR_GPIOHLPENC				(0x1u<<7)
#define	RCC_AHB4LPENCR_GPIOGLPENC				(0x1u<<6)
#define	RCC_AHB4LPENCR_GPIOFLPENC				(0x1u<<5)
#define	RCC_AHB4LPENCR_GPIOELPENC				(0x1u<<4)
#define	RCC_AHB4LPENCR_GPIODLPENC				(0x1u<<3)
#define	RCC_AHB4LPENCR_GPIOCLPENC				(0x1u<<2)
#define	RCC_AHB4LPENCR_GPIOBLPENC				(0x1u<<1)
#define	RCC_AHB4LPENCR_GPIOALPENC				(0x1u<<0)

// AHB5LPENCR Configuration

#define	RCC_AHB5LPENCR_NPULPENC					(0x1u<<31)
#define	RCC_AHB5LPENCR_NPUCACHELPENC			(0x1u<<30)
#define	RCC_AHB5LPENCR_OTG2LPENC				(0x1u<<29)
#define	RCC_AHB5LPENCR_OTGPHY2LPENC				(0x1u<<28)
#define	RCC_AHB5LPENCR_OTGPHY1LPENC				(0x1u<<27)
#define	RCC_AHB5LPENCR_OTG1LPENC				(0x1u<<26)
#define	RCC_AHB5LPENCR_ETH1LPENC				(0x1u<<25)
#define	RCC_AHB5LPENCR_ETH1RXLPENC				(0x1u<<24)
#define	RCC_AHB5LPENCR_ETH1TXLPENC				(0x1u<<23)
#define	RCC_AHB5LPENCR_ETH1MACLPENC				(0x1u<<22)
#define	RCC_AHB5LPENCR_GPULPENC					(0x1u<<20)
#define	RCC_AHB5LPENCR_GFXMMULPENC				(0x1u<<19)
#define	RCC_AHB5LPENCR_MCE4LPENC				(0x1u<<18)
#define	RCC_AHB5LPENCR_XSPI3LPENC				(0x1u<<17)
#define	RCC_AHB5LPENCR_MCE3LPENC				(0x1u<<16)
#define	RCC_AHB5LPENCR_MCE2LPENC				(0x1u<<15)
#define	RCC_AHB5LPENCR_MCE1LPENC				(0x1u<<14)
#define	RCC_AHB5LPENCR_XSPIMLPENC				(0x1u<<13)
#define	RCC_AHB5LPENCR_XSPI2LPENC				(0x1u<<12)
#define	RCC_AHB5LPENCR_SDMMC1LPENC				(0x1u<<8)
#define	RCC_AHB5LPENCR_SDMMC2LPENC				(0x1u<<7)
#define	RCC_AHB5LPENCR_PSSILPENC				(0x1u<<6)
#define	RCC_AHB5LPENCR_XSPI1LPENC				(0x1u<<5)
#define	RCC_AHB5LPENCR_FMCLPENC					(0x1u<<4)
#define	RCC_AHB5LPENCR_JPEGLPENC				(0x1u<<3)
#define	RCC_AHB5LPENCR_DMA2DLPENC				(0x1u<<1)
#define	RCC_AHB5LPENCR_HPDMA1LPENC				(0x1u<<0)

