hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rcc.h
// APB1LLPENCR Configuration

#define	RCC_APB1LLPENCR_UART8LPENC				(0x1u<<31)
#define	RCC_APB1LLPENCR_UART7LPENC				(0x1u<<30)
#define	RCC_APB1LLPENCR_I3C2LPENC				(0x1u<<25)
#define	RCC_APB1LLPENCR_I3C1LPENC				(0x1u<<24)
#define	RCC_APB1LLPENCR_I2C3LPENC				(0x1u<<23)
#define	RCC_APB1LLPENCR_I2C2LPENC				(0x1u<<22)
#define	RCC_APB1LLPENCR_I2C1LPENC				(0x1u<<21)
#define	RCC_APB1LLPENCR_UART5LPENC				(0x1u<<20)
#define	RCC_APB1LLPENCR_UART4LPENC				(0x1u<<19)
#define	RCC_APB1LLPENCR_USART3LPENC				(0x1u<<18)
#define	RCC_APB1LLPENCR_USART2LPENC				(0x1u<<17)
#define	RCC_APB1LLPENCR_SPDIFRX1LPENC			(0x1u<<16)
#define	RCC_APB1LLPENCR_SPI3LPENC				(0x1u<<15)
#define	RCC_APB1LLPENCR_SPI2LPENC				(0x1u<<14)
#define	RCC_APB1LLPENCR_TIM11LPENC				(0x1u<<13)
#define	RCC_APB1LLPENCR_TIM10LPENC				(0x1u<<12)
#define	RCC_APB1LLPENCR_WWDGLPENC				(0x1u<<11)
#define	RCC_APB1LLPENCR_LPTIM1LPENC				(0x1u<<9)
#define	RCC_APB1LLPENCR_TIM14LPENC				(0x1u<<8)
#define	RCC_APB1LLPENCR_TIM13LPENC				(0x1u<<7)
#define	RCC_APB1LLPENCR_TIM12LPENC				(0x1u<<6)
#define	RCC_APB1LLPENCR_TIM7LPENC				(0x1u<<5)
#define	RCC_APB1LLPENCR_TIM6LPENC				(0x1u<<4)
#define	RCC_APB1LLPENCR_TIM5LPENC				(0x1u<<3)
#define	RCC_APB1LLPENCR_TIM4LPENC				(0x1u<<2)
#define	RCC_APB1LLPENCR_TIM3LPENC				(0x1u<<1)
#define	RCC_APB1LLPENCR_TIM2LPENC				(0x1u<<0)

// APB1HLPENCR Configuration

#define	RCC_APB1HLPENCR_UCPD1LPENC				(0x1u<<18)
#define	RCC_APB1HLPENCR_FDCANLPENC				(0x1u<<8)
#define	RCC_APB1HLPENCR_MDIOSLPENC				(0x1u<<5)

// APB2LPENCR Configuration

#define	RCC_APB2LPENCR_SAI2LPENC				(0x1u<<22)
#define	RCC_APB2LPENCR_SAI1LPENC				(0x1u<<21)
#define	RCC_APB2LPENCR_SPI5LPENC				(0x1u<<20)
#define	RCC_APB2LPENCR_TIM9LPENC				(0x1u<<19)
#define	RCC_APB2LPENCR_TIM17LPENC				(0x1u<<18)
#define	RCC_APB2LPENCR_TIM16LPENC				(0x1u<<17)
#define	RCC_APB2LPENCR_TIM15LPENC				(0x1u<<16)
#define	RCC_APB2LPENCR_TIM18LPENC				(0x1u<<15)
#define	RCC_APB2LPENCR_SPI4LPENC				(0x1u<<13)
#define	RCC_APB2LPENCR_SPI1LPENC				(0x1u<<12)
#define	RCC_APB2LPENCR_USART10LPENC				(0x1u<<7)
#define	RCC_APB2LPENCR_UART9LPENC				(0x1u<<6)
#define	RCC_APB2LPENCR_USART6LPENC				(0x1u<<5)
#define	RCC_APB2LPENCR_USART1LPENC				(0x1u<<4)
#define	RCC_APB2LPENCR_TIM8LPENC				(0x1u<<1)
#define	RCC_APB2LPENCR_TIM1LPENC				(0x1u<<0)

// APB3LPENCR Configuration

#define	RCC_APB3LPENCR_DFTLPENC					(0x1u<<2)

// APB4LLPENCR Configuration

#define	RCC_APB4LLPENCR_SERFLPENC				(0x1u<<31)
#define	RCC_APB4LLPENCR_R2GNPULPENC				(0x1u<<23)
#define	RCC_APB4LLPENCR_R2GRETLPENC				(0x1u<<22)
#define	RCC_APB4LLPENCR_RTCAPBLPENC				(0x1u<<17)
#define	RCC_APB4LLPENCR_RTCLPENC				(0x1u<<16)
#define	RCC_APB4LLPENCR_VREFBUFLPENC			(0x1u<<15)
#define	RCC_APB4LLPENCR_LPTIM5LPENC				(0x1u<<12)
#define	RCC_APB4LLPENCR_LPTIM4LPENC				(0x1u<<11)
#define	RCC_APB4LLPENCR_LPTIM3LPENC				(0x1u<<10)
#define	RCC_APB4LLPENCR_LPTIM2LPENC				(0x1u<<9)
#define	RCC_APB4LLPENCR_I2C4LPENC				(0x1u<<7)
#define	RCC_APB4LLPENCR_SPI6LPENC				(0x1u<<5)
#define	RCC_APB4LLPENCR_LPUART1LPENC			(0x1u<<3)
#define	RCC_APB4LLPENCR_HDPLPENC				(0x1u<<2)

// APB4HLPENCR Configuration

#define	RCC_APB4HLPENCR_BUSPERFMLPENC			(0x1u<<4)
#define	RCC_APB4HLPENCR_DTSLPENC				(0x1u<<2)
#define	RCC_APB4HLPENCR_BSECLPENC				(0x1u<<1)
#define	RCC_APB4HLPENCR_SYSCFGLPENC				(0x1u<<0)

// APB5LPENCR Configuration

#define	RCC_APB5LPENCR_CSILPENC					(0x1u<<6)
#define	RCC_APB5LPENCR_VENCLPENC				(0x1u<<5)
#define	RCC_APB5LPENCR_GFXTIMLPENC				(0x1u<<4)
#define	RCC_APB5LPENCR_DCMIPPLPENC				(0x1u<<2)
#define	RCC_APB5LPENCR_LTDCLPENC				(0x1u<<1)

// PRIVCFGCR0 Configuration

#define	RCC_PRIVCFGCR0_HSEPVC					(0x1u<<4)
#define	RCC_PRIVCFGCR0_HSIPVC					(0x1u<<3)
#define	RCC_PRIVCFGCR0_MSIPVC					(0x1u<<2)
#define	RCC_PRIVCFGCR0_LSEPVC					(0x1u<<1)
#define	RCC_PRIVCFGCR0_LSIPVC					(0x1u<<0)

// PUBCFGCR0 Configuration

#define	RCC_PUBCFGCR0_HSEPUBC					(0x1u<<4)
#define	RCC_PUBCFGCR0_HSIPUBC					(0x1u<<3)
#define	RCC_PUBCFGCR0_MSIPUBC					(0x1u<<2)
#define	RCC_PUBCFGCR0_LSEPUBC					(0x1u<<1)
#define	RCC_PUBCFGCR0_LSIPUBC					(0x1u<<0)

// PRIVCFGCR1 Configuration

#define	RCC_PRIVCFGCR1_PLL4PVC					(0x1u<<3)
#define	RCC_PRIVCFGCR1_PLL3PVC					(0x1u<<2)
#define	RCC_PRIVCFGCR1_PLL2PVC					(0x1u<<1)
#define	RCC_PRIVCFGCR1_PLL1PVC					(0x1u<<0)

// PUBCFGCR1 Configuration

#define	RCC_PUBCFGCR1_PLL4PUBC					(0x1u<<3)
#define	RCC_PUBCFGCR1_PLL3PUBC					(0x1u<<2)
#define	RCC_PUBCFGCR1_PLL2PUBC					(0x1u<<1)
#define	RCC_PUBCFGCR1_PLL1PUBC					(0x1u<<0)

// PRIVCFGCR2 Configuration

#define	RCC_PRIVCFGCR2_IC20PVC					(0x1u<<19)
#define	RCC_PRIVCFGCR2_IC19PVC					(0x1u<<18)
#define	RCC_PRIVCFGCR2_IC18PVC					(0x1u<<17)
#define	RCC_PRIVCFGCR2_IC17PVC					(0x1u<<16)
#define	RCC_PRIVCFGCR2_IC16PVC					(0x1u<<15)
#define	RCC_PRIVCFGCR2_IC15PVC					(0x1u<<14)
#define	RCC_PRIVCFGCR2_IC14PVC					(0x1u<<13)
#define	RCC_PRIVCFGCR2_IC13PVC					(0x1u<<12)
#define	RCC_PRIVCFGCR2_IC12PVC					(0x1u<<11)
#define	RCC_PRIVCFGCR2_IC11PVC					(0x1u<<10)
#define	RCC_PRIVCFGCR2_IC10PVC					(0x1u<<9)
#define	RCC_PRIVCFGCR2_IC9PVC					(0x1u<<8)
#define	RCC_PRIVCFGCR2_IC8PVC					(0x1u<<7)
#define	RCC_PRIVCFGCR2_IC7PVC					(0x1u<<6)
#define	RCC_PRIVCFGCR2_IC6PVC					(0x1u<<5)
#define	RCC_PRIVCFGCR2_IC5PVC					(0x1u<<4)
#define	RCC_PRIVCFGCR2_IC4PVC					(0x1u<<3)
#define	RCC_PRIVCFGCR2_IC3PVC					(0x1u<<2)
#define	RCC_PRIVCFGCR2_IC2PVC					(0x1u<<1)
#define	RCC_PRIVCFGCR2_IC1PVC					(0x1u<<0)

// PUBCFGCR2 Configuration

#define	RCC_PUBCFGCR2_IC20PUBC					(0x1u<<19)
#define	RCC_PUBCFGCR2_IC19PUBC					(0x1u<<18)
#define	RCC_PUBCFGCR2_IC18PUBC					(0x1u<<17)
#define	RCC_PUBCFGCR2_IC17PUBC					(0x1u<<16)
#define	RCC_PUBCFGCR2_IC16PUBC					(0x1u<<15)
#define	RCC_PUBCFGCR2_IC15PUBC					(0x1u<<14)
#define	RCC_PUBCFGCR2_IC14PUBC					(0x1u<<13)
#define	RCC_PUBCFGCR2_IC13PUBC					(0x1u<<12)
#define	RCC_PUBCFGCR2_IC12PUBC					(0x1u<<11)
#define	RCC_PUBCFGCR2_IC11PUBC					(0x1u<<10)
#define	RCC_PUBCFGCR2_IC10PUBC					(0x1u<<9)
#define	RCC_PUBCFGCR2_IC9PUBC					(0x1u<<8)
#define	RCC_PUBCFGCR2_IC8PUBC					(0x1u<<7)
#define	RCC_PUBCFGCR2_IC7PUBC					(0x1u<<6)
#define	RCC_PUBCFGCR2_IC6PUBC					(0x1u<<5)
#define	RCC_PUBCFGCR2_IC5PUBC					(0x1u<<4)
#define	RCC_PUBCFGCR2_IC4PUBC					(0x1u<<3)
#define	RCC_PUBCFGCR2_IC3PUBC					(0x1u<<2)
#define	RCC_PUBCFGCR2_IC2PUBC					(0x1u<<1)
#define	RCC_PUBCFGCR2_IC1PUBC					(0x1u<<0)

// PRIVCFGCR3 Configuration

#define	RCC_PRIVCFGCR3_DFTPVC					(0x1u<<6)
#define	RCC_PRIVCFGCR3_RSTPVC					(0x1u<<5)
#define	RCC_PRIVCFGCR3_INTPVC					(0x1u<<4)
#define	RCC_PRIVCFGCR3_PERPVC					(0x1u<<3)
#define	RCC_PRIVCFGCR3_BUSPVC					(0x1u<<2)
#define	RCC_PRIVCFGCR3_SYSPVC					(0x1u<<1)
#define	RCC_PRIVCFGCR3_MODPVC					(0x1u<<0)

// PUBCFGCR3 Configuration

#define	RCC_PUBCFGCR3_DFTPUBC					(0x1u<<6)
#define	RCC_PUBCFGCR3_RSTPUBC					(0x1u<<5)
#define	RCC_PUBCFGCR3_INTPUBC					(0x1u<<4)
#define	RCC_PUBCFGCR3_PERPUBC					(0x1u<<3)
#define	RCC_PUBCFGCR3_BUSPUBC					(0x1u<<2)
#define	RCC_PUBCFGCR3_SYSPUBC					(0x1u<<1)
#define	RCC_PUBCFGCR3_MODPUBC					(0x1u<<0)

// PRIVCFGCR4 Configuration

#define	RCC_PRIVCFGCR4_NOCPVC					(0x1u<<13)
#define	RCC_PRIVCFGCR4_APB5PVC					(0x1u<<12)
#define	RCC_PRIVCFGCR4_APB4PVC					(0x1u<<11)
#define	RCC_PRIVCFGCR4_APB3PVC					(0x1u<<10)
#define	RCC_PRIVCFGCR4_APB2PVC					(0x1u<<9)
#define	RCC_PRIVCFGCR4_APB1PVC					(0x1u<<8)
#define	RCC_PRIVCFGCR4_AHB5PVC					(0x1u<<7)
#define	RCC_PRIVCFGCR4_AHB4PVC					(0x1u<<6)
#define	RCC_PRIVCFGCR4_AHB3PVC					(0x1u<<5)
#define	RCC_PRIVCFGCR4_AHB2PVC					(0x1u<<4)
#define	RCC_PRIVCFGCR4_AHB1PVC					(0x1u<<3)
#define	RCC_PRIVCFGCR4_AHBMPVC					(0x1u<<2)
#define	RCC_PRIVCFGCR4_ACLKNCPVC				(0x1u<<1)
#define	RCC_PRIVCFGCR4_ACLKNPVC					(0x1u<<0)

// PUBCFGCR4 Configuration

#define	RCC_PUBCFGCR4_NOCPUBC					(0x1u<<13)
#define	RCC_PUBCFGCR4_APB5PUBC					(0x1u<<12)
#define	RCC_PUBCFGCR4_APB4PUBC					(0x1u<<11)
#define	RCC_PUBCFGCR4_APB3PUBC					(0x1u<<10)
#define	RCC_PUBCFGCR4_APB2PUBC					(0x1u<<9)
#define	RCC_PUBCFGCR4_APB1PUBC					(0x1u<<8)
#define	RCC_PUBCFGCR4_AHB5PUBC					(0x1u<<7)
#define	RCC_PUBCFGCR4_AHB4PUBC					(0x1u<<6)
#define	RCC_PUBCFGCR4_AHB3PUBC					(0x1u<<5)
#define	RCC_PUBCFGCR4_AHB2PUBC					(0x1u<<4)
#define	RCC_PUBCFGCR4_AHB1PUBC					(0x1u<<3)
#define	RCC_PUBCFGCR4_AHBMPUBC					(0x1u<<2)
#define	RCC_PUBCFGCR4_ACLKNCPUBC				(0x1u<<1)
#define	RCC_PUBCFGCR4_ACLKNPUBC					(0x1u<<0)

// PUBCFGCR5 Configuration

#define	RCC_PUBCFGCR5_VENCRAMPUBC				(0x1u<<11)
#define	RCC_PUBCFGCR5_CACHEAXIRAMPUBC			(0x1u<<10)
#define	RCC_PUBCFGCR5_FLEXRAMPUBC				(0x1u<<9)
#define	RCC_PUBCFGCR5_AXISRAM2PUBC				(0x1u<<8)
#define	RCC_PUBCFGCR5_AXISRAM1PUBC				(0x1u<<7)
#define	RCC_PUBCFGCR5_BKPSRAMPUBC				(0x1u<<6)
#define	RCC_PUBCFGCR5_AHBSRAM2PUBC				(0x1u<<5)
#define	RCC_PUBCFGCR5_AHBSRAM1PUBC				(0x1u<<4)
#define	RCC_PUBCFGCR5_AXISRAM6PUBC				(0x1u<<3)
#define	RCC_PUBCFGCR5_AXISRAM5PUBC				(0x1u<<2)
#define	RCC_PUBCFGCR5_AXISRAM4PUBC				(0x1u<<1)
#define	RCC_PUBCFGCR5_AXISRAM3PUBC				(0x1u<<0)
